
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package AVS_Vehicle.

/// Class /VehicleSystemPlugin/AVS_Vehicle.AVS_Vehicle_C
/// Size: 0x02E8 (0x000560 - 0x000848)
class AAVS_Vehicle_C : public AVehicleSystemBase : AVehicleSystemBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0560   (0x0008)  
	TArray<UVehicle_Wheel_C*>                          wheels;                                                     // 0x0568   (0x0010)  
	bool                                               ConstructCalled;                                            // 0x0578   (0x0001)  
	bool                                               Initialized;                                                // 0x0579   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x057A   (0x0006)  MISSED
	UVehicle_EngineAudio_C*                            EngineAudio;                                                // 0x0580   (0x0008)  
	double                                             RPM;                                                        // 0x0588   (0x0008)  
	double                                             dRPM;                                                       // 0x0590   (0x0008)  
	bool                                               StartWithPhysics;                                           // 0x0598   (0x0001)  
	bool                                               StabilityControl;                                           // 0x0599   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x059A   (0x0006)  MISSED
	double                                             StabilityControlForce;                                      // 0x05A0   (0x0008)  
	bool                                               DynamicAirDrag;                                             // 0x05A8   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x05A9   (0x0007)  MISSED
	double                                             BaseLinearDrag;                                             // 0x05B0   (0x0008)  
	UPhysicalMaterial*                                 physicsMaterial;                                            // 0x05B8   (0x0008)  
	int32_t                                            NumDrivingWheels;                                           // 0x05C0   (0x0004)  
	bool                                               EngineRunning;                                              // 0x05C4   (0x0001)  
	bool                                               AllowPassiveMode;                                           // 0x05C5   (0x0001)  
	bool                                               StartWithEngineRunning;                                     // 0x05C6   (0x0001)  
	bool                                               ZeroThrottleWhileShifting;                                  // 0x05C7   (0x0001)  
	TEnumAsByte<SpeedUnits>                            SpeedUnits;                                                 // 0x05C8   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x05C9   (0x0007)  MISSED
	FSpeedUnit                                         SpeedUnit;                                                  // 0x05D0   (0x0030)  
	double                                             IgnitionTime;                                               // 0x0600   (0x0008)  
	TEnumAsByte<ShifterPositions>                      Shifter;                                                    // 0x0608   (0x0001)  
	bool                                               AutomaticShifterPositon;                                    // 0x0609   (0x0001)  
	bool                                               AutomaticTransmission;                                      // 0x060A   (0x0001)  
	unsigned char                                      UnknownData04_5[0x5];                                       // 0x060B   (0x0005)  MISSED
	double                                             GearSwitchTime;                                             // 0x0610   (0x0008)  
	AAVS_Vehicle_C*                                    InputHost;                                                  // 0x0618   (0x0008)  
	double                                             ThrottleInput;                                              // 0x0620   (0x0008)  
	double                                             Throttle;                                                   // 0x0628   (0x0008)  
	double                                             BrakeInput;                                                 // 0x0630   (0x0008)  
	double                                             Brake;                                                      // 0x0638   (0x0008)  
	double                                             Steering;                                                   // 0x0640   (0x0008)  
	bool                                               isBrakeApplied;                                             // 0x0648   (0x0001)  
	bool                                               HandbrakeApplied;                                           // 0x0649   (0x0001)  
	bool                                               ServerEngineRunning;                                        // 0x064A   (0x0001)  
	unsigned char                                      UnknownData05_5[0x5];                                       // 0x064B   (0x0005)  MISSED
	FTimerHandle                                       IgnitionTimer;                                              // 0x0650   (0x0008)  
	double                                             Acceleration;                                               // 0x0658   (0x0008)  
	double                                             AirSpeed;                                                   // 0x0660   (0x0008)  
	double                                             TargetSpeed;                                                // 0x0668   (0x0008)  
	double                                             Torque;                                                     // 0x0670   (0x0008)  
	double                                             Slip;                                                       // 0x0678   (0x0008)  
	FVehicleGear                                       gear;                                                       // 0x0680   (0x0020)  
	int32_t                                            CurrentGear;                                                // 0x06A0   (0x0004)  
	unsigned char                                      UnknownData06_5[0x4];                                       // 0x06A4   (0x0004)  MISSED
	TArray<UVehicle_LightController_C*>                LightControllers;                                           // 0x06A8   (0x0010)  
	TArray<UVehicle_ExhaustController_C*>              Exhausts;                                                   // 0x06B8   (0x0010)  
	TArray<FName>                                      ActiveLightGroups;                                          // 0x06C8   (0x0010)  
	int32_t                                            PreviousGear;                                               // 0x06D8   (0x0004)  
	bool                                               isShifting;                                                 // 0x06DC   (0x0001)  
	unsigned char                                      UnknownData07_5[0x3];                                       // 0x06DD   (0x0003)  MISSED
	UCurveFloat*                                       ThrottleCurve;                                              // 0x06E0   (0x0008)  
	UCurveFloat*                                       GearCurve;                                                  // 0x06E8   (0x0008)  
	double                                             SteeringInput;                                              // 0x06F0   (0x0008)  
	int32_t                                            GearInput;                                                  // 0x06F8   (0x0004)  
	bool                                               VisualizeCenterOfMass;                                      // 0x06FC   (0x0001)  
	bool                                               OverrideCenterOfMass;                                       // 0x06FD   (0x0001)  
	unsigned char                                      UnknownData08_5[0x2];                                       // 0x06FE   (0x0002)  MISSED
	FVector                                            RelativeCenterOfMass;                                       // 0x0700   (0x0018)  
	FVector                                            DefaultCOM;                                                 // 0x0718   (0x0018)  
	bool                                               AccelerationConfig;                                         // 0x0730   (0x0001)  
	unsigned char                                      UnknownData09_5[0x7];                                       // 0x0731   (0x0007)  MISSED
	double                                             TargetAcceleration;                                         // 0x0738   (0x0008)  
	double                                             DynamicMaxTorque;                                           // 0x0740   (0x0008)  
	FVector                                            CenterOfMassOffset;                                         // 0x0748   (0x0018)  
	double                                             IdleRPM;                                                    // 0x0760   (0x0008)  
	double                                             IdleMaxRPM;                                                 // 0x0768   (0x0008)  
	bool                                               SyncAsTrailer;                                              // 0x0770   (0x0001)  
	unsigned char                                      UnknownData10_5[0x7];                                       // 0x0771   (0x0007)  MISSED
	FTimerHandle                                       TrailerSyncTimer;                                           // 0x0778   (0x0008)  
	FRotator                                           LocalTrailerRotation;                                       // 0x0780   (0x0018)  
	FRotator                                           HostTrailerRotation;                                        // 0x0798   (0x0018)  
	UVehicle_Hitch_C*                                  NetworkTowHitch;                                            // 0x07B0   (0x0008)  
	UVehicle_Hitch_C*                                  NetworkTrailerHitch;                                        // 0x07B8   (0x0008)  
	double                                             VehicleMaxAngularVelocity;                                  // 0x07C0   (0x0008)  
	bool                                               WheelReprojection;                                          // 0x07C8   (0x0001)  
	unsigned char                                      UnknownData11_5[0x7];                                       // 0x07C9   (0x0007)  MISSED
	double                                             ReprojectionSmoothAlpha;                                    // 0x07D0   (0x0008)  
	double                                             TickDelta;                                                  // 0x07D8   (0x0008)  
	bool                                               CinematicPlayback;                                          // 0x07E0   (0x0001)  
	bool                                               WheelReprojectionCamber;                                    // 0x07E1   (0x0001)  
	unsigned char                                      UnknownData12_5[0x6];                                       // 0x07E2   (0x0006)  MISSED
	FVector2D                                          CamberCompressed;                                           // 0x07E8   (0x0010)  
	FVector2D                                          CamberDecompressed;                                         // 0x07F8   (0x0010)  
	bool                                               ContactModificationDirty;                                   // 0x0808   (0x0001)  
	unsigned char                                      UnknownData13_5[0x7];                                       // 0x0809   (0x0007)  MISSED
	FTimerHandle                                       TPS_Timer;                                                  // 0x0810   (0x0008)  
	double                                             LocalSteeringInput;                                         // 0x0818   (0x0008)  
	bool                                               SuspensionDebug;                                            // 0x0820   (0x0001)  
	bool                                               DisplayDebugMenu;                                           // 0x0821   (0x0001)  
	unsigned char                                      UnknownData14_5[0x6];                                       // 0x0822   (0x0006)  MISSED
	UVehicleSetup_HUD_C*                               DebugMenu;                                                  // 0x0828   (0x0008)  
	TArray<UPrimitiveComponent*>                       DebugMeshes;                                                // 0x0830   (0x0010)  
	UStaticMeshComponent*                              DebugCOM;                                                   // 0x0840   (0x0008)  


	/// Functions
	// Function /VehicleSystemPlugin/AVS_Vehicle.AVS_Vehicle_C.CalculateSteering
	void CalculateSteering();                                                                                                // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /VehicleSystemPlugin/AVS_Vehicle.AVS_Vehicle_C.TickInputs
	void TickInputs();                                                                                                       // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /VehicleSystemPlugin/AVS_Vehicle.AVS_Vehicle_C.GetBrake
	void GetBrake(double& Brake);                                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
