
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package Backpacks.

/// Struct /Game/Backpacks/backpack_standard/Backpack_Skeleton_AnimBlueprint.Backpack_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0177 (0x000001 - 0x000178)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0010   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0020   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0021   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0024   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x002C   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0030   (0x0008)  
	float                                              __FloatProperty;                                            // 0x0038   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x003C   (0x002C)  
	float                                              __FloatProperty;                                            // 0x0068   (0x0004)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x006C   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x006D   (0x0001)  
	unsigned char                                      UnknownData03_5[0x2];                                       // 0x006E   (0x0002)  MISSED
	FName                                              __NameProperty;                                             // 0x0070   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0078   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0080   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0084   (0x0008)  
	FName                                              __NameProperty;                                             // 0x008C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0094   (0x0004)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0098   (0x0020)  
	UBlendProfile*                                     __BlendProfile;                                             // 0x00B8   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x00C0   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x00C8   (0x0001)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x00C9   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x00CA   (0x0001)  
	unsigned char                                      UnknownData04_5[0x5];                                       // 0x00CB   (0x0005)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x00D0   (0x0010)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00E0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0160   (0x0018)  
};

/// Struct /Game/Backpacks/backpack_standard/Backpack_Skeleton_AnimBlueprint.Backpack_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0002 (0x000001 - 0x000003)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	char                                               __ByteProperty;                                             // 0x0001   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0002   (0x0001)  
};

/// Struct /Game/Backpacks/BackpackMidTextures/ABP_BackpackMid.ABP_BackpackMid_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0177 (0x000001 - 0x000178)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0008   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0010   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0018   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x0019   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x001A   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0020   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0030   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0040   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0041   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0044   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x004C   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0050   (0x0008)  
	float                                              __FloatProperty;                                            // 0x0058   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x005C   (0x002C)  
	float                                              __FloatProperty;                                            // 0x0088   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x008C   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x008D   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x008E   (0x0001)  
	unsigned char                                      UnknownData03_5[0x1];                                       // 0x008F   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x0090   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0098   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x00A0   (0x0004)  
	FName                                              __NameProperty;                                             // 0x00A4   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x00AC   (0x0004)  
	FName                                              __NameProperty;                                             // 0x00B0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00B8   (0x0008)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x00C0   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00E0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0160   (0x0018)  
};

/// Struct /Game/Backpacks/BackpackMidTextures/ABP_BackpackMid.ABP_BackpackMid_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	char                                               __ByteProperty;                                             // 0x0001   (0x0001)  
};

/// Struct /Game/Backpacks/Tier3/Backpack_TIER3_Skeleton_AnimBlueprint.Backpack_TIER3_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00F7 (0x000001 - 0x0000F8)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0018   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0020   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0028   (0x0001)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0029   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x002A   (0x0001)  
	unsigned char                                      UnknownData02_5[0x5];                                       // 0x002B   (0x0005)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0030   (0x0010)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0040   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0060   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00E0   (0x0018)  
};

/// Struct /Game/Backpacks/Tier3/Backpack_TIER3_Skeleton_AnimBlueprint.Backpack_TIER3_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
};

/// Class /Game/Backpacks/backpack_standard/Backpack_Skeleton_AnimBlueprint.Backpack_Skeleton_AnimBlueprint_C
/// Size: 0x13AB (0x000350 - 0x0016FB)
class UBackpack_Skeleton_AnimBlueprint_C : public UAnimInstance : UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x0358   (0x0003)  
	unsigned char                                      UnknownData00_5[0x5];                                       // 0x035B   (0x0005)  MISSED
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0368   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0370   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0390   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x03B0   (0x0020)  
	FAnimNode_RigidBody                                AnimGraphNode_RigidBody;                                    // 0x03D0   (0x09A0)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0D70   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0DB8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0DE0   (0x0028)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x0E08   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0E50   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0E78   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0EA0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0EE8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0F08   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0F50   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0F70   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0FB8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0FD8   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x10A0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x10C8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x10F0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x1138   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x1158   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x11A0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x11C0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x1208   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x1228   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x12F0   (0x0020)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x1310   (0x01D8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x14E8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x1508   (0x00C8)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x15D0   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x1698   (0x0048)  
	USkeletalMeshComponent*                            CharMesh;                                                   // 0x16E0   (0x0008)  
	TEnumAsByte<CraftState>                            CraftState;                                                 // 0x16E8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x16E9   (0x0007)  MISSED
	ASurvivalPlayer_C*                                 Player;                                                     // 0x16F0   (0x0008)  
	TEnumAsByte<StanceState>                           Stance;                                                     // 0x16F8   (0x0001)  
	bool                                               backpackDressed;                                            // 0x16F9   (0x0001)  
	bool                                               Valid;                                                      // 0x16FA   (0x0001)  


	/// Functions
	// Function /Game/Backpacks/backpack_standard/Backpack_Skeleton_AnimBlueprint.Backpack_Skeleton_AnimBlueprint_C.AnimGraph
	void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Backpacks/backpack_standard/Backpack_Skeleton_AnimBlueprint.Backpack_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Backpack_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_81597CFD40297B42AA2897815DF05875
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Backpack_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_81597CFD40297B42AA2897815DF05875(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Backpacks/backpack_standard/Backpack_Skeleton_AnimBlueprint.Backpack_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Backpack_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_D65B6D4847EEC5C1F5571599D8FA8EC6
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Backpack_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_D65B6D4847EEC5C1F5571599D8FA8EC6(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Backpacks/backpack_standard/Backpack_Skeleton_AnimBlueprint.Backpack_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Backpack_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_118C52D04641AC71C12A07B876F46156
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Backpack_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_118C52D04641AC71C12A07B876F46156(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Backpacks/backpack_standard/Backpack_Skeleton_AnimBlueprint.Backpack_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
	void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Backpacks/backpack_standard/Backpack_Skeleton_AnimBlueprint.Backpack_Skeleton_AnimBlueprint_C.BackpackSetCraftState
	void BackpackSetCraftState(TEnumAsByte<CraftState> State);                                                               // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Backpacks/backpack_standard/Backpack_Skeleton_AnimBlueprint.Backpack_Skeleton_AnimBlueprint_C.BlueprintInitializeAnimation
	void BlueprintInitializeAnimation();                                                                                     // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Backpacks/backpack_standard/Backpack_Skeleton_AnimBlueprint.Backpack_Skeleton_AnimBlueprint_C.AnimNotify_Backpack_dressed
	void AnimNotify_Backpack_dressed();                                                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Backpacks/backpack_standard/Backpack_Skeleton_AnimBlueprint.Backpack_Skeleton_AnimBlueprint_C.AnimNotify_BeginCraft
	void AnimNotify_BeginCraft();                                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Backpacks/backpack_standard/Backpack_Skeleton_AnimBlueprint.Backpack_Skeleton_AnimBlueprint_C.ExecuteUbergraph_Backpack_Skeleton_AnimBlueprint
	void ExecuteUbergraph_Backpack_Skeleton_AnimBlueprint(int32_t EntryPoint);                                               // [0x2407bf0] Final                
};

/// Class /Game/Backpacks/BP/BPI_Backpack_Anims.BPI_Backpack_Anims_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBPI_Backpack_Anims_C : public UInterface : UInterface
{ 
public:
};

/// Class /Game/Backpacks/BackpackMidTextures/ABP_BackpackMid.ABP_BackpackMid_C
/// Size: 0x136B (0x000350 - 0x0016BB)
class UABP_BackpackMid_C : public UAnimInstance : UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x0358   (0x0002)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x035A   (0x0006)  MISSED
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0368   (0x0008)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0370   (0x0020)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0390   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x03D8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0400   (0x0028)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x0428   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0470   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0498   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x04C0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0508   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0528   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0570   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0590   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x05D8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x05F8   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x06C0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x06E8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0710   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0758   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0778   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x07C0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x07E0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0828   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0848   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0910   (0x0020)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0930   (0x01D8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0B08   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0B28   (0x00C8)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0BF0   (0x00C8)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0CB8   (0x0020)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0CD8   (0x0020)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x0CF8   (0x0008)  MISSED
	FAnimNode_RigidBody                                AnimGraphNode_RigidBody;                                    // 0x0D00   (0x09A0)  
	USkeletalMeshComponent*                            CharMesh;                                                   // 0x16A0   (0x0008)  
	TEnumAsByte<CraftState>                            CraftState;                                                 // 0x16A8   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x16A9   (0x0007)  MISSED
	ASurvivalPlayer_C*                                 Player;                                                     // 0x16B0   (0x0008)  
	TEnumAsByte<StanceState>                           Stance;                                                     // 0x16B8   (0x0001)  
	bool                                               backpackDressed;                                            // 0x16B9   (0x0001)  
	bool                                               Valid;                                                      // 0x16BA   (0x0001)  


	/// Functions
	// Function /Game/Backpacks/BackpackMidTextures/ABP_BackpackMid.ABP_BackpackMid_C.AnimGraph
	void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);                                                                  // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Backpacks/BackpackMidTextures/ABP_BackpackMid.ABP_BackpackMid_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BackpackMid_AnimGraphNode_TransitionResult_6EFD43A846841971BA90238EF326F96E
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BackpackMid_AnimGraphNode_TransitionResult_6EFD43A846841971BA90238EF326F96E(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Backpacks/BackpackMidTextures/ABP_BackpackMid.ABP_BackpackMid_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BackpackMid_AnimGraphNode_TransitionResult_0F830878441A68BF75E3C58737424A3A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BackpackMid_AnimGraphNode_TransitionResult_0F830878441A68BF75E3C58737424A3A(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Backpacks/BackpackMidTextures/ABP_BackpackMid.ABP_BackpackMid_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BackpackMid_AnimGraphNode_TransitionResult_B11579014ADEF1D2499DF08F606AEC4C
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BackpackMid_AnimGraphNode_TransitionResult_B11579014ADEF1D2499DF08F606AEC4C(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Backpacks/BackpackMidTextures/ABP_BackpackMid.ABP_BackpackMid_C.BlueprintUpdateAnimation
	void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Backpacks/BackpackMidTextures/ABP_BackpackMid.ABP_BackpackMid_C.BackpackSetCraftState
	void BackpackSetCraftState(TEnumAsByte<CraftState> State);                                                               // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Backpacks/BackpackMidTextures/ABP_BackpackMid.ABP_BackpackMid_C.BlueprintInitializeAnimation
	void BlueprintInitializeAnimation();                                                                                     // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Backpacks/BackpackMidTextures/ABP_BackpackMid.ABP_BackpackMid_C.AnimNotify_Backpack_dressed
	void AnimNotify_Backpack_dressed();                                                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Backpacks/BackpackMidTextures/ABP_BackpackMid.ABP_BackpackMid_C.AnimNotify_BeginCraft
	void AnimNotify_BeginCraft();                                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Backpacks/BackpackMidTextures/ABP_BackpackMid.ABP_BackpackMid_C.ExecuteUbergraph_ABP_BackpackMid
	void ExecuteUbergraph_ABP_BackpackMid(int32_t EntryPoint);                                                               // [0x2407bf0] Final                
};

/// Class /Game/Backpacks/Tier3/Backpack_TIER3_Skeleton_AnimBlueprint.Backpack_TIER3_Skeleton_AnimBlueprint_C
/// Size: 0x0E78 (0x000350 - 0x0011C8)
class UBackpack_TIER3_Skeleton_AnimBlueprint_C : public UAnimInstance : UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x0358   (0x0002)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x035A   (0x0006)  MISSED
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0368   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0370   (0x0020)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0390   (0x0048)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x03D8   (0x01D8)  
	FAnimNode_RigidBody                                AnimGraphNode_RigidBody;                                    // 0x05B0   (0x09A0)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0F50   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0F70   (0x0020)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0F90   (0x0048)  
	FAnimNode_CopyPoseFromMesh                         AnimGraphNode_CopyPoseFromMesh;                             // 0x0FD8   (0x01D8)  
	USkeletalMeshComponent*                            CharMesh;                                                   // 0x11B0   (0x0008)  
	bool                                               Player_in_Cutscene;                                         // 0x11B8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x11B9   (0x0007)  MISSED
	UPlayerCutsceneComponent_C*                        CutscenePlayer;                                             // 0x11C0   (0x0008)  


	/// Functions
	// Function /Game/Backpacks/Tier3/Backpack_TIER3_Skeleton_AnimBlueprint.Backpack_TIER3_Skeleton_AnimBlueprint_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Backpacks/Tier3/Backpack_TIER3_Skeleton_AnimBlueprint.Backpack_TIER3_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
	void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Backpacks/Tier3/Backpack_TIER3_Skeleton_AnimBlueprint.Backpack_TIER3_Skeleton_AnimBlueprint_C.BlueprintInitializeAnimation
