
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package Blueprints.

/// Struct /Game/Blueprints/DayTimeSystem/Old/TrueSky/CustomIllumination/Illumination.Illumination
/// Size: 0x0008 (0x000000 - 0x000008)
struct FIllumination
{ 
	float                                              Intensity_6_17F46BB04257A6C40C96D986CBF655F6;               // 0x0000   (0x0004)  
	FColor                                             LightColor_9_5F6DE88C483C0B11F86A5BB605B1778F;              // 0x0004   (0x0004)  
};

/// Struct /Game/Blueprints/CampingSystem/Bag/BPA_SleepingBag.BPA_SleepingBag_C.AnimBlueprintGeneratedConstantData
/// Size: 0x012F (0x000001 - 0x000130)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0014   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0018   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0019   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x001C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0024   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0028   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x002C   (0x002C)  
	float                                              __FloatProperty;                                            // 0x0058   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x005C   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x005D   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x005E   (0x0001)  
	unsigned char                                      UnknownData02_5[0x1];                                       // 0x005F   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x0060   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0068   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0070   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x0074   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0078   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0098   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0118   (0x0018)  
};

/// Struct /Game/Blueprints/CampingSystem/Bag/SleepingBagStubAnim.SleepingBagStubAnim_C.AnimBlueprintGeneratedConstantData
/// Size: 0x011F (0x000001 - 0x000120)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0014   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0018   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0019   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x001C   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0020   (0x002C)  
	float                                              __FloatProperty;                                            // 0x004C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0050   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0051   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x0052   (0x0001)  
	unsigned char                                      UnknownData02_5[0x1];                                       // 0x0053   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x0054   (0x0008)  
	FName                                              __NameProperty;                                             // 0x005C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0064   (0x0004)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0068   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0088   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0108   (0x0018)  
};

/// Struct /Game/Blueprints/EquipmentData/EquipmentTier.EquipmentTier
/// Size: 0x000C (0x000000 - 0x00000C)
struct FEquipmentTier
{ 
	FName                                              Id_5_598409294D16706C8F546498C288C018;                      // 0x0000   (0x0008)  
	int32_t                                            Tier_2_B719BDFB4A0E69F6473144BF00199A48;                    // 0x0008   (0x0004)  
};

/// Struct /Game/Blueprints/CameraStuff/CameraSettings.CameraSettings
/// Size: 0x0024 (0x000000 - 0x000024)
struct FCameraSettings
{ 
	float                                              SpringArmLength_2_A0B81846478BDFD9971D2A8D96044273;         // 0x0000   (0x0004)  
	float                                              CameraHeight_9_C3BF45FB4C9C0EB02FFC4F9575CF9A62;            // 0x0004   (0x0004)  
	FVector                                            SocketOffset_5_3894B6334CF92741FE22C1975FF3C874;            // 0x0008   (0x0018)  
	float                                              CameraFOV_12_39D72C374F662F889AD9F4B552665627;              // 0x0020   (0x0004)  
};

/// Struct /Game/Blueprints/SquadSystem/S_SaveStructure.S_SaveStructure
/// Size: 0x01B0 (0x000000 - 0x0001B0)
struct FS_SaveStructure
{ 
	USkeletalMesh*                                     Face_17_84A25235429B7D1844F39EB4777FC471;                   // 0x0000   (0x0008)  
	USkeletalMesh*                                     Beard_18_328C6CC44A2D6F5C87DE2093B8CE17B0;                  // 0x0008   (0x0008)  
	USkeletalMesh*                                     Body_19_CA09A0EC401C30EEE051268AEFF0182C;                   // 0x0010   (0x0008)  
	USkeletalMesh*                                     Hair_20_8B0BD0754F1E5FAC6411C188037A968A;                   // 0x0018   (0x0008)  
	USkeletalMesh*                                     Legs_21_AEE22FB844A875069F31199B547B64A0;                   // 0x0020   (0x0008)  
	FLinearColor                                       EyeColor_15_986BFE2341E4D18B64C585A1060ADBB7;               // 0x0028   (0x0010)  
	FLinearColor                                       HairColor_16_58DC3FB4429347BEBAD00DA67BF22423;              // 0x0038   (0x0010)  
	UMaterialInstance*                                 Head_27_4C3E49C74C0F9C553E21CEB8C142C906;                   // 0x0048   (0x0008)  
	UMaterialInstance*                                 BodyLegs_28_416CD7C147C686FD852970BF988B5DAF;               // 0x0050   (0x0008)  
	UMaterial*                                         RHand_32_DD7ECD424F14E09A3CEA628E2772BA58;                  // 0x0058   (0x0008)  
	UMaterial*                                         Lhand_33_44FB03374A36B8DD036515B985BFE0FC;                  // 0x0060   (0x0008)  
	bool                                               Woman_35_9A83B10C450E4185AE0E519953CF7C98;                  // 0x0068   (0x0001)  
	bool                                               Black_37_C5422CC44ED0B39317C799BDC50EBD99;                  // 0x0069   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x006A   (0x0006)  MISSED
	double                                             SkinTone_40_1DA8C6E44725FA5F147B7BB0E1CC381B;               // 0x0070   (0x0008)  
	double                                             UseMakeup_43_F75559E0439C88524B88A5AB4FA8A84F;              // 0x0078   (0x0008)  
	double                                             ScalarMakeupSelector_45_BC39796541267BE9165B4284FE4E685A;   // 0x0080   (0x0008)  
	double                                             ScalarTexture_47_BF8CFA1C4290D6B792CC098C6911C46B;          // 0x0088   (0x0008)  
	double                                             ScarSelector_49_A671FA2B4D5DAC24BA9ABF8F5908652C;           // 0x0090   (0x0008)  
	double                                             ScalarUseScar_51_8595D82F43BD409063750A99C637E67A;          // 0x0098   (0x0008)  
	TArray<FName>                                      SelectedTraits_63_4168252445B15AD0C248B3B391303283;         // 0x00A0   (0x0010)  
	FString                                            HouseArray_64_C2F210CC485A9D5F974D2281938243D9;             // 0x00B0   (0x0010)  
	TArray<FString>                                    PlayerStatus_68_EC6BCD2F4A95692CAD157C832A1C8C0E;           // 0x00C0   (0x0010)  
	double                                             Age_72_4F3577D1404D763E0924BB8BBEE7C5B6;                    // 0x00D0   (0x0008)  
	double                                             Freckles_74_F1999D004869CFF85C93C5B810F76A35;               // 0x00D8   (0x0008)  
	double                                             TattoDepth_76_F672499D43935EB3FED823BF7168FEF5;             // 0x00E0   (0x0008)  
	double                                             MakeupDepth_78_C08EE2DB410B549E625C0C99A6D36863;            // 0x00E8   (0x0008)  
	double                                             MakeupMetallic_80_C56E15774887EBA8FD61A3A16FA8F619;         // 0x00F0   (0x0008)  
	double                                             MakeupGloss_82_8EC143734FBF7E68E491C2B9382DF495;            // 0x00F8   (0x0008)  
	double                                             LipsDepth_84_19951262423E08679CB9F4AD7C16F482;              // 0x0100   (0x0008)  
	double                                             LipsMetallic_86_32D6F63A40BFE6F5A8C33FACE60912EA;           // 0x0108   (0x0008)  
	double                                             LipsGloss_88_6D26ACAF4C16CF17468F24A83D91E785;              // 0x0110   (0x0008)  
	double                                             Tattoo_91_56E54F624DA7D534F28FB48561613402;                 // 0x0118   (0x0008)  
	double                                             Makeup_92_8C05390C41146778C0542F8120124B14;                 // 0x0120   (0x0008)  
	FLinearColor                                       TattooColor_95_6011B10C420ED4AF236395B22B2A04E4;            // 0x0128   (0x0010)  
	FLinearColor                                       BeardColor_99_B441E3CB424F732290A55C86D83C9F8F;             // 0x0138   (0x0010)  
	FLinearColor                                       LipsColor_100_0B134CC04771D44C4B8C249D8A1FD24C;             // 0x0148   (0x0010)  
	FLinearColor                                       MakeupColor_101_D65CA9444F4F844BBD33ECA41CDB8246;           // 0x0158   (0x0010)  
	FString                                            Class_104_80F23A9B4F910BF5A7097AA2ADF85316;                 // 0x0168   (0x0010)  
	double                                             FmodIndex_107_089C767D454D0C256B1859B2BB88EA20;             // 0x0178   (0x0008)  
	FName                                              CCS_Helmet_110_DCCA494F4B7E00BB5E4FF7BBD501DD5E;            // 0x0180   (0x0008)  
	FName                                              CCS_Armor_112_159E978F470DD71E8C34CA9FDEAD841F;             // 0x0188   (0x0008)  
	FName                                              CCS_Rukzak_114_45336E4346FE0844D69F3480921B2853;            // 0x0190   (0x0008)  
	FName                                              CCS_Body_117_E78DFD19448329D822C55AB19DA9100F;              // 0x0198   (0x0008)  
	FName                                              CCS_Pants_118_A13BF06641C33DDA67D2A4A7F6EF34D6;             // 0x01A0   (0x0008)  
	double                                             IntensityMask_121_C3B067CE46F20ECF844E57A139F8C638;         // 0x01A8   (0x0008)  
};

/// Struct /Game/Blueprints/Structs/LocalPhysicConstraintStruct.LocalPhysicConstraintStruct
/// Size: 0x0018 (0x000000 - 0x000018)
struct FLocalPhysicConstraintStruct
{ 
	USceneComponent*                                   Root_2_DC3B969342024335E05F96A632F7FB4F;                    // 0x0000   (0x0008)  
	TArray<USceneComponent*>                           Children_6_FE9FEE1C413233D3CDA966BC5A2FB9A6;                // 0x0008   (0x0010)  
};

/// Struct /Game/Blueprints/QuestSystem/V4/Quest.Quest
/// Size: 0x0048 (0x000000 - 0x000048)
struct FQuest
{ 
	FText                                              QuestName_2_42D869294843FBDEEBCA179F4F9CC7CC;               // 0x0000   (0x0018)  
	bool                                               OrderRequired_6_9426F5D7483FB110C1CBB1AEF2476D63;           // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0019   (0x0007)  MISSED
	FText                                              ObjDescription_14_3CC935074B1D475BA81F96996FFDC42E;         // 0x0020   (0x0018)  
	TArray<FObjective>                                 Objectives_10_C496587347716426C09788A57319274E;             // 0x0038   (0x0010)  
};

/// Struct /Game/Blueprints/QuestSystem/V4/Objective.Objective
/// Size: 0x0039 (0x000000 - 0x000039)
struct FObjective
{ 
	FText                                              ObjectiveName_2_09A97265469A499A52F4ABBAE5A10D93;           // 0x0000   (0x0018)  
	bool                                               PlaySound_5_609D5D3F437A858A8DD2338437003C4D;               // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0019   (0x0007)  MISSED
	FVector                                            MarkLocation_11_8D8FAEEB4699D46CFF96779685EEE281;           // 0x0020   (0x0018)  
	bool                                               Simultaneously_13_2FD87A474DC98A0DC9790192295FD0A0;         // 0x0038   (0x0001)  
};

/// Struct /Game/Blueprints/TauntsSystem/S_TauntStruct.S_TauntStruct
/// Size: 0x0091 (0x000000 - 0x000091)
struct FS_TauntStruct
{ 
	TWeakObjectPtr<UAnimMontage*>                      Start_15_9C5C83E44AC6C17ABC11C69DEABBBBFB;                  // 0x0000   (0x0030)  
	TWeakObjectPtr<UAnimMontage*>                      Loop_16_D0F33C27454A6F9FE164DEA6433EFE1E;                   // 0x0030   (0x0030)  
	TWeakObjectPtr<UAnimMontage*>                      End_17_FBCE097048AF6362C93D5998726D65D8;                    // 0x0060   (0x0030)  
	bool                                               OneAnim__14_5B6F99E54706DB5FB747C9890714E654;               // 0x0090   (0x0001)  
};

/// Struct /Game/Blueprints/StatsStruct.StatsStruct
/// Size: 0x0040 (0x000000 - 0x000040)
struct FStatsStruct
{ 
	int32_t                                            SurvivingTimeSeconds_4_4FDFC31B40E1003FFE1FB7988A8C1AEC;    // 0x0000   (0x0004)  
	int32_t                                            PlayersKilled_6_953670B446DEEC33FB1B32B66EC2EAE9;           // 0x0004   (0x0004)  
	int32_t                                            ZombiesKilled_8_2574650E4D7F3F7E10DE78999D002842;           // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	double                                             DamageDealt_27_763FA48F4FCA170BD429988FDEA232D1;            // 0x0010   (0x0008)  
	double                                             DamageTaken_28_6EA8BCC24778E104C634FA90647CFBFF;            // 0x0018   (0x0008)  
	double                                             LongestHeadshot_29_5777EDA44719C18939A506812854E376;        // 0x0020   (0x0008)  
	double                                             Accuracy_17_3215E800444F1AA261E3DA95888E3FA4;               // 0x0028   (0x0008)  
	int32_t                                            WalkedDistance_20_472D93EC4D0AB88DCE5D07ACED8C4DFB;         // 0x0030   (0x0004)  
	int32_t                                            MedsUsed_22_D68EAE934FECDBA7CB469E99E69E6F55;               // 0x0034   (0x0004)  
	int32_t                                            DrinksUsed_24_23866E1A4B32B05D643012A1A8A3ECFB;             // 0x0038   (0x0004)  
	int32_t                                            FoodUsed_26_13322EFF49B9ED3FB11003B87D119BBB;               // 0x003C   (0x0004)  
};

/// Struct /Game/Blueprints/Structs/VelocityBlend.VelocityBlend
/// Size: 0x0010 (0x000000 - 0x000010)
struct FVelocityBlend
{ 
	float                                              F_2_A0C9E5DA40077901CD1543A982F747E9;                       // 0x0000   (0x0004)  
	float                                              B_4_7007D08B40D994FF120C07AC9D1464DD;                       // 0x0004   (0x0004)  
	float                                              L_6_1725724F42A40EA650EB3DB199AE2789;                       // 0x0008   (0x0004)  
	float                                              R_8_0A344B594D4F492893F0C88675AFD701;                       // 0x000C   (0x0004)  
};

/// Struct /Game/Blueprints/SquadSystem/Lobby/ABP_CreateCharacter.ABP_CreateCharacter_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0177 (0x000001 - 0x000178)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0014   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0018   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0020   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0024   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x002C   (0x0004)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0030   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0040   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0050   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0051   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0054   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0058   (0x002C)  
	float                                              __FloatProperty;                                            // 0x0084   (0x0004)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0088   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x0089   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x008A   (0x0002)  MISSED
	FName                                              __NameProperty;                                             // 0x008C   (0x0008)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x0094   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0098   (0x0020)  
	UBlendProfile*                                     __BlendProfile;                                             // 0x00B8   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x00C0   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x00C8   (0x0001)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x00C9   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x00CA   (0x0001)  
	unsigned char                                      UnknownData04_5[0x5];                                       // 0x00CB   (0x0005)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x00D0   (0x0010)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00E0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0160   (0x0018)  
};

/// Struct /Game/Blueprints/SquadSystem/Lobby/ABP_CreateCharacter.ABP_CreateCharacter_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0017 (0x000001 - 0x000018)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            __IntProperty;                                              // 0x0004   (0x0004)  
	int32_t                                            __IntProperty;                                              // 0x0008   (0x0004)  
	int32_t                                            __IntProperty;                                              // 0x000C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0010   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0011   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x0012   (0x0002)  MISSED
	int32_t                                            __IntProperty;                                              // 0x0014   (0x0004)  
};

/// Struct /Game/Blueprints/LightDestractionSystem/TurnOffTheLightsStruct.TurnOffTheLightsStruct
/// Size: 0x0010 (0x000000 - 0x000010)
struct FTurnOffTheLightsStruct
{ 
	TArray<UMaterialInstance*>                         Materials_3_E0CB93574FD82EC310DB479C3ADB4C73;               // 0x0000   (0x0010)  
};

/// Struct /Game/Blueprints/QuestSystem/V2/Quests/ItemCount.ItemCount
/// Size: 0x0014 (0x000000 - 0x000014)
struct FItemCount
{ 
	FString                                            item_name_2_2289CE164EEDC891382481BF520EF055;               // 0x0000   (0x0010)  
	int32_t                                            need_count_5_1E6A6C2C428B6B3A3A007B93D5C92753;              // 0x0010   (0x0004)  
};

/// Struct /Game/Blueprints/DayCycle/S_AtmosphereSettings.S_AtmosphereSettings
/// Size: 0x0044 (0x000000 - 0x000044)
struct FS_AtmosphereSettings
{ 
	float                                              SL_Intensity_50_69FB4F5446B59EA32100C595DD483A68;           // 0x0000   (0x0004)  
	FLinearColor                                       SL_LightColor_51_B89F4FA244119CEBCE32D7A7CEEB9650;          // 0x0004   (0x0010)  
	FLinearColor                                       SL_LowerHemisphereColor_52_4EE9548A4B50E3860C960C85A28F57E4; // 0x0014   (0x0010)  
	float                                              SL_OcclusionExponent_53_38E9E1224D6AC35450BA678C04976251;   // 0x0024   (0x0004)  
	FColor                                             SL_OcclusionTint_54_43BB452A41C90FBCCDC289B84AD67C36;       // 0x0028   (0x0004)  
	FLinearColor                                       SL_FogInscatteringColor_55_9EA52A5F4D40F699849E9AA00685F8B3; // 0x002C   (0x0010)  
	float                                              SL_VolumetricFogScatteringDistribution_56_BD91F68E427F70BAEEB4A783AADB362C; // 0x003C   (0x0004)  
	float                                              HF_ExtinctionScale_58_29862F3B4DF199B5BD126E8019FBC92F;     // 0x0040   (0x0004)  
};

/// Struct /Game/Blueprints/DayCycle/S_TimeSettings.S_TimeSettings
/// Size: 0x0018 (0x000000 - 0x000018)
struct FS_TimeSettings
{ 
	float                                              Value_4_5A555B734FB30485437628AED5AE02D8;                   // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	FString                                            Description_7_434406BA4E91496BE75AEFA7F1C65B25;             // 0x0008   (0x0010)  
};

/// Struct /Game/Blueprints/SquadSystem/PlayerStatesArray.PlayerStatesArray
/// Size: 0x0010 (0x000000 - 0x000010)
struct FPlayerStatesArray
{ 
	TArray<APS_TDB_C*>                                 PlayerStates_5_2F0CD2FF4988F085C89B6CB20D93EDBD;            // 0x0000   (0x0010)  
};

/// Struct /Game/Blueprints/QuestSystem/V2/CustomQuestData.CustomQuestData
/// Size: 0x001C (0x000000 - 0x00001C)
struct FCustomQuestData
{ 
	bool                                               BoolValue_1_D6A1AEB642E93CA90323FAB881CE2850;               // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	FString                                            StringValue_7_C2CD122240607D22C0626B80B1B21E6F;             // 0x0008   (0x0010)  
	int32_t                                            IntValue_6_CCA6C5974C118536505B0BA385782ECF;                // 0x0018   (0x0004)  
};

/// Struct /Game/Blueprints/QuestSystem/V2/SideQuestData.SideQuestData
/// Size: 0x0040 (0x000000 - 0x000040)
struct FSideQuestData
{ 
	FString                                            ID_13_49EFDF094EB53B0E8A9D6F9508628521;                     // 0x0000   (0x0010)  
	FString                                            Name_3_B5B59193468B790801903E9BD7CCBA67;                    // 0x0010   (0x0010)  
	FString                                            StartTrigger_5_5BB841604075C5C5B25CB3B226A6F4B4;            // 0x0020   (0x0010)  
	TArray<FQuestData>                                 QuestsData_9_BBD6833E45A44B98E1940C99DFD1A847;              // 0x0030   (0x0010)  
};

/// Struct /Game/Blueprints/QuestSystem/V2/QuestData.QuestData
/// Size: 0x0058 (0x000000 - 0x000058)
struct FQuestData
{ 
	int32_t                                            ID_2_151043174ED423111262AE8D19B0F389;                      // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	FString                                            Hint_6_53781C2244DE841CAD23F7AD5AEED911;                    // 0x0008   (0x0010)  
	FString                                            TriggerEvent_8_C6C481634F9338FD77F54588C8B3D21F;            // 0x0018   (0x0010)  
	TEnumAsByte<QuestType>                             Type_11_38227A3D41A20FBC971CAC9DAAACDDB4;                   // 0x0028   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0029   (0x0007)  MISSED
	TArray<FCustomQuestData>                           CustomData_17_7967CD0544B37E69DFEAF6A5D1E7D048;             // 0x0030   (0x0010)  
	bool                                               HasMarker_19_01F5F5CF4E172D3F541F5F93CC493C2C;              // 0x0040   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0041   (0x0007)  MISSED
	TArray<FVector>                                    Positions_25_5B73C80A4A3061B7EF3D7A84C5368990;              // 0x0048   (0x0010)  
};

/// Struct /Game/Blueprints/WeaponsSystem/S_GameplaySettings.S_GameplaySettings
/// Size: 0x0010 (0x000000 - 0x000010)
struct FS_GameplaySettings
{ 
	double                                             BulletSpeedMultiplier_3_CE75C03F48B29D854A3119A53313C34D;   // 0x0000   (0x0008)  
	double                                             BulletSlowCoeficient_6_7DE9E0034D4734BDFB8AC58F08F6FE6F;    // 0x0008   (0x0008)  
};

/// Struct /Game/Blueprints/WeaponsSystem/S_BulletInfo.S_BulletInfo
/// Size: 0x0010 (0x000000 - 0x000010)
struct FS_BulletInfo
{ 
	double                                             TrueCaliber_10_F6E7B5074277F68076F69598EB5BA9A6;            // 0x0000   (0x0008)  
	double                                             Mass_8_D7DC7FAC4D4978C658C7428E94FEC113;                    // 0x0008   (0x0008)  
};

/// Struct /Game/Blueprints/WeaponsSystem/DataStructure/PenetrationData.PenetrationData
/// Size: 0x0014 (0x000000 - 0x000014)
struct FPenetrationData
{ 
	float                                              JoulesPerCM_10_2ED07FD049A83AD44F34E99B567A4919;            // 0x0000   (0x0004)  
	float                                              ImpactAngleGradient_12_43998B4A4627A12ECEB29B8818434E80;    // 0x0004   (0x0004)  
	float                                              ImpactAngleZIntercept_13_37C5D5D742B54079A35088B7D9298EAF;  // 0x0008   (0x0004)  
	float                                              VelocityGradient_14_B9D638714BDE75C59DA2A78E6322890E;       // 0x000C   (0x0004)  
	float                                              VelocityZIntercept_15_5D55E60B460A74F11E480297C15ED9D4;     // 0x0010   (0x0004)  
};

/// Struct /Game/Blueprints/WeaponsSystem/S_HitInfo.S_HitInfo
/// Size: 0x0078 (0x000000 - 0x000078)
struct FS_HitInfo
{ 
	FVector                                            ImpactPoint_2_6514739B4CC7530EB32180B0B3CB204B;             // 0x0000   (0x0018)  
	FVector                                            ImpactNormal_4_5B50BC9141574BE6641594B4309936A9;            // 0x0018   (0x0018)  
	FVector                                            HitDirection_7_0A3A7D654E18D6B85AAF25AA4018B98C;            // 0x0030   (0x0018)  
	TEnumAsByte<EPhysicalSurface>                      SurfaceType_10_393614474656FAF0FEA281B95D5B67ED;            // 0x0048   (0x0001)  
	bool                                               NeedFX_13_DFBAA98D4B5E49C148D23185371B37A2;                 // 0x0049   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x004A   (0x0002)  MISSED
	FName                                              BoneName_16_923592EB4B0AACC7CF7758868E7CD3E7;               // 0x004C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0054   (0x0004)  MISSED
	USceneComponent*                                   HittedComponent_19_67C1DB98486842D81EA60A8CB56BD8A6;        // 0x0058   (0x0008)  
	FVector                                            LocalPoint_22_250F4F5B4747C75C7C9F69AD5FC08521;             // 0x0060   (0x0018)  
};

/// Struct /Game/Blueprints/WeaponsSystem/S_Float.S_Float
/// Size: 0x0004 (0x000000 - 0x000004)
struct FS_Float
{ 
	float                                              Float_3_A36B952041A932E8EC3FF7A1C0CC790C;                   // 0x0000   (0x0004)  
};

/// Struct /Game/Blueprints/WeaponsSystem/WeaponPlayerAnimStruct/S_WeaponGripTypeOffset.S_WeaponGripTypeOffset
/// Size: 0x0190 (0x000000 - 0x000190)
struct FS_WeaponGripTypeOffset
{ 
	TMap<FString, FTransform>                          GripTypeIdle_17_58B8ED2F41475C87A5BACCB445C946E3;           // 0x0000   (0x0050)  
	TMap<FString, FTransform>                          GripTypeAim_18_E9AEB01C4BCD3883DEA09A8337E4BF90;            // 0x0050   (0x0050)  
	TMap<FString, FTransform>                          GripCrouchTypeIdle_19_E7B67AA84A1B9405DC99839899CF3834;     // 0x00A0   (0x0050)  
	TMap<FString, FTransform>                          GripCrouchTypeAim_20_0DD312CF4590B9F37E0F5CA2519DAC9B;      // 0x00F0   (0x0050)  
	TMap<FString, FTransform>                          GripTypeFP_21_BD709BAA49AF7BE17F5B6BB89ADE7373;             // 0x0140   (0x0050)  
};

/// Struct /Game/Blueprints/CampingSystem/Cooking/S_CampCooking.S_CampCooking
/// Size: 0x00A0 (0x000000 - 0x0000A0)
struct FS_CampCooking
{ 
	FText                                              Name_5_5AA26EFB46B83F1EA9B06C983227AD0E;                    // 0x0000   (0x0018)  
	int32_t                                            CookTime_8_5C7EE7AB45CCDC28269C8F8C201295F2;                // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x001C   (0x0004)  MISSED
	TMap<FString, int32_t>                             Ingredients_28_AE8CDB9D4444FA3108C5409CFE6A5125;            // 0x0020   (0x0050)  
	FText                                              Result_20_B91265634D815FE3D9C1ED8BD7859F10;                 // 0x0070   (0x0018)  
	int32_t                                            Count_22_C249DB174E1334DB5552D0B47B9FD9A3;                  // 0x0088   (0x0004)  
	bool                                               Advanced_30_B1EDEF404922174924C1A58531D04DB6;               // 0x008C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x008D   (0x0003)  MISSED
	TArray<FString>                                    Sets_34_F288F21F4894C8D0A353A78EABFB525B;                   // 0x0090   (0x0010)  
};

/// Struct /Game/Blueprints/S_PlayersArray.S_PlayersArray
/// Size: 0x0010 (0x000000 - 0x000010)
struct FS_PlayersArray
{ 
	TArray<AActor*>                                    Players_4_4AECE16947F94D2B5AD511B1BF16732E;                 // 0x0000   (0x0010)  
};

/// Struct /Game/Blueprints/EatSystem/S_EatPlayerInformation.S_EatPlayerInformation
/// Size: 0x02B1 (0x000000 - 0x0002B1)
struct FS_EatPlayerInformation
{ 
	TWeakObjectPtr<UAnimSequence*>                     Animation_40_5BA14CE146508A06025EC79471A8D6FD;              // 0x0000   (0x0030)  
	TWeakObjectPtr<UAnimSequence*>                     FemAnimation_41_5B4F47F84442246A0DC67F86CF5A1A73;           // 0x0030   (0x0030)  
	TWeakObjectPtr<UAnimSequence*>                     StandAnimation_42_47F648054DA91685B496F88858B9DB67;         // 0x0060   (0x0030)  
	TWeakObjectPtr<UAnimSequence*>                     FemStandAnimation_43_CCBC014B4496A099DF89358753E66C44;      // 0x0090   (0x0030)  
	double                                             AnimationDuration_5_48F72B22467B29226AFE28A58084F2C0;       // 0x00C0   (0x0008)  
	bool                                               CanMove_8_192C062B4034A4CBE53946A8A11C95D9;                 // 0x00C8   (0x0001)  
	bool                                               HasStandAnimation_16_EB67433B440D00E77AEEE9B2DF86B44C;      // 0x00C9   (0x0001)  
	bool                                               WepNotHiding_21_CA00BB5841283534A01FBD9E087D4A0F;           // 0x00CA   (0x0001)  
	unsigned char                                      UnknownData00_5[0x5];                                       // 0x00CB   (0x0005)  MISSED
	TWeakObjectPtr<UAnimSequence*>                     WithWepAnimation_44_C5A22354487FAF6621CB5BA91BA4CC20;       // 0x00D0   (0x0030)  
	TWeakObjectPtr<UAnimSequence*>                     FemWithWepAnimation_45_726ACE484036B7895168A09C734EF04A;    // 0x0100   (0x0030)  
	TWeakObjectPtr<UAnimSequence*>                     StandWithWepAnimation_46_2D47ED704CDD1870738110921ED493DD;  // 0x0130   (0x0030)  
	TWeakObjectPtr<UAnimSequence*>                     FemStandWithWepAnimation_47_B7595A3F40B956E88C5BB7B288442137; // 0x0160   (0x0030)  
	TWeakObjectPtr<UAnimSequence*>                     WithPistolAnimation_48_0AEB19724FBA3740EEA2E19B5EBB86CF;    // 0x0190   (0x0030)  
	TWeakObjectPtr<UAnimSequence*>                     FemWithPistolAnimation_49_A0C2F6A947FED878A35BAABB71E74E69; // 0x01C0   (0x0030)  
	TWeakObjectPtr<UAnimSequence*>                     StandWithPistolAnimation_50_5FF7F9194B61E29956DF549F01D23871; // 0x01F0   (0x0030)  
	TWeakObjectPtr<UAnimSequence*>                     FemStandWithPistolAnimation_51_A29E86364CB2372D9230F5A1BB52D19E; // 0x0220   (0x0030)  
	TWeakObjectPtr<UAnimSequence*>                     InventoryAnim_54_67D4D36947ED9C7244447FA1FB76CE96;          // 0x0250   (0x0030)  
	TWeakObjectPtr<UAnimSequence*>                     FemInventoryAnim_56_34CCE51E4702DFFEBFA09F995EE52B0C;       // 0x0280   (0x0030)  
	bool                                               HasInventoryAnim_58_8FDF416449C0ABEDDFEC7FBD00165A1F;       // 0x02B0   (0x0001)  
};

/// Struct /Game/Blueprints/EatSystem/S_EatItemInformation.S_EatItemInformation
/// Size: 0x0138 (0x000000 - 0x000138)
struct FS_EatItemInformation
{ 
	TWeakObjectPtr<UAnimSequence*>                     Animation_56_F32FC94A4EE55A21FE24EBAECF356C25;              // 0x0000   (0x0030)  
	TWeakObjectPtr<USkeletalMesh*>                     SkeletalMesh_55_10AEEE8D43C36D1CAA99A1B7AE35BF71;           // 0x0030   (0x0030)  
	TWeakObjectPtr<UStaticMesh*>                       CustomMesh_54_79946AD24D0957C2BA89D1B0876E81B4;             // 0x0060   (0x0030)  
	FTransform                                         CustomTransform_28_C93ED0384C70BDDC86E0E896AFA91790;        // 0x0090   (0x0060)  
	bool                                               Destroy_29_3DDBF6DC476A8E614F18ACA120297B1E;                // 0x00F0   (0x0001)  
	bool                                               Special_30_408D8DBB4F2411FAF5DE73A2DD45F88B;                // 0x00F1   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x00F2   (0x0006)  MISSED
	double                                             ItemLifeTime_33_98A663EB4BB65A5A1B2FC99F695C200D;           // 0x00F8   (0x0008)  
	double                                             ItemAnimDelay_36_177A8C1746EBC9B7DDAF6384842917B2;          // 0x0100   (0x0008)  
	double                                             ItemDissappearDelay_39_220D3D0A4EC28EEFE8ECC09EF1E71AAA;    // 0x0108   (0x0008)  
	double                                             ItemVisibilityDelay_42_86D28B5F4D863A05EDA5B2A5F56F9C31;    // 0x0110   (0x0008)  
	double                                             ItemUsingDuration_47_5C713AD041BDC6D3BF7A71A3A9B7E240;      // 0x0118   (0x0008)  
	bool                                               ItemRightHand_44_3F1B85964D8BED75DB6412811BF946C2;          // 0x0120   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0121   (0x0007)  MISSED
	TArray<TWeakObjectPtr>                             CustomMaterials_53_607C59EA49D32A9FCCC8F384D9E81642;        // 0x0128   (0x0010)  
};

/// Struct /Game/Blueprints/WeaponsSystem/WeaponPlayerAnimStruct/S_WeaponGripType.S_WeaponGripType
/// Size: 0x0190 (0x000000 - 0x000190)
struct FS_WeaponGripType
{ 
	TMap<FString, UAnimSequence*>                      GripTypeIdle_5_58B8ED2F41475C87A5BACCB445C946E3;            // 0x0000   (0x0050)  
	TMap<FString, UAnimSequence*>                      GripTypeAim_7_E9AEB01C4BCD3883DEA09A8337E4BF90;             // 0x0050   (0x0050)  
	TMap<FString, UAnimSequence*>                      GripCrouchTypeIdle_12_E7B67AA84A1B9405DC99839899CF3834;     // 0x00A0   (0x0050)  
	TMap<FString, UAnimSequence*>                      GripCrouchTypeAim_14_0DD312CF4590B9F37E0F5CA2519DAC9B;      // 0x00F0   (0x0050)  
	TMap<FString, UAnimSequence*>                      GripTypeFP_16_BD709BAA49AF7BE17F5B6BB89ADE7373;             // 0x0140   (0x0050)  
};

/// Struct /Game/Blueprints/WeaponsSystem/WeaponPlayerAnimStruct/S_PlayerWeaponAnim.S_PlayerWeaponAnim
/// Size: 0x0088 (0x000000 - 0x000088)
struct FS_PlayerWeaponAnim
{ 
	UWeaponAnimAsset*                                  AnimAssets_22_9669AF974F6D0C4811EA44BAF99C48D0;             // 0x0000   (0x0008)  
	UWeaponAnimAsset*                                  AnimAssetsFemale_47_AAFC39464DC9BDB2FF803E96CE1CE0A9;       // 0x0008   (0x0008)  
	UAnimSequence*                                     FP_Idle_25_6F8CC9264247592EBD64718F2B03602B;                // 0x0010   (0x0008)  
	UAnimSequence*                                     FP_Equip_27_30678BB44539AF3593DE1E8135EE7C7D;               // 0x0018   (0x0008)  
	UAnimSequence*                                     FP_Move_35_1AAD25DF48D06375478CFAAB182FE9AB;                // 0x0020   (0x0008)  
	UAnimSequence*                                     FP_Unequip_29_622C4DD14C92F146243331B7B41D422C;             // 0x0028   (0x0008)  
	UAnimMontage*                                      FP_Fire_32_C2AF309847FD87AD0E02418DE7425207;                // 0x0030   (0x0008)  
	UAnimMontage*                                      FP_FingerIdle_67_01C57D3243C408CB6E40B5A9022A0B37;          // 0x0038   (0x0008)  
	UAnimSequence*                                     FP_WallOffset_Up_40_48C525AA4778BA9716BAD0B04E195B8D;       // 0x0040   (0x0008)  
	UAnimSequence*                                     FP_WallOffset_Down_41_89AC23C74811CB9B70659681C8F6D854;     // 0x0048   (0x0008)  
	UBPDA_WeaponGripType_C*                            TacticalGripTypes_44_A6407E7F4480842324643A8AD0020DEA;      // 0x0050   (0x0008)  
	UBPDA_WeaponGripType_C*                            TacticalGripTypesFemale_51_CC140D184AC10946FC511FB5C07EDE49; // 0x0058   (0x0008)  
	UAnimSequence*                                     FP_Idle_Fem_54_392CC1CA4AFB83DF179DCDA3B93826E2;            // 0x0060   (0x0008)  
	UAnimSequence*                                     FP_Equip_Fem_56_B6D94F024BB84A29335582A43A6B7852;           // 0x0068   (0x0008)  
	UAnimSequence*                                     FP_Move_Fem_58_81DA974848AAD338ACB2B6AA41C0210A;            // 0x0070   (0x0008)  
	UAnimMontage*                                      FP_Fire_Fem_61_DF0FB8C64C473F788329E8BA5138438F;            // 0x0078   (0x0008)  
	UAnimMontage*                                      FP_FingerIdle_Fem_68_A4534E93443B3F288099CBB6A5043BD2;      // 0x0080   (0x0008)  
};

/// Struct /Game/Blueprints/EatSystem/S_EatConfiguration.S_EatConfiguration
/// Size: 0x0400 (0x000000 - 0x000400)
struct FS_EatConfiguration
{ 
	FS_EatPlayerInformation                            Player_30_D3BD59C4472B621D3D3F5BA644B6A05D;                 // 0x0000   (0x02B8)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02B8   (0x0008)  MISSED
	FS_EatItemInformation                              Item_33_A4E1663647C077255BA6DDBA7762B99D;                   // 0x02C0   (0x0140)  
};

/// Struct /Game/Blueprints/WeaponsSystem/S_SimplifiedHitInfo.S_SimplifiedHitInfo
/// Size: 0x0079 (0x000000 - 0x000079)
struct FS_SimplifiedHitInfo
{ 
	FVector                                            ImpactPoint_2_FA1B6837460E74A889FECC867CD9D967;             // 0x0000   (0x0018)  
	FVector                                            ImpactNormal_4_A681D7E6454AAC70E50121A441358752;            // 0x0018   (0x0018)  
	FVector                                            TraceStart_6_0DD7EACD4CA50814363E82AB16290B59;              // 0x0030   (0x0018)  
	UPhysicalMaterial*                                 Physmat_11_9DDFD7714C62CFA091B35E9142443A3C;                // 0x0048   (0x0008)  
	UPrimitiveComponent*                               HitComponent_16_6A0AF89C46CBB65EC12B029860B45068;           // 0x0050   (0x0008)  
	FName                                              BoneName_19_012D4953479C309C7449438D1C9FBAD5;               // 0x0058   (0x0008)  
	FVector                                            LocalPoint_22_AC41EC8645B8ED308304158C72F001AE;             // 0x0060   (0x0018)  
	bool                                               NeedFX_25_14214B714C2B661978EA65B9EFFBF0D6;                 // 0x0078   (0x0001)  
};

/// Struct /Game/Blueprints/WeaponsSystem/BPS_DamageInfo.BPS_DamageInfo
/// Size: 0x0091 (0x000000 - 0x000091)
struct FBPS_DamageInfo
{ 
	unsigned char                                      UnknownData00_1[0x91];                                      // 0x0000   (0x0091)  MISSED
};

/// Struct /Game/Blueprints/LootGeneration/LootG2/CountChance.CountChance
/// Size: 0x0014 (0x000000 - 0x000014)
struct FCountChance
{ 
	FVector2D                                          Count_2_0F747C914B5A5053005D23BB3CEF9AD1;                   // 0x0000   (0x0010)  
	int32_t                                            Chance_5_8CF53C00422D9C11CD4083B43FAC26D4;                  // 0x0010   (0x0004)  
};

/// Struct /Game/Blueprints/WeaponsSystem/BPS_HitDecals.BPS_HitDecals
/// Size: 0x0030 (0x000000 - 0x000030)
struct FBPS_HitDecals
{ 
	TEnumAsByte<EPhysicalSurface>                      Surface_2_8BDF785748D7605269F5B282822E4B2E;                 // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	TArray<UMaterialInstance*>                         Materials_15_8DB645C946E8E475904E01825A5E86B1;              // 0x0008   (0x0010)  
	TArray<double>                                     SizeMultipliers_14_9148E7244BE081490C336EAC3D43A3B9;        // 0x0018   (0x0010)  
	UPhysicalMaterial*                                 PhysMat_18_920465B14177FF37F89E6AAEF5080948;                // 0x0028   (0x0008)  
};

/// Struct /Game/Blueprints/LootGeneration/LootG2/ItemIdGenerateChance.ItemIdGenerateChance
/// Size: 0x0020 (0x000000 - 0x000020)
struct FItemIdGenerateChance
{ 
	FName                                              ID_2_5784D2564D6905932AE1E9AAE43B4DE6;                      // 0x0000   (0x0008)  
	int32_t                                            Chance_10_B57622FC4E53D0884965AC9BB946BE1E;                 // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	TArray<FCountChance>                               Count_6_A0A9EAB843FA974478EA7AB6E495703A;                   // 0x0010   (0x0010)  
};

/// Struct /Game/Blueprints/LootGeneration/LootG2/GeneralChanceByType.GeneralChanceByType
/// Size: 0x0030 (0x000000 - 0x000030)
struct FGeneralChanceByType
{ 
	TEnumAsByte<ELootTypes>                            Type_14_1F743DAF446B4129E21A6390926D1028;                   // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            Chance_5_F505844C4E1E6E15E53E3792C8367527;                  // 0x0004   (0x0004)  
	TArray<FItemIdGenerateChance>                      Items_9_A3FE33834021EDAB49CDF196E43A1FDA;                   // 0x0008   (0x0010)  
	TEnumAsByte<SlotRarity>                            Tier_31_3F4797974AD54994F6638BB20977268C;                   // 0x0018   (0x0001)  
	bool                                               GenerateRandomonType_16_006F231A43BF62F6CDF5CE9AEC624E74;   // 0x0019   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x001A   (0x0006)  MISSED
	TArray<FCountChance>                               CountChanceRandom_28_6AAFFEB84D92C29622CF18A455179A39;      // 0x0020   (0x0010)  
};

/// Struct /Game/Blueprints/FantasticSky/RayleighStruct.RayleighStruct
/// Size: 0x0020 (0x000000 - 0x000020)
struct FRayleighStruct
{ 
	double                                             ScatteringScale_2_888F75E2421DC30BF96B778767CBA674;         // 0x0000   (0x0008)  
	FLinearColor                                       Scattering_5_DDB96EE349AC726301F7BDBEFA500692;              // 0x0008   (0x0010)  
	double                                             ExponentialDistribution_8_D23B86D949BC0B5FDE3A5BB6420BF824; // 0x0018   (0x0008)  
};

/// Struct /Game/Blueprints/FantasticSky/MieStruct.MieStruct
/// Size: 0x0040 (0x000000 - 0x000040)
struct FMieStruct
{ 
	double                                             ScatteringScale_3_888F75E2421DC30BF96B778767CBA674;         // 0x0000   (0x0008)  
	FLinearColor                                       Scattering_6_688D3A024F21FAFB08459794F6EE48B2;              // 0x0008   (0x0010)  
	double                                             AbsoptionScale_11_79BEBBFD41936A179AE1ED9025287CBC;         // 0x0018   (0x0008)  
	FLinearColor                                       Absoption_10_601904CA45E9583816EAC0BD8971AD0B;              // 0x0020   (0x0010)  
	double                                             Anisotropy_13_F89E68234C5A48A23972B1A7DA89F87C;             // 0x0030   (0x0008)  
	double                                             ExponentialDistribuition_15_6117C993420AC9032F8D228366E30493; // 0x0038   (0x0008)  
};

/// Struct /Game/Blueprints/FantasticSky/ArtDirectionStruct.ArtDirectionStruct
/// Size: 0x0020 (0x000000 - 0x000020)
struct FArtDirectionStruct
{ 
	FLinearColor                                       SkyLuminanceFactor_2_888F75E2421DC30BF96B778767CBA674;      // 0x0000   (0x0010)  
	double                                             AerialPerspectiveViewDistanceScale_5_102EF6A34B1FBA0272B342A1692F4E93; // 0x0010   (0x0008)  
	double                                             HeightFogContribution_7_39FDE51E46CBA5791EE58BB085B7F497;   // 0x0018   (0x0008)  
};

/// Struct /Game/Blueprints/FantasticSky/SkyAtmosphereCSLStruct.SkyAtmosphereCSLStruct
/// Size: 0x0080 (0x000000 - 0x000080)
struct FSkyAtmosphereCSLStruct
{ 
	FRayleighStruct                                    Rayleigh_2_330D0B2E4CE90A58525A3D8406D005A5;                // 0x0000   (0x0020)  
	FMieStruct                                         Mie_5_1046E3BA4E43D504D41DECB3C847D93C;                     // 0x0020   (0x0040)  
	FArtDirectionStruct                                ArtDirection_8_1BD63D5F41FB36905E302D8401FA4B03;            // 0x0060   (0x0020)  
};

/// Struct /Game/Blueprints/FantasticSky/FogCSLStruct.FogCSLStruct
/// Size: 0x0034 (0x000000 - 0x000034)
struct FFogCSLStruct
{ 
	bool                                               UseVolumetric_13_6B0F389E48AD76E392AE4E91BE3BC2DD;          // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	double                                             Density_2_94DB8E7D4794F5ECA18305A4EACB910D;                 // 0x0008   (0x0008)  
	double                                             HeightFalloff_8_F6379E424DF989CBC283A5A02B964742;           // 0x0010   (0x0008)  
	double                                             VFExtinctionScale_10_FD6E0F4D4F45AA302A5B76A451319531;      // 0x0018   (0x0008)  
	FLinearColor                                       FogInscatteringColor_5_4C8EA8AE4FE5ED9317BE34820952F9D6;    // 0x0020   (0x0010)  
	FColor                                             VolumetricFogAlbedo_18_7C421E25415917EB4ABEA48B71F7034A;    // 0x0030   (0x0004)  
};

/// Struct /Game/Blueprints/FantasticSky/DirectionalLightCSLStruct.DirectionalLightCSLStruct
/// Size: 0x0038 (0x000000 - 0x000038)
struct FDirectionalLightCSLStruct
{ 
	double                                             OcclusionMaskDarkness_11_DC7A5DC84C698DB30AA39686314DD428;  // 0x0000   (0x0008)  
	double                                             OcclusionDepthRange_13_DFB079C94D31F00E43C72BB0EA3A92B5;    // 0x0008   (0x0008)  
	double                                             BloomScale_15_9CE6E0A2402B6EB08788F2B3624BAB0A;             // 0x0010   (0x0008)  
	double                                             BloomTreshold_17_C4DDCA3F4E2E9FADE9E924BE43081721;          // 0x0018   (0x0008)  
	double                                             BloomMaxBrightness_19_0034CF9C4709EDCB31894EAADDC573C9;     // 0x0020   (0x0008)  
	FColor                                             BloomTint_24_440C7E9E47759C4BCEFDDFB76D416C12;              // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x002C   (0x0004)  MISSED
	double                                             VolumetricScatteringIntensity_27_5D76F8004A67CC4A15E0B4BC382EAE14; // 0x0030   (0x0008)  
};

/// Struct /Game/Blueprints/FantasticSky/BackgroundCloudsCSLStruct.BackgroundCloudsCSLStruct
/// Size: 0x0050 (0x000000 - 0x000050)
struct FBackgroundCloudsCSLStruct
{ 
	double                                             Intensity_2_7EBE4BE549E4D1C84CC725A5940B3ABE;               // 0x0000   (0x0008)  
	FLinearColor                                       ColorTint_16_103182CA4194D66D6D9DF48675D53A9A;              // 0x0008   (0x0010)  
	double                                             LayerA_12_4D4A355E4FD18B0C18983C843A638F66;                 // 0x0018   (0x0008)  
	double                                             LayerB_13_DC34095041554198BACB0EB4E1D094B8;                 // 0x0020   (0x0008)  
	double                                             LayerC_15_D0D4846742781D0B7B779BAF85AB9290;                 // 0x0028   (0x0008)  
	double                                             RimLightIntensity_20_0E2693104A5399082FF487808ACBF00F;      // 0x0030   (0x0008)  
	FLinearColor                                       RimColor_25_701EA4E446BE051340B9A49DB2BA9B36;               // 0x0038   (0x0010)  
	double                                             RimColorIntensity_24_812AAA1440BB5F281C3E7DAB742C5CD1;      // 0x0048   (0x0008)  
};

/// Struct /Game/Blueprints/WeaponsSystem/AttachmmentSystem/S_AttachmentDependencies.S_AttachmentDependencies
/// Size: 0x0028 (0x000000 - 0x000028)
struct FS_AttachmentDependencies
{ 
	TEnumAsByte<E_TypesOfModes>                        AttachmentType_8_87AC1E48408E41A748A8F18FC8E2C432;          // 0x0000   (0x0001)  
	TEnumAsByte<E_AttachmentDependencyTypes>           DependencyType_11_F3DB2E6F451E4F82D7C79E88E2D8D9C1;         // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0002   (0x0006)  MISSED
	TArray<FS_AttachmentDependency>                    Dependencies_6_D975ED7442AE7E092571F59D206F577A;            // 0x0008   (0x0010)  
	TArray<int32_t>                                    ListOfItemsIDs_18_871BEC3F4ED2F432122120AAD8CEDA39;         // 0x0018   (0x0010)  
};

/// Struct /Game/Blueprints/FantasticSky/SettingCSLStruct.SettingCSLStruct
/// Size: 0x0188 (0x000000 - 0x000188)
struct FSettingCSLStruct
{ 
	double                                             LightIntensity_2_B3A540B24050A516B3B6A09E4D2103AA;          // 0x0000   (0x0008)  
	FLinearColor                                       LightColor_5_03316CCD49922EED22AB00A13C73350B;              // 0x0008   (0x0010)  
	bool                                               UseTemperature_8_77450C614676AD4C1072A29BA6E351C9;          // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0019   (0x0007)  MISSED
	double                                             LightTemperature_31_E12A5F494891B48E3A69E2B89AF72B5F;       // 0x0020   (0x0008)  
	FDirectionalLightCSLStruct                         DirectionalLightSettings_14_18EDF04B405E35718830B7850A7C486F; // 0x0028   (0x0038)  
	double                                             SkyLightIntensity_17_2FCDA98648616CE663391FAFD6963F3D;      // 0x0060   (0x0008)  
	FLinearColor                                       SkyLightColor_20_B8AFB53143A15A77770966A414CFE296;          // 0x0068   (0x0010)  
	UTextureCube*                                      Cubemap_23_8DC03590455FE68148CEEDACF91FA81F;                // 0x0078   (0x0008)  
	FSkyAtmosphereCSLStruct                            SkyAtmosphereSettings_26_F74C3C6141DFADDF09F537B25724E9AE;  // 0x0080   (0x0080)  
	FFogCSLStruct                                      FogSettings_30_797BE2434147E9788FAB84A48A8182DD;            // 0x0100   (0x0038)  
	FBackgroundCloudsCSLStruct                         BackgroundClouds_34_7A9D76FF46A058DDDCA2E2AD43DB222F;       // 0x0138   (0x0050)  
};

/// Struct /Game/Blueprints/InGameCinematic/S_MeshToSocket.S_MeshToSocket
/// Size: 0x0010 (0x000000 - 0x000010)
struct FS_MeshToSocket
{ 
	UStaticMesh*                                       Mesh_6_7FD748B440F679A06E3843A5E16CFC58;                    // 0x0000   (0x0008)  
	FName                                              SocketName_5_93C20EFD4FCB842B4212509CF8409956;              // 0x0008   (0x0008)  
};

/// Struct /Game/Blueprints/WeaponsSystem/BPS_HitParticles.BPS_HitParticles
/// Size: 0x0030 (0x000000 - 0x000030)
struct FBPS_HitParticles
{ 
	TEnumAsByte<EPhysicalSurface>                      Surface_7_C4E05C8640E5C2A0CE297689F02F33A4;                 // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	TArray<UParticleSystem*>                           Particles_3_17881668484AF5B7B338C2B45E5FE6C0;               // 0x0008   (0x0010)  
	TArray<UNiagaraSystem*>                            Niagara_12_199477064D1C4E1D31228984D51F1B6C;                // 0x0018   (0x0010)  
	UPhysicalMaterial*                                 PhysMat_15_9D9FC6CC49596ECE38F177AE99C236B3;                // 0x0028   (0x0008)  
};

/// Struct /Game/Blueprints/FantasticSky/DayCycleSettingsCSLStruct.DayCycleSettingsCSLStruct
/// Size: 0x0C48 (0x000000 - 0x000C48)
struct FDayCycleSettingsCSLStruct
{ 
	FSettingCSLStruct                                  Morning_12_61AEC83543278624DCF9BF986CEAEDE0;                // 0x0000   (0x0188)  
	FSettingCSLStruct                                  Day_13_C33F67F1432A05BF4A3672A56BA54929;                    // 0x0188   (0x0188)  
	FSettingCSLStruct                                  Evening_14_4ADEEA38420A7D84C9A73C8623270AF6;                // 0x0310   (0x0188)  
	FSettingCSLStruct                                  Night_15_00A51A794CB567EE87DAADB433E60D92;                  // 0x0498   (0x0188)  
	bool                                               IncludeTransitionSettings_16_B878AD9F49A7BA3873964184E6378E7F; // 0x0620   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0621   (0x0007)  MISSED
	FSettingCSLStruct                                  NightToMorning_17_D0EEAD6944FB300CEBBCECB04C693FDF;         // 0x0628   (0x0188)  
	FSettingCSLStruct                                  MorningToDay_18_1F49343C43691B92510F47B828CD646D;           // 0x07B0   (0x0188)  
	FSettingCSLStruct                                  DayToEvening_19_E82E6F65489E07ABF1D0E8A347C1A1F1;           // 0x0938   (0x0188)  
	FSettingCSLStruct                                  EveningToNight_20_1397C1294BDB2DB7C14AEA956B33BA19;         // 0x0AC0   (0x0188)  
};

/// Struct /Game/Blueprints/WeaponsSystem/BPS_AmmunitionData.BPS_AmmunitionData
/// Size: 0x0018 (0x000000 - 0x000018)
struct FBPS_AmmunitionData
{ 
	FName                                              Name_2_6A111C8A4AF5CF59332C70BF1576A595;                    // 0x0000   (0x0008)  
	TArray<FBPS_SupportedAttachments>                  SupportedAttachments_6_E19C49A04ACCDC6C19E0F5887CA30BE3;    // 0x0008   (0x0010)  
};

/// Struct /Game/Blueprints/WeaponsSystem/AttachmmentSystem/S_AttachmentDependencyV2.S_AttachmentDependencyV2
/// Size: 0x0018 (0x000000 - 0x000018)
struct FS_AttachmentDependencyV2
{ 
	TEnumAsByte<E_AttachmentDependencyTypes>           DependencyType_13_86C4D2BA40EF9305817DE29FFE1C474E;         // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	TArray<FS_AttachmentDependency>                    Dependencies_19_2432215444618BD7B95F91A35A4E9DAD;           // 0x0008   (0x0010)  
};

/// Struct /Game/Blueprints/WeaponsSystem/AttachmmentSystem/S_AttachmentDependency.S_AttachmentDependency
/// Size: 0x0003 (0x000000 - 0x000003)
struct FS_AttachmentDependency
{ 
	bool                                               Enabled_1_C3584ECB46984C57A63B99A8A86C628B;                 // 0x0000   (0x0001)  
	TEnumAsByte<E_TypesOfModes>                        AttachmentType_10_269964A84F2D73527200389D650ED2A0;         // 0x0001   (0x0001)  
	TEnumAsByte<E_DependenciesRule>                    Rule_13_7D4AB6CF467CCBF57406909F5469CEA0;                   // 0x0002   (0x0001)  
};

/// Struct /Game/Blueprints/WeaponsSystem/AttachmmentSystem/S_AttachmentDependenciesV2.S_AttachmentDependenciesV2
/// Size: 0x0050 (0x000000 - 0x000050)
struct FS_AttachmentDependenciesV2
{ 
	TMap<TEnumAsByte, FS_AttachmentDependencyV2>       AttachmentType_22_87AC1E48408E41A748A8F18FC8E2C432;         // 0x0000   (0x0050)  
};

/// Struct /Game/Blueprints/LootGeneration/AmountLootPercent.AmountLootPercent
/// Size: 0x0040 (0x000000 - 0x000040)
struct FAmountLootPercent
{ 
	TArray<int32_t>                                    60_7_955B3A50455F755C8E93A99C9A9623B1;                      // 0x0000   (0x0010)  
	TArray<int32_t>                                    20_8_7750D32B49D1D206945A94BA6E60E653;                      // 0x0010   (0x0010)  
	TArray<int32_t>                                    15_9_2EC98A72480EFBDF966F3A88D492ADC6;                      // 0x0020   (0x0010)  
	TArray<int32_t>                                    5_10_49610B854D88EBB5094C6786B68E4D71;                      // 0x0030   (0x0010)  
};

/// Struct /Game/Blueprints/WeaponsSystem/BPS_CustomizationData.BPS_CustomizationData
/// Size: 0x0040 (0x000000 - 0x000040)
struct FBPS_CustomizationData
{ 
	FName                                              Name_2_D16B404B4DCE21E16005C78372EAABC3;                    // 0x0000   (0x0008)  
	FText                                              DisplayName_14_8BFA453841B20A1D951D2D8C85036439;            // 0x0008   (0x0018)  
	FText                                              Description_16_CC44B4BB41789C97966B118990A3F00F;            // 0x0020   (0x0018)  
	UPaperSprite*                                      Image_10_1DA0201A470F93800301278FA7B7B274;                  // 0x0038   (0x0008)  
};

/// Struct /Game/Blueprints/WeaponsSystem/ST_WeaponMaxValue.ST_WeaponMaxValue
/// Size: 0x0020 (0x000000 - 0x000020)
struct FST_WeaponMaxValue
{ 
	double                                             Power_8_928EBA39408F8EC22731F7A8B6F7D1B5;                   // 0x0000   (0x0008)  
	double                                             EffectiveRange_9_2230E40A4B1EF7F57AC341931051DFC2;          // 0x0008   (0x0008)  
	double                                             Stability_10_609562294DAEE739C9F616B0FD2E96BA;              // 0x0010   (0x0008)  
	double                                             FiringRate_11_8F5090AE4F77D1C8950AC3B17A820792;             // 0x0018   (0x0008)  
};

/// Struct /Game/Blueprints/EffectSystem/EffectMainContructor.EffectMainContructor
/// Size: 0x0078 (0x000000 - 0x000078)
struct FEffectMainContructor
{ 
	FText                                              GroupName_24_43E8CB19496A0CB63DB5BF9E92EAD2A9;              // 0x0000   (0x0018)  
	FText                                              EffectName_3_7FEBC43E48E314C85022AE806FCE98D2;              // 0x0018   (0x0018)  
	FText                                              Description_14_27E0E93F4DFE22307E65F4A4464A13A0;            // 0x0030   (0x0018)  
	double                                             Duration_6_7D26D7A44851FE8BE133F4B6C5FDF1B0;                // 0x0048   (0x0008)  
	TArray<FEffectContructor>                          Effects_10_47CA286C4178A3F3C3BCB2A62C3B5FB0;                // 0x0050   (0x0010)  
	TArray<FText>                                      StopEfffects_26_DBBE481045F309B6BAC8F8BA3028EF12;           // 0x0060   (0x0010)  
	TEnumAsByte<E_WeakeningEffect>                     WeakeningEffects_33_0E40379643DEED8917B404AAFEFEA684;       // 0x0070   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0071   (0x0003)  MISSED
	int32_t                                            StackCount_21_681ADE3C47089B55221CFE82D8CCC07E;             // 0x0074   (0x0004)  
};

/// Struct /Game/Blueprints/WeaponsSystem/S_WeaponShakeInfo.S_WeaponShakeInfo
/// Size: 0x0020 (0x000000 - 0x000020)
struct FS_WeaponShakeInfo
{ 
	TArray<TWeakObjectPtr>                             ShakeClass_10_AA022F944B8A895DF198C19C2A298ED3;             // 0x0000   (0x0010)  
	double                                             MinScale_5_B6717EA0488C79E5ECD2BCBA9C12E6F7;                // 0x0010   (0x0008)  
	double                                             MaxScale_8_B15BFA964BC584F479FB2FA599013A74;                // 0x0018   (0x0008)  
};

/// Struct /Game/Blueprints/WeaponsSystem/S_PPAim.S_PPAim
/// Size: 0x0018 (0x000000 - 0x000018)
struct FS_PPAim
{ 
	float                                              ApertureF_stop_13_83F033A7462B9AAAC4F6F6B1E61317D8;         // 0x0000   (0x0004)  
	float                                              MaxApertureminF_stop_14_76CBE4784CD1F70CDE58858EAC4EDD1B;   // 0x0004   (0x0004)  
	float                                              FocalDistance_15_82AAD5674FB7AD146989A194DD412CB4;          // 0x0008   (0x0004)  
	float                                              DepthBlurkmfor50_16_A3B522BC4D01F1E273D2D8A33F893F51;       // 0x000C   (0x0004)  
	float                                              DepthBlurRadius_17_268013AF4DB683273714E498FCC52A11;        // 0x0010   (0x0004)  
	float                                              VignetteIntensity_18_B0D3B17043B8A8B6F4B9D4A968996DD9;      // 0x0014   (0x0004)  
};

/// Struct /Game/Blueprints/WeaponsSystem/BPS_SupportedAttachments.BPS_SupportedAttachments
/// Size: 0x0018 (0x000000 - 0x000018)
struct FBPS_SupportedAttachments
{ 
	TEnumAsByte<E_TypesOfModes>                        BaseTypeOfMode_2_0844BDDB44427DF71BA74A88AAB3984C;          // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	TArray<FName>                                      ModeNames_7_CD842F5F474732C6F2EAA29583FCF9FC;               // 0x0008   (0x0010)  
};

/// Struct /Game/Blueprints/WeaponsSystem/BPS_WeaponData.BPS_WeaponData
/// Size: 0x04C0 (0x000000 - 0x0004C0)
struct FBPS_WeaponData
{ 
	FName                                              Name_51_B16287794691692AD32DEF8A39B6C006;                   // 0x0000   (0x0008)  
	TEnumAsByte<BPE_Weapon_Type>                       Type_8_FD614DE04D8567521383BF933DD03880;                    // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0009   (0x0003)  MISSED
	int32_t                                            MaxAmmoInMag_16_4D528A164F039B073A645DB5AB3D57AA;           // 0x000C   (0x0004)  
	int32_t                                            LowAmmoCount_246_34A3DA234AC2C0E58CEE3F98B0DB321F;          // 0x0010   (0x0004)  
	int32_t                                            RoundsInBurst_18_D1BC9E21476F66599884C7BB3E5D21BC;          // 0x0014   (0x0004)  
	int32_t                                            BulletsInShot_68_5C5A152B48C7C7D852A42EBA265BE167;          // 0x0018   (0x0004)  
	bool                                               HasSingleMode_25_77EA840E4BD93CF4A5AF4FB3D607FEC4;          // 0x001C   (0x0001)  
	bool                                               HasBurstMode_26_917008E34B7616E494146F9457F90928;           // 0x001D   (0x0001)  
	bool                                               HasAutoMode_27_9A30D7DA4C0E0DE9173F4B8642CE74AC;            // 0x001E   (0x0001)  
	TEnumAsByte<BPE_AmmoType>                          AmmoType_297_CFB4AC0F47FEFAFDFFB8D4947FF425FD;              // 0x001F   (0x0001)  
	double                                             FireRatio_13_DCEFC8AC4CCBC24077A25FB504B8DB8A;              // 0x0020   (0x0008)  
	double                                             BulletMinDamage_32_9AF58C3645AA6460723FDE8786ADE807;        // 0x0028   (0x0008)  
	double                                             BulletMaxDamage_33_1EDBD9264CE3D2CFA9746188FBC760BB;        // 0x0030   (0x0008)  
	double                                             SpreadInit_52_E9E2ABFD4A1CA15B1D18A9A003B9B8CD;             // 0x0038   (0x0008)  
	double                                             SpreadPenaltyWhileMoving_58_19E71A7641A94B417CA8AC93924FA917; // 0x0040   (0x0008)  
	double                                             SpreadDefault_55_63F888C4426286C4D1B2D2A1E1CA1030;          // 0x0048   (0x0008)  
	double                                             SpreadChangeTime_62_D1411635402CB2953F90C19B96107469;       // 0x0050   (0x0008)  
	double                                             SpreadAddAfterShot_61_2BBE7A64404FD83792DCBCAFFC03CB98;     // 0x0058   (0x0008)  
	double                                             SpreadMax_64_4E639BAF43C0FB6664D3699D54B5D2AC;              // 0x0060   (0x0008)  
	double                                             ThirdPersonSpreadMultiplier_177_06B53C0B462A5839231695AF6104161D; // 0x0068   (0x0008)  
	double                                             RecoilAddTime_71_4FF7D41847DB1E10AC3BFABD300436B7;          // 0x0070   (0x0008)  
	double                                             RecoilStabilizeTime_73_0DCF4B894394A8989CC707ADF3883256;    // 0x0078   (0x0008)  
	FVector2D                                          RecoilRight_50_20826A124C61DD445AF0A4B1037B6886;            // 0x0080   (0x0010)  
	FVector2D                                          RecoilUp_48_244DC517415B2B7F8804B7A71542497F;               // 0x0090   (0x0010)  
	double                                             FP_RecoilAddTime_117_75ACCF3F4149077DCC798B95DA699FA7;      // 0x00A0   (0x0008)  
	double                                             FP_RecoilStabillizeTime_119_594FE4ED44666E84D2E4119A6F5C6C37; // 0x00A8   (0x0008)  
	FVector2D                                          FP_RecoilRight_121_0685BA6A496016A618984E9F2E49D9DD;        // 0x00B0   (0x0010)  
	FVector2D                                          FP_RecoilUp_123_C0368C3C49174C0152464D95C25C7B36;           // 0x00C0   (0x0010)  
	double                                             RecoilVerticalMaxTime_282_10BCA4454D9CD7896EDD15BAD5B15743; // 0x00D0   (0x0008)  
	double                                             CameraPitchOffsetAfterFirstShot_219_57591A424076F727B6E0188DF14CB38A; // 0x00D8   (0x0008)  
	int32_t                                            PenetrationCount_105_582E2E754BF9E9F01AE3E28E0DA00FAF;      // 0x00E0   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x00E4   (0x0004)  MISSED
	TWeakObjectPtr<USkeletalMesh*>                     SkeletalMesh_328_6EEE4A5A4CBE9243ECAE5894FB4DC8A2;          // 0x00E8   (0x0030)  
	TWeakObjectPtr<UAnimMontage*>                      WeaponAimReloadAnim_329_3EF3D0E14AC105CBDF9B6085989FED07;   // 0x0118   (0x0030)  
	TWeakObjectPtr<UAnimMontage*>                      WeaponShotAnim_330_6AB4BFC4488F56EF3B668E89CD98E1C3;        // 0x0148   (0x0030)  
	TWeakObjectPtr<UAnimMontage*>                      WeaponReloadAnim_331_B5668C5F48F8CC89C0BE4A9F3D4A4E3D;      // 0x0178   (0x0030)  
	TWeakObjectPtr<UClass*>                            WeaponAnimInstance_332_0DFAA40C4314AEE5E4252D8DC584A6B1;    // 0x01A8   (0x0030)  
	TWeakObjectPtr<UPaperSprite*>                      UIIcon_327_72FF027247E951512B12188E5E38A5BB;                // 0x01D8   (0x0030)  
	double                                             LeftHandVariant_108_5B425900468CC3BA242AB88941EAC0C4;       // 0x0208   (0x0008)  
	TArray<FS_WeaponShakeInfo>                         TPPShootShake_147_113D64534DDA5A0F1D70E68433A71632;         // 0x0210   (0x0010)  
	TArray<FS_WeaponShakeInfo>                         FPPShootShake_149_18ED21A84B538D4D5DF93AAED5E8E6C8;         // 0x0220   (0x0010)  
	TArray<FS_WeaponShakeInfo>                         FPPShootShakeOptics_264_52D82A3944204D32EE19FBAC4CB6DA00;   // 0x0230   (0x0010)  
	FS_WeaponShakeInfo                                 FPPSmoothShootShake_260_D89D04184BB0412842E8FDA220564D27;   // 0x0240   (0x0020)  
	UCurveVector*                                      FPPLocalRecoilPos_144_F9CF445B4254C21853158498D222BF64;     // 0x0260   (0x0008)  
	UCurveVector*                                      FPPLocalRecoilRot_145_45D8C6D94CDB5557A5A072A4C2C2716C;     // 0x0268   (0x0008)  
	UCurveVector*                                      FPPLocalRecoilPosWithScope_222_EA4D05F64DC4B1ADE26556A0ADF73750; // 0x0270   (0x0008)  
	UCurveVector*                                      FPPLocalRecoilPosWithHolo_228_7801344849CDF4184A404EB6694FCBAC; // 0x0278   (0x0008)  
	UCurveVector*                                      FPPLocalRecoilRotWithScope_251_EC255A4641090A1E537227ADEED77F36; // 0x0280   (0x0008)  
	UCurveVector*                                      FPPLocalRecoilRotWithHolo_252_E95657D64A6832CFB0E281A6C30396C8; // 0x0288   (0x0008)  
	double                                             BulletSpeed_153_76D4980645BE7BFF901EB99D839A0D9E;           // 0x0290   (0x0008)  
	double                                             BDMG_0_159_500ED99D4F65D5FD096457AC4F2E8E80;                // 0x0298   (0x0008)  
	double                                             HDMG_0_163_F445D00A40004E8C61DDA981A7E9CCE1;                // 0x02A0   (0x0008)  
	FS_PPAim                                           PP_Aim_172_ABFDEEEF44F7681AC61A75A1817D09CD;                // 0x02A8   (0x0018)  
	double                                             BulletFinalSpeed_180_37E529C64B93A382B88334BAE6DB6B0A;      // 0x02C0   (0x0008)  
	double                                             FP_BobcycleIdleMultiplier_326_0B0ABE914A6B76B64D302F8A22B080B1; // 0x02C8   (0x0008)  
	double                                             FP_RotationMultiplier_185_4C423A614FA10F3B645EE88F63AA9175; // 0x02D0   (0x0008)  
	double                                             FP_RotationAnchor_186_472A65DC412D828963B746ADE0133172;     // 0x02D8   (0x0008)  
	double                                             FP_RotationMultiplier_HoloScope_302_B15B9F7A42571059E10699A438BA9A59; // 0x02E0   (0x0008)  
	double                                             FP_RotationAnchor_HoloScope_303_5616764E49E6181645064AB238FEF8E5; // 0x02E8   (0x0008)  
	double                                             FP_RotationLimit_307_EE8542E14753FEC4C50927972CF295E4;      // 0x02F0   (0x0008)  
	bool                                               bHasFastReload_323_4031483347161A33A97E91954F78D888;        // 0x02F8   (0x0001)  
	bool                                               BoltAction_309_5C6D37B14B8B634668D76AA5208B83E6;            // 0x02F9   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x02FA   (0x0006)  MISSED
	TWeakObjectPtr<UFMODEvent*>                        AutoSound_333_01FA8F6A482E78890BCC9CA1CF93C833;             // 0x0300   (0x0030)  
	TWeakObjectPtr<UFMODEvent*>                        SingleShotSound_334_97CF628D416718D8E33447BF6698DF6A;       // 0x0330   (0x0030)  
	double                                             CollimatorOffset_202_996A57084C3DB0CA8EA78F92021883D5;      // 0x0360   (0x0008)  
	double                                             ScopeOffset_294_6CE4F50A46211061E49C0CBD5B04DB30;           // 0x0368   (0x0008)  
	TArray<FBPS_SupportedAttachments>                  SupportedModes_209_94563E2E4E7A6A477BE30AA47366FAA0;        // 0x0370   (0x0010)  
	TArray<FName>                                      SupportedBrackets_212_45776F11450CF4F0BD1B11B8F25371ED;     // 0x0380   (0x0010)  
	TEnumAsByte<ETier>                                 Tier_215_393F52CB469189DF287F178894501CDE;                  // 0x0390   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x0391   (0x0007)  MISSED
	double                                             WeaponFOV_225_4F6434F44099DF3F6EF686AF255B4742;             // 0x0398   (0x0008)  
	double                                             DistanceToCameraWorkbench_231_FE15E7484F23D22776088BBD29282BD9; // 0x03A0   (0x0008)  
	FVector                                            LocationWeaponWorkbench_234_6FF542804F7AE4D729003FB074A0CA42; // 0x03A8   (0x0018)  
	double                                             Power_241_5FA08143402424E413637F896748A684;                 // 0x03C0   (0x0008)  
	double                                             EffectiveRange_242_73F51D9743F94DEB7FE8B2A2AAED5E3D;        // 0x03C8   (0x0008)  
	double                                             Stability_243_410598534B1777346B06BBAE0D2B6FFE;             // 0x03D0   (0x0008)  
	UCurveVector*                                      CockingRecoil_Pos_269_7A5A512449E0603D2F8303B01A4E85E3;     // 0x03D8   (0x0008)  
	UCurveVector*                                      CockingRecoil_Rot_270_9BD55DD048F82AD2084260AD6638F37D;     // 0x03E0   (0x0008)  
	double                                             DistanceDamagePower_278_63C1BB1346A02258691470B45F7FE663;   // 0x03E8   (0x0008)  
	UCurveVector*                                      FPPEquipPos_286_AADC877D457F2440FAABF5ABEBA1AD73;           // 0x03F0   (0x0008)  
	UCurveVector*                                      FPPEquipRot_288_F504EA84423442D3A2001B8CC4D3ED7C;           // 0x03F8   (0x0008)  
	TWeakObjectPtr<UNiagaraSystem*>                    TPSMuzzleFlash_314_A5D78FFF4B5D6090518BDABB9C721E42;        // 0x0400   (0x0030)  
	TWeakObjectPtr<UNiagaraSystem*>                    FPSMuzzleFlash_315_D2289BC24068416C24A06ABBA7879634;        // 0x0430   (0x0030)  
	TWeakObjectPtr<UNiagaraSystem*>                    TPSSupressedMuzzleFlash_320_8804D5B3448A65977ACB26AA5455A68E; // 0x0460   (0x0030)  
	TWeakObjectPtr<UNiagaraSystem*>                    FPSSupressedMuzzleFlash_321_BADC65ED4FB18250C6E70D86F34416E1; // 0x0490   (0x0030)  
};

/// Struct /Game/Blueprints/WeaponsSystem/AttachmmentSystem/S_Attachment.S_Attachment
/// Size: 0x0080 (0x000000 - 0x000080)
struct FS_Attachment
{ 
	FName                                              ItemID_2_45A01BE848463D8404DA13BF18C6F5B2;                  // 0x0000   (0x0008)  
	FName                                              Socket_14_025F86344EBEF105B8FCC4A0B681AE3E;                 // 0x0008   (0x0008)  
	TWeakObjectPtr<UClass*>                            AttachmentClass_44_CBB358B24A50EA06E5F6B2AEC9C73D14;        // 0x0010   (0x0030)  
	TEnumAsByte<E_TypesOfModes>                        TypeOfMode_25_08CE888544BDDB22EC304A804F2FC09E;             // 0x0040   (0x0001)  
	TEnumAsByte<E_FunctionOfAttachment>                FunctionOfAttachment_29_8A64FCF947EAF219F89445925A1A701B;   // 0x0041   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0042   (0x0002)  MISSED
	FName                                              BracketName_33_A4B161AE451488A759725D8770DF7673;            // 0x0044   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x004C   (0x0004)  MISSED
	double                                             Power_38_02195733459070B66FD1E48FB1099833;                  // 0x0050   (0x0008)  
	double                                             EffectiveRange_39_3D311B1543004A4F74AC04B1C489D12D;         // 0x0058   (0x0008)  
	double                                             Stability_42_E7DC8028469DBC3FCC79C5A298C83A09;              // 0x0060   (0x0008)  
	double                                             FiringRate_43_F715A54642D4EF8E41763A83D072B78E;             // 0x0068   (0x0008)  
	double                                             AttachmentMultiplier_HorizontalMain_56_9B1FFFB345062287C115D483636DB011; // 0x0070   (0x0008)  
	double                                             AttachmentMultiplier2_VerticalSecondary_59_E56D6A7C4F00ABC09327E89795F5B932; // 0x0078   (0x0008)  
};

/// Struct /Game/Blueprints/PerkSystem/S_PerkData.S_PerkData
/// Size: 0x00F9 (0x000000 - 0x0000F9)
struct FS_PerkData
{ 
	FName                                              ID_30_53638C514DD973C3E6B3EC87460482FD;                     // 0x0000   (0x0008)  
	FText                                              DisplayName_2_24FCE5024E56F948F7A509A28D42C3A6;             // 0x0008   (0x0018)  
	FText                                              Description_27_B761D08B40DEE5316DF6C9A978AAB0EB;            // 0x0020   (0x0018)  
	bool                                               Achievable_5_12BDB9364FB7AF259D251DAE0851ACB6;              // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0039   (0x0007)  MISSED
	TMap<FString, float>                               AchieveCondition_22_CEA8F66F48FAB2C109E5C394278C6091;       // 0x0040   (0x0050)  
	FName                                              BlockedPerkID_14_09662DC04F99B340F88E5D82BA14C07E;          // 0x0090   (0x0008)  
	TWeakObjectPtr<UClass*>                            ObjectRef_18_04DBD0E24F9773B870E727AF3D7ABBF2;              // 0x0098   (0x0030)  
	TWeakObjectPtr<UPaperSprite*>                      Sprite_15_5B89E3D346840D0204368F88D96F5247;                 // 0x00C8   (0x0030)  
	bool                                               IsActive_32_00DAF5CC44AC64ED173BFC84CB7D54FF;               // 0x00F8   (0x0001)  
};

/// Struct /Game/Blueprints/PlayerRoom/PlayerRoomItemsStructure.PlayerRoomItemsStructure
/// Size: 0x0020 (0x000000 - 0x000020)
struct FPlayerRoomItemsStructure
{ 
	TArray<FName>                                      ItemsInside_8_9F643F9848549D098AB164A0320C3FD8;             // 0x0000   (0x0010)  
	TArray<FTransform>                                 ItemsInsideTransform_7_D73F878A44B01A83359ABC9D54A11B0D;    // 0x0010   (0x0010)  
};

/// Struct /Game/Blueprints/NameArray.NameArray
/// Size: 0x0010 (0x000000 - 0x000010)
struct FNameArray
{ 
	TArray<FName>                                      Array_3_7C40CBEC4AFE99AFA87292A4FDBA2E0D;                   // 0x0000   (0x0010)  
};

/// Struct /Game/Blueprints/EquipmentData/MaterialArray.MaterialArray
/// Size: 0x0010 (0x000000 - 0x000010)
struct FMaterialArray
{ 
	TArray<UMaterialInstanceDynamic*>                  MemberVar_0_2_5A1E3EE240E961526F8EFDACD0B083A4;             // 0x0000   (0x0010)  
};

/// Struct /Game/Blueprints/EquipmentData/EquipmentData.EquipmentData
/// Size: 0x0180 (0x000000 - 0x000180)
struct FEquipmentData
{ 
	FName                                              Id_3_1799B7E74DBEE3498AB2D2B1E0CD6772;                      // 0x0000   (0x0008)  
	TWeakObjectPtr<USkeletalMesh*>                     SkeletalMesh_37_9AEFA88C445DCF0308392CACA54A8FC7;           // 0x0008   (0x0030)  
	TWeakObjectPtr<USkeletalMesh*>                     SkeletalMeshFemale_38_1F845FD64254047C7782C0AFA1C31C31;     // 0x0038   (0x0030)  
	TMap<FName, FNameArray>                            Armor_15_E745A7D846AC529C111173ADDFCED7C5;                  // 0x0068   (0x0050)  
	TMap<FName, FNameArray>                            Backpack_17_825CFB944D46ACAE6B5D3197146C196C;               // 0x00B8   (0x0050)  
	TMap<FName, FNameArray>                            Outerwear_22_F3423D3F4361474613F56F919CE34E1E;              // 0x0108   (0x0050)  
	double                                             DistanceToCameraWorkbench_25_F356C6F44184EC483619799B3CBE938E; // 0x0158   (0x0008)  
	FVector                                            LocationArmorWorkbench_29_33D813204502D8334A6124ADE1449AA4; // 0x0160   (0x0018)  
	FName                                              ActiveMorphName_32_8D8DCF564851D8BC7E4F3F809C5235FA;        // 0x0178   (0x0008)  
};

/// Struct /Game/Blueprints/ClimbSystem/ComponentAndTransform.ComponentAndTransform
/// Size: 0x00C0 (0x000000 - 0x0000C0)
struct FComponentAndTransform
{ 
	FTransform                                         Transform_2_D92E11E44B8F8693BB01F6BDC89C9D1A;               // 0x0000   (0x0060)  
	FTransform                                         ComponentTransform_7_610B6CF84D3B0191E2EC9686FA86399C;      // 0x0060   (0x0060)  
};

/// Struct /Game/Blueprints/ClimbSystem/ClimbParams.ClimbParams
/// Size: 0x00A8 (0x000000 - 0x0000A8)
struct FClimbParams
{ 
	UAnimMontage*                                      AnimMontage_2_685027524299C4031F7ADABE1830A9C0;             // 0x0000   (0x0008)  
	UCurveVector*                                      PositionCorrectionCurve_5_1274FC9A4691D87E38ADA5AD5C9609F7; // 0x0008   (0x0008)  
	float                                              StartingPosition_8_A0086F1C489E1A8FCC7A089DA9098F30;        // 0x0010   (0x0004)  
	float                                              PlayRate_10_5A4BA53444A8472EC2A69682EDEC3BD2;               // 0x0014   (0x0004)  
	FVector                                            StartingOffset_13_7B27764744192BFEE1BE5EA4E7430459;         // 0x0018   (0x0018)  
	FVector                                            EndingOffset_18_5A5E2B7247ECBDCD209C15AF1943AA26;           // 0x0030   (0x0018)  
	FName                                              BoneRoot_21_5CDC5A804A585EC376F4B4A53CB51369;               // 0x0048   (0x0008)  
	UCurveVector*                                      PositionLerpCurve_24_85D17E9B42832242D114BBBB9729709A;      // 0x0050   (0x0008)  
	FVector                                            AdditionalOffset_27_67CCB0CD4B44AA584501998641ACAD65;       // 0x0058   (0x0018)  
	bool                                               In_29_42DDD461462E112A4EE940A136ACD591;                     // 0x0070   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0071   (0x0003)  MISSED
	float                                              DistanceToCutOff_33_E473D8DE47D1E748CD1A53836EB562D4;       // 0x0074   (0x0004)  
	float                                              CutOffTime_35_109817F64251AEDE0C610A84A9BC1DC1;             // 0x0078   (0x0004)  
	float                                              BlendoutTime_37_A156E0D94FFA7ED3F3E55DB028DD6537;           // 0x007C   (0x0004)  
	float                                              ObstacleWidth_40_2E76D7C84DC9B44CEA5876B961E2CD7E;          // 0x0080   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0084   (0x0004)  MISSED
	UCurveFloat*                                       RootMotion_X_45_EB7302BF49DE083BCB2EF0B9DEDB5926;           // 0x0088   (0x0008)  
	UCurveFloat*                                       RootMotion_Y_46_66EC1D4B4575AE5FC0B0EA89E3E9D429;           // 0x0090   (0x0008)  
	UCurveFloat*                                       RootMotion_Z_47_C773E2A24BD5FB06BB41FB8715444D7B;           // 0x0098   (0x0008)  
	UCurveVector*                                      LerpValues_50_EC6A30844577D6762098FF96CD305C5B;             // 0x00A0   (0x0008)  
};

/// Struct /Game/Blueprints/ClimbSystem/ClimbAsset.ClimbAsset
/// Size: 0x00F8 (0x000000 - 0x0000F8)
struct FClimbAsset
{ 
	TMap<TEnumAsByte, UAnimMontage*>                   AnimMontage_57_BD00EE9F4B1E484AAFEFA89FDD922D70;            // 0x0000   (0x0050)  
	UCurveVector*                                      PositionCorrectionCurve_5_9414BD1C41F04C5AC213BCBA9611377A; // 0x0050   (0x0008)  
	FVector                                            StartingOffset_8_7657CDE843C0C777C1D860B955D248A9;          // 0x0058   (0x0018)  
	float                                              LowHeight_11_CC8A2D0C4A41FC4B8A9B9BA36B992CB0;              // 0x0070   (0x0004)  
	float                                              LowPlayRate_13_82808E3F46E28E5D45A90C875E789705;            // 0x0074   (0x0004)  
	float                                              LowStartPosition_15_D0CC52B74A732AD664C73192BB87E3F9;       // 0x0078   (0x0004)  
	float                                              HIghHeight_17_A76500934A5ABEC4883CAD8AA1FF3E39;             // 0x007C   (0x0004)  
	float                                              HighPlayRate_19_6FDEF6EB49F64D22EA595DB38DF678C7;           // 0x0080   (0x0004)  
	float                                              HighStartPosition_21_3DD65489489DBEDF770F26925175CD8A;      // 0x0084   (0x0004)  
	FVector                                            EndingOffset_25_8844DCCC48E6EB13D5EAE6A8FBADD173;           // 0x0088   (0x0018)  
	FName                                              BoneRoot_28_7660ED434440B3C9C6BEDD9AA0B3378B;               // 0x00A0   (0x0008)  
	UCurveVector*                                      PositionLerpCurve_31_F0C1912842F8C219392355954EE2689F;      // 0x00A8   (0x0008)  
	FVector                                            AdditionalOffset_34_6B2E4A6540D1390DDDC518AACF7495F8;       // 0x00B0   (0x0018)  
	float                                              DistanceToCutOff_41_221A9A5D42627B67FDECE6A3FA41877D;       // 0x00C8   (0x0004)  
	float                                              CutOffTime_42_DB5550D6443076F8220630B723DD1C91;             // 0x00CC   (0x0004)  
	float                                              BlendoutTime_44_6EC430DB4092CD41153EC386115D39A2;           // 0x00D0   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x00D4   (0x0004)  MISSED
	UCurveFloat*                                       RootMotion_X_47_2055FF27439D8C0228D991AC2F7E7E35;           // 0x00D8   (0x0008)  
	UCurveFloat*                                       RootMotion_Y_49_53748DCE45567F58718527922A1BC3DD;           // 0x00E0   (0x0008)  
	UCurveFloat*                                       RootMotion_Z_51_F127054742C28E0A69743E925691FB8A;           // 0x00E8   (0x0008)  
	UCurveVector*                                      LerpValues_54_C650BD4541AD49101F144497D78CFEE0;             // 0x00F0   (0x0008)  
};

/// Struct /Game/Blueprints/QuestSystem/V5/QuestsData/F_RPZoneInfo.F_RPZoneInfo
/// Size: 0x0002 (0x000000 - 0x000002)
struct FF_RPZoneInfo
{ 
	TEnumAsByte<E_Works>                               WorkType_3_0ADFAE334650B5C954C0C28AF0495CC8;                // 0x0000   (0x0001)  
	bool                                               ProgressZone_6_133B71614C1278AF091ED8BD53738512;            // 0x0001   (0x0001)  
};

/// Struct /Game/Blueprints/QuestSystem/V5/QuestsData/F_EasyQuestsList.F_EasyQuestsList
/// Size: 0x0050 (0x000000 - 0x000050)
struct FF_EasyQuestsList
{ 
	TSet<UQuest*>                                      Quests_5_47F0E8D340F8E00CC3EEAB89A3151534;                  // 0x0000   (0x0050)  
};

/// Struct /Game/Blueprints/LootGeneration/LootG2/ZoneAnalyzer.ZoneAnalyzer
/// Size: 0x0010 (0x000000 - 0x000010)
struct FZoneAnalyzer
{ 
	TArray<int32_t>                                    Map_3_D15620444B1CB444922C75B3991201C8;                     // 0x0000   (0x0010)  
};

/// Struct /Game/Blueprints/InventoryWorker/DropItemEntry.DropItemEntry
/// Size: 0x0240 (0x000000 - 0x000240)
struct FDropItemEntry
{ 
	FString                                            ItemName_4_7F78A0B347F59F8E705C3790661AAE1C;                // 0x0000   (0x0010)  
	int32_t                                            Count_5_88D1828449F6230942DD75ACB979E25A;                   // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	double                                             Price_8_D4D7892A46CE26D4CAB021A775162EAC;                   // 0x0018   (0x0008)  
	FFItemInfo                                         ItemInfo_11_70C1100B4F6D5AC94C5FE0A050ED621C;               // 0x0020   (0x0220)  
};

/// Struct /Game/Blueprints/EffectSystem/EffectContructor.EffectContructor
/// Size: 0x000C (0x000000 - 0x00000C)
struct FEffectContructor
{ 
	TEnumAsByte<EffectType>                            EffectType_6_678F8F5E44BA5B49234B3FA7EBCD2759;              // 0x0000   (0x0001)  
	TEnumAsByte<StatType>                              StatType_7_7C1585B545CD1E807191B59704B09603;                // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0002   (0x0002)  MISSED
	float                                              Value_8_12C081DA47BB84CB5CCA7E97D798174C;                   // 0x0004   (0x0004)  
	float                                              Duration_10_29D2E00D4D76CF0367445398C43498D6;               // 0x0008   (0x0004)  
};

/// Struct /Game/Blueprints/QuestSystem/V4/QuestSaveStructure.QuestSaveStructure
/// Size: 0x0020 (0x000000 - 0x000020)
struct FQuestSaveStructure
{ 
	TArray<int32_t>                                    ActiveObjectives_5_73C3DF5A4580D30DBEADB88C62241584;        // 0x0000   (0x0010)  
	TArray<int32_t>                                    CompletedObjectives_3_D871538F4C47A76B852D8CAD4344EE9E;     // 0x0010   (0x0010)  
};

/// Struct /Game/Blueprints/InventoryWorker/NPC_Structure.NPC_Structure
/// Size: 0x0110 (0x000000 - 0x000110)
struct FNPC_Structure
{ 
	UDataTable*                                        DataTable_2_9FAF6160404AC0288F147FB2B4D7EB37;               // 0x0000   (0x0008)  
	FText                                              NPC_Name_5_D2B2D5884BEDCBBA043FB299AF9F262C;                // 0x0008   (0x0018)  
	TEnumAsByte<E_NPC_Name>                            NPCName_Enum_46_4003EC284B93DE371D4A1EA84FA49D3A;           // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0021   (0x0007)  MISSED
	TArray<UQuest*>                                    QuestSysStruct_20_97101EAC4BC20EB59A991ABDE41C7D3A;         // 0x0028   (0x0010)  
	TArray<UQuest*>                                    SpecQuests_43_0CCB9915480FC7DD7B9AFDB6B880D70A;             // 0x0038   (0x0010)  
	FName                                              Type_19_5AC686444D9C0151B8964099ADFD7086;                   // 0x0048   (0x0008)  
	FText                                              TypeDisplayName_23_B19F345F49F3177CA0567EACB947F882;        // 0x0050   (0x0018)  
	TWeakObjectPtr<UPaperSprite*>                      Portrait_50_A87ED46D41315D780ADC14BE2DA1E80E;               // 0x0068   (0x0030)  
	TWeakObjectPtr<UPaperSprite*>                      Icon_51_0213283345D2DBF067FED09B0EBBAF5B;                   // 0x0098   (0x0030)  
	TWeakObjectPtr<UPaperSprite*>                      BigPortrait_52_2EB928B645718F079628B69B27A179A5;            // 0x00C8   (0x0030)  
	FText                                              Tip_31_207DB78441DF05596629DB94BEB87AC6;                    // 0x00F8   (0x0018)  
};

/// Class /Game/Blueprints/BP_Sauna_Mesh.BP_Sauna_Mesh_C
/// Size: 0x0050 (0x000290 - 0x0002E0)
class ABP_Sauna_Mesh_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	USkeletalMeshComponent*                            Hair2;                                                      // 0x0298   (0x0008)  
	USkeletalMeshComponent*                            Pants;                                                      // 0x02A0   (0x0008)  
	USkeletalMeshComponent*                            beard;                                                      // 0x02A8   (0x0008)  
	USkeletalMeshComponent*                            Hair;                                                       // 0x02B0   (0x0008)  
	USkeletalMeshComponent*                            Head;                                                       // 0x02B8   (0x0008)  
	USkeletalMeshComponent*                            Outerwear;                                                  // 0x02C0   (0x0008)  
	USceneComponent*                                   Scene;                                                      // 0x02C8   (0x0008)  
	ASurvivalPlayer_C*                                 Surv_Ref;                                                   // 0x02D0   (0x0008)  
	ABP_Sauna_Entering_C*                              entering;                                                   // 0x02D8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/BP_Sauna_Mesh.BP_Sauna_Mesh_C.SetMaterial
	void SetMaterial(FS_SaveStructure Save, USkeletalMeshComponent* Outwear, USkeletalMeshComponent* Pants);                 // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Mesh.BP_Sauna_Mesh_C.SetMeshMaterial
	void SetMeshMaterial(UMeshComponent* GetMat, UPrimitiveComponent* Target);                                               // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Mesh.BP_Sauna_Mesh_C.Head Customization
	void Head Customization();                                                                                               // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Mesh.BP_Sauna_Mesh_C.Skin Tone
	UMaterialInterface* Skin Tone(float Value, USkeletalMeshComponent* selfComp, USkeletalMeshComponent* SurvComp);          // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Mesh.BP_Sauna_Mesh_C.SetSkeletalCloth
	void SetSkeletalCloth(USkeletalMeshComponent* SMRef, TWeakObjectPtr<USkeletalMesh*> SSMRef);                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Mesh.BP_Sauna_Mesh_C.mesh Update
	void mesh Update(ASurvivalPlayer_C* survRef);                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Mesh.BP_Sauna_Mesh_C.MeshCheck
	void MeshCheck();                                                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Mesh.BP_Sauna_Mesh_C.ExecuteUbergraph_BP_Sauna_Mesh
	void ExecuteUbergraph_BP_Sauna_Mesh(int32_t EntryPoint);                                                                 // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C
/// Size: 0x0088 (0x000290 - 0x000318)
class ABP_Sauna_Exit_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	UBoxComponent*                                     ExitInteractBox;                                            // 0x0298   (0x0008)  
	USceneComponent*                                   PointToInteract;                                            // 0x02A0   (0x0008)  
	USceneComponent*                                   Scene;                                                      // 0x02A8   (0x0008)  
	bool                                               Has_Reset;                                                  // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B1   (0x0007)  MISSED
	FTimerHandle                                       Timer_by_reset;                                             // 0x02B8   (0x0008)  
	ASurvPC_C*                                         Current_PC;                                                 // 0x02C0   (0x0008)  
	TArray<ABP_PlayerSpawnPoint_C*>                    Regions;                                                    // 0x02C8   (0x0010)  
	double                                             angle;                                                      // 0x02D8   (0x0008)  
	bool                                               StartTeleport;                                              // 0x02E0   (0x0001)  
	bool                                               PrevLineTraceResult;                                        // 0x02E1   (0x0001)  
	bool                                               InteractingAnimation;                                       // 0x02E2   (0x0001)  
	unsigned char                                      UnknownData01_5[0x5];                                       // 0x02E3   (0x0005)  MISSED
	UPlayerCutsceneComponent_C*                        CutscenePlayer;                                             // 0x02E8   (0x0008)  
	TArray<AActor*>                                    SaunaSpots;                                                 // 0x02F0   (0x0010)  
	FTimerHandle                                       SaunaUpdateTimer;                                           // 0x0300   (0x0008)  
	bool                                               PlayerInSauna;                                              // 0x0308   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0309   (0x0007)  MISSED
	AActor*                                            PickedSaunaSpot;                                            // 0x0310   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.OnFocused
	void OnFocused(APawn* Player, AActor* HighlightActor, UActorComponent* HighlightActorComponent, TEnumAsByte<E_InteractType>& InteractType, double& LateTime); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.GetActorType
	void GetActorType(TEnumAsByte<E_ActorType>& ActorType);                                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.IsLocked?
	void IsLocked?(bool& Result);                                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.PickSaunaSpot
	void PickSaunaSpot(AActor*& SaunaSpot);                                                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.IsSomethingOnA Way
	bool IsSomethingOnA Way();                                                                                               // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.IsInViewport
	bool IsInViewport();                                                                                                     // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.On Black Screen Opened
	void On Black Screen Opened();                                                                                           // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.OnInteract3
	void OnInteract3(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.OnInteract2
	void OnInteract2(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.Run Lockpicking
	void Run Lockpicking();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.OnBeginInteract
	void OnBeginInteract(APawn* Player);                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.OnStopInteract
	void OnStopInteract(APawn* Player);                                                                                      // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.OnSquadCheckComplete
	void OnSquadCheckComplete();                                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.OnInteract
	void OnInteract(APawn* Player);                                                                                          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.PlayEndCutscene
	void PlayEndCutscene();                                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.Set3DWidgetVisibility
	void Set3DWidgetVisibility(bool Visible);                                                                                // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.SetTutorial3DWidgetVisibility
	void SetTutorial3DWidgetVisibility(bool Visible);                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.DestroyInteractable
	void DestroyInteractable();                                                                                              // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.Reset Timer
	void Reset Timer();                                                                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.DetectExit
	void DetectExit();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.FocusOver
	void FocusOver(UUIW_PlayerMain_C* FocusOver);                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.Reset
	void Reset();                                                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.OnInteractVehicle
	void OnInteractVehicle(APawn* Player, int32_t SitIndex, bool SkipAnimation);                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.OnSeen
	void OnSeen(APawn* Player);                                                                                              // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.OnLocalInteract
	void OnLocalInteract(APawn* Player);                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.OnLostFocus
	void OnLostFocus(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Exit.BP_Sauna_Exit_C.ExecuteUbergraph_BP_Sauna_Exit
	void ExecuteUbergraph_BP_Sauna_Exit(int32_t EntryPoint);                                                                 // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/CampingSystem/Bag/BPA_SleepingBag.BPA_SleepingBag_C
/// Size: 0x028A (0x000350 - 0x0005DA)
class UBPA_SleepingBag_C : public UAnimInstance : UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0358   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0360   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0368   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0388   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x03B0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x03D8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0420   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0440   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0488   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x04A8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x04F0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0510   (0x00C8)  
	bool                                               Close;                                                      // 0x05D8   (0x0001)  
	bool                                               Open;                                                       // 0x05D9   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/CampingSystem/Bag/BPA_SleepingBag.BPA_SleepingBag_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BPA_SleepingBag.BPA_SleepingBag_C.BlueprintUpdateAnimation
	void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BPA_SleepingBag.BPA_SleepingBag_C.ExecuteUbergraph_BPA_SleepingBag
	void ExecuteUbergraph_BPA_SleepingBag(int32_t EntryPoint);                                                               // [0x2407bf0] Final                
};

/// Class /Game/Blueprints/CampingSystem/Bag/SleepingBagStubAnim.SleepingBagStubAnim_C
/// Size: 0x0222 (0x000350 - 0x000572)
class USleepingBagStubAnim_C : public UAnimInstance : UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0358   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0360   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0368   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0388   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x03B0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x03D8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0420   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0440   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0488   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x04A8   (0x00C8)  
	bool                                               IsPlacing;                                                  // 0x0570   (0x0001)  
	bool                                               IsStopping;                                                 // 0x0571   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/CampingSystem/Bag/SleepingBagStubAnim.SleepingBagStubAnim_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/SleepingBagStubAnim.SleepingBagStubAnim_C.BlueprintUpdateAnimation
	void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/SleepingBagStubAnim.SleepingBagStubAnim_C.ExecuteUbergraph_SleepingBagStubAnim
	void ExecuteUbergraph_SleepingBagStubAnim(int32_t EntryPoint);                                                           // [0x2407bf0] Final                
};

/// Class /Game/Blueprints/Throwable/LabBomb/BP_LabBombExplosion.BP_LabBombExplosion_C
/// Size: 0x0010 (0x000290 - 0x0002A0)
class ABP_LabBombExplosion_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x0298   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Throwable/LabBomb/BP_LabBombExplosion.BP_LabBombExplosion_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/LabBomb/BP_LabBombExplosion.BP_LabBombExplosion_C.ExecuteUbergraph_BP_LabBombExplosion
	void ExecuteUbergraph_BP_LabBombExplosion(int32_t EntryPoint);                                                           // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Throwable/Molotov/BP_MolotovFire.BP_MolotovFire_C
/// Size: 0x0058 (0x000290 - 0x0002E8)
class ABP_MolotovFire_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	USceneComponent*                                   p4;                                                         // 0x0298   (0x0008)  
	USceneComponent*                                   p3;                                                         // 0x02A0   (0x0008)  
	USceneComponent*                                   p2;                                                         // 0x02A8   (0x0008)  
	USceneComponent*                                   p1;                                                         // 0x02B0   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x02B8   (0x0008)  
	TArray<UParticleSystemComponent*>                  Fires;                                                      // 0x02C0   (0x0010)  
	bool                                               DoDamage;                                                   // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02D1   (0x0007)  MISSED
	double                                             Duration;                                                   // 0x02D8   (0x0008)  
	double                                             Damage;                                                     // 0x02E0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Throwable/Molotov/BP_MolotovFire.BP_MolotovFire_C.StopFires
	void StopFires();                                                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/Molotov/BP_MolotovFire.BP_MolotovFire_C.SpawnParticleAt
	void SpawnParticleAt(FVector Location);                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/Molotov/BP_MolotovFire.BP_MolotovFire_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/Molotov/BP_MolotovFire.BP_MolotovFire_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/Molotov/BP_MolotovFire.BP_MolotovFire_C.Stop
	void Stop();                                                                                                             // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/Molotov/BP_MolotovFire.BP_MolotovFire_C.ExecuteUbergraph_BP_MolotovFire
	void ExecuteUbergraph_BP_MolotovFire(int32_t EntryPoint);                                                                // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C
/// Size: 0x00F0 (0x000280 - 0x000370)
class UWBP_AdminPanel_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWBP_AdminPanelButton_C*                           AdminButton;                                                // 0x0288   (0x0008)  
	UWBP_AdminPanelButton_C*                           BanButton;                                                  // 0x0290   (0x0008)  
	UWBP_AdminPanelButton_C*                           ExitButton;                                                 // 0x0298   (0x0008)  
	UWBP_AdminPanelButton_C*                           FreeCamButton;                                              // 0x02A0   (0x0008)  
	UEditableTextBox*                                  IdTextBox;                                                  // 0x02A8   (0x0008)  
	UWBP_AdminPanelButton_C*                           KickButton;                                                 // 0x02B0   (0x0008)  
	UWBP_AdminPanelButton_C*                           MercyButton;                                                // 0x02B8   (0x0008)  
	UWBP_AdminPanelButton_C*                           MuteButton;                                                 // 0x02C0   (0x0008)  
	UCheckBox*                                         NewAdmin;                                                   // 0x02C8   (0x0008)  
	UWBP_AdminPanelButton_C*                           PlayersButton;                                              // 0x02D0   (0x0008)  
	UEditableTextBox*                                  ReasonTextBox;                                              // 0x02D8   (0x0008)  
	UTextBlock*                                        Result;                                                     // 0x02E0   (0x0008)  
	UTextBlock*                                        Result;                                                     // 0x02E8   (0x0008)  
	UScrollBox*                                        ScrollBox;                                                  // 0x02F0   (0x0008)  
	UWBP_AdminPanelButton_C*                           SetTargetButton;                                            // 0x02F8   (0x0008)  
	UWBP_AdminPanelButton_C*                           SpectateButton;                                             // 0x0300   (0x0008)  
	UWBP_AdminPanelButton_C*                           SpectatorButton;                                            // 0x0308   (0x0008)  
	UCanvasPanel*                                      TargetCanvas;                                               // 0x0310   (0x0008)  
	UEditableTextBox*                                  TimeTextBox;                                                // 0x0318   (0x0008)  
	UWBP_AdminPanelButton_C*                           WarningButton;                                              // 0x0320   (0x0008)  
	bool                                               ShowPlayersMode;                                            // 0x0328   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0329   (0x0007)  MISSED
	TArray<APS_TDB_C*>                                 PSArray;                                                    // 0x0330   (0x0010)  
	TArray<UWBP_AdminPanelButton_C*>                   PlayersWidget;                                              // 0x0340   (0x0010)  
	APS_TDB_C*                                         TargetPlayer;                                               // 0x0350   (0x0008)  
	FString                                            TargetSteamId;                                              // 0x0358   (0x0010)  
	UBPC_AdminPanel_C*                                 AdminBPC;                                                   // 0x0368   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.SetMessage
	void SetMessage(FText InText);                                                                                           // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.ExitButtonPressed
	void ExitButtonPressed(UWBP_AdminPanelButton_C* TargetButton);                                                           // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.PlayersButtonPressed
	void PlayersButtonPressed(UWBP_AdminPanelButton_C* TargetButton);                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.SetTarget
	void SetTarget(UWBP_AdminPanelButton_C* TargetButton);                                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.TargetButtonPressed
	void TargetButtonPressed(UWBP_AdminPanelButton_C* TargetButton);                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.OnKickButtonPressed
	void OnKickButtonPressed(UWBP_AdminPanelButton_C* TargetButton);                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.BanButtonPressed
	void BanButtonPressed(UWBP_AdminPanelButton_C* TargetButton);                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.MuteButtonPressed
	void MuteButtonPressed(UWBP_AdminPanelButton_C* TargetButton);                                                           // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.AdminButtonPressed
	void AdminButtonPressed(UWBP_AdminPanelButton_C* TargetButton);                                                          // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.MercyButtonPressed
	void MercyButtonPressed(UWBP_AdminPanelButton_C* TargetButton);                                                          // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.WarningButtonPressed
	void WarningButtonPressed(UWBP_AdminPanelButton_C* TargetButton);                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/WBP_AdminPanel.WBP_AdminPanel_C.ExecuteUbergraph_WBP_AdminPanel
	void ExecuteUbergraph_WBP_AdminPanel(int32_t EntryPoint);                                                                // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/DayTimeSystem/Old/BP_Sky_SphereCustom.BP_Sky_SphereCustom_C
/// Size: 0x00C8 (0x000290 - 0x000358)
class ABP_Sky_SphereCustom_C : public AActor : AActor
{ 
public:
	UStaticMeshComponent*                              SkySphereMesh;                                              // 0x0290   (0x0008)  
	USceneComponent*                                   base;                                                       // 0x0298   (0x0008)  
	UMaterialInstanceDynamic*                          Sky_Material;                                               // 0x02A0   (0x0008)  
	bool                                               Refresh_material;                                           // 0x02A8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02A9   (0x0007)  MISSED
	ADirectionalLight*                                 Directional_light_actor;                                    // 0x02B0   (0x0008)  
	bool                                               Colors_determined_by_sun_position;                          // 0x02B8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02B9   (0x0007)  MISSED
	double                                             Sun_height;                                                 // 0x02C0   (0x0008)  
	double                                             Sun_brightness;                                             // 0x02C8   (0x0008)  
	double                                             Horizon_falloff;                                            // 0x02D0   (0x0008)  
	FLinearColor                                       Zenith_color;                                               // 0x02D8   (0x0010)  
	FLinearColor                                       Horizon_color;                                              // 0x02E8   (0x0010)  
	FLinearColor                                       Cloud_color;                                                // 0x02F8   (0x0010)  
	FLinearColor                                       Overall_Color;                                              // 0x0308   (0x0010)  
	double                                             Cloud_Speed;                                                // 0x0318   (0x0008)  
	double                                             Cloud_Opacity;                                              // 0x0320   (0x0008)  
	double                                             Stars_brightness;                                           // 0x0328   (0x0008)  
	UCurveLinearColor*                                 Horizon_color_curve;                                        // 0x0330   (0x0008)  
	UCurveLinearColor*                                 Zenith_color_curve;                                         // 0x0338   (0x0008)  
	UCurveLinearColor*                                 Cloud_color_curve;                                          // 0x0340   (0x0008)  
	AActor*                                            SunDirector;                                                // 0x0348   (0x0008)  
	double                                             SunRadius;                                                  // 0x0350   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/DayTimeSystem/Old/BP_Sky_SphereCustom.BP_Sky_SphereCustom_C.RefreshMaterial
	void RefreshMaterial();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayTimeSystem/Old/BP_Sky_SphereCustom.BP_Sky_SphereCustom_C.UpdateSunDirection
	void UpdateSunDirection();                                                                                               // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayTimeSystem/Old/BP_Sky_SphereCustom.BP_Sky_SphereCustom_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x2407bf0] Event|Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal_Entry.WBP_GPSJournal_Entry_C
/// Size: 0x0070 (0x000280 - 0x0002F0)
class UWBP_GPSJournal_Entry_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UButton*                                           Button_Details;                                             // 0x0288   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_Timer;                                        // 0x0290   (0x0008)  
	UImage*                                            Image;                                                      // 0x0298   (0x0008)  
	UImage*                                            Image_QuestGiver;                                           // 0x02A0   (0x0008)  
	UTextBlock*                                        TextBlock_Description;                                      // 0x02A8   (0x0008)  
	UTextBlock*                                        TextBlock_QuestgiverName;                                   // 0x02B0   (0x0008)  
	UTextBlock*                                        TextBlock_RewardMoney;                                      // 0x02B8   (0x0008)  
	UTextBlock*                                        TextBlock_Time;                                             // 0x02C0   (0x0008)  
	UQuest*                                            Quest;                                                      // 0x02C8   (0x0008)  
	FTimerHandle                                       QuestTimer;                                                 // 0x02D0   (0x0008)  
	FTimerHandle                                       UpdateTimer;                                                // 0x02D8   (0x0008)  
	FMulticastInlineDelegate                           OnDetailsClicked;                                           // 0x02E0   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal_Entry.WBP_GPSJournal_Entry_C.Int to Time String
	void Int to Time String(int32_t Num, FString& Value);                                                                    // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal_Entry.WBP_GPSJournal_Entry_C.UpdateTime
	void UpdateTime();                                                                                                       // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal_Entry.WBP_GPSJournal_Entry_C.Init
	void Init();                                                                                                             // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal_Entry.WBP_GPSJournal_Entry_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal_Entry.WBP_GPSJournal_Entry_C.Destruct
	void Destruct();                                                                                                         // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal_Entry.WBP_GPSJournal_Entry_C.BndEvt__WBP_GPSJournal_Entry_Button_Details_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
	void BndEvt__WBP_GPSJournal_Entry_Button_Details_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal_Entry.WBP_GPSJournal_Entry_C.BndEvt__WBP_GPSJournal_Entry_Button_Details_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_GPSJournal_Entry_Button_Details_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();   // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal_Entry.WBP_GPSJournal_Entry_C.ExecuteUbergraph_WBP_GPSJournal_Entry
	void ExecuteUbergraph_WBP_GPSJournal_Entry(int32_t EntryPoint);                                                          // [0x2407bf0] Final|HasDefaults    
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal_Entry.WBP_GPSJournal_Entry_C.OnDetailsClicked__DelegateSignature
	void OnDetailsClicked__DelegateSignature(UQuest* Quest);                                                                 // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C
/// Size: 0x008A (0x000280 - 0x00030A)
class UWBP_GPSJournal_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Anim_ShowQuesDetails;                                       // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Anim_ShowQuestsList;                                        // 0x0290   (0x0008)  
	UVerticalBox*                                      VerticalBox_Entries;                                        // 0x0298   (0x0008)  
	UWBP_GPSQuestDetails_C*                            WBP_GPSQuestDetails;                                        // 0x02A0   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_Content;                                     // 0x02A8   (0x0008)  
	ASurvPC_C*                                         As_Surv_PC;                                                 // 0x02B0   (0x0008)  
	TMap<UQuest*, UWBP_GPSJournal_Entry_C*>            ActiveWidgets;                                              // 0x02B8   (0x0050)  
	bool                                               bInit;                                                      // 0x0308   (0x0001)  
	bool                                               bLocked;                                                    // 0x0309   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.SetLocked
	void SetLocked(bool bLocked);                                                                                            // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.Init
	void Init();                                                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.InitQuestList
	void InitQuestList();                                                                                                    // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.Finished_0C4085A24A0B592619AB01A031135766
	void Finished_0C4085A24A0B592619AB01A031135766();                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.Finished_734C62D54D5178651997FE9247EA68FD
	void Finished_734C62D54D5178651997FE9247EA68FD();                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.Finished_3CC307364274DD90BE084485F794D11E
	void Finished_3CC307364274DD90BE084485F794D11E();                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.Finished_B4E7AB5042A03E6EE685638D2B925BCB
	void Finished_B4E7AB5042A03E6EE685638D2B925BCB();                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.OnInitialized
	void OnInitialized();                                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.ShowDetails
	void ShowDetails(UQuest* Quest);                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.BndEvt__WBP_GPSJournal_WBP_GPSQuestDetails_K2Node_ComponentBoundEvent_0_OnDecline__DelegateSignature
	void BndEvt__WBP_GPSJournal_WBP_GPSQuestDetails_K2Node_ComponentBoundEvent_0_OnDecline__DelegateSignature(UQuest* Quest); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.ShowQuestList
	void ShowQuestList();                                                                                                    // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.Destruct
	void Destruct();                                                                                                         // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.BndEvt__WBP_GPSJournal_WBP_GPSQuestDetails_K2Node_ComponentBoundEvent_1_OnCancel__DelegateSignature
	void BndEvt__WBP_GPSJournal_WBP_GPSQuestDetails_K2Node_ComponentBoundEvent_1_OnCancel__DelegateSignature();              // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.ExpandQuestDetails
	void ExpandQuestDetails(UQuest* Quest);                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.BndEvt__WBP_GPSJournal_WBP_GPSQuestDetails_K2Node_ComponentBoundEvent_3_OnAccept__DelegateSignature
	void BndEvt__WBP_GPSJournal_WBP_GPSQuestDetails_K2Node_ComponentBoundEvent_3_OnAccept__DelegateSignature();              // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSJournal.WBP_GPSJournal_C.ExecuteUbergraph_WBP_GPSJournal
	void ExecuteUbergraph_WBP_GPSJournal(int32_t EntryPoint);                                                                // [0x2407bf0] Final                
};

/// Class /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSObjective.WBP_GPSObjective_C
/// Size: 0x0108 (0x000280 - 0x000388)
class UWBP_GPSObjective_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UBorder*                                           Border_Text;                                                // 0x0288   (0x0008)  
	UQuestObjectiveViewModel*                          QuestObjectiveViewModel;                                    // 0x0290   (0x0008)  
	UWidgetAnimation*                                  Outro;                                                      // 0x0298   (0x0008)  
	UWidgetAnimation*                                  Intro;                                                      // 0x02A0   (0x0008)  
	UBorder*                                           Border;                                                     // 0x02A8   (0x0008)  
	UTextBlock*                                        GoalText_Current;                                           // 0x02B0   (0x0008)  
	UTextBlock*                                        GoalText_Total;                                             // 0x02B8   (0x0008)  
	UImage*                                            Image_Separator;                                            // 0x02C0   (0x0008)  
	UTextBlock*                                        ObjectiveText;                                              // 0x02C8   (0x0008)  
	UTextBlock*                                        ObjectiveText;                                              // 0x02D0   (0x0008)  
	UImage*                                            StateImage;                                                 // 0x02D8   (0x0008)  
	UTextBlock*                                        TextBlock_Objective;                                        // 0x02E0   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_Counter;                                     // 0x02E8   (0x0008)  
	TMap<FString, int32_t>                             ObjectiveInfo;                                              // 0x02F0   (0x0050)  
	bool                                               bObjectiveCompleted;                                        // 0x0340   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0341   (0x0007)  MISSED
	ASurvivalPlayer_C*                                 Survival_Player;                                            // 0x0348   (0x0008)  
	FText                                              TextObjective;                                              // 0x0350   (0x0018)  
	FLinearColor                                       CompleteColor;                                              // 0x0368   (0x0010)  
	TEnumAsByte<E_Works>                               QuestType;                                                  // 0x0378   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0379   (0x0007)  MISSED
	ASurvPC_C*                                         Surv_PC;                                                    // 0x0380   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSObjective.WBP_GPSObjective_C.SetQuestObjectiveViewModel
	void SetQuestObjectiveViewModel(UQuestObjectiveViewModel* ViewModel);                                                    // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSObjective.WBP_GPSObjective_C.ParseText
	void ParseText(FText& TextObjective);                                                                                    // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSObjective.WBP_GPSObjective_C.IsObjectiveCompleted
	void IsObjectiveCompleted(bool& bObjectiveCompleted);                                                                    // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSObjective.WBP_GPSObjective_C.Init
	void Init();                                                                                                             // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSObjective.WBP_GPSObjective_C.__45748789-469c-368a-47d1-d595f185b0da_SourceToDest
	FLinearColor __45748789-469c-368a-47d1-d595f185b0da_SourceToDest();                                                      // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSObjective.WBP_GPSObjective_C.__ec0151ee-4afd-45c4-c3b1-1dafbd46bd63_SourceToDest
	FLinearColor __ec0151ee-4afd-45c4-c3b1-1dafbd46bd63_SourceToDest();                                                      // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSObjective.WBP_GPSObjective_C.Finished_C397537F41E36A82881D97B09A0664D3
	void Finished_C397537F41E36A82881D97B09A0664D3();                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSObjective.WBP_GPSObjective_C.PlayIntro
	void PlayIntro();                                                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSObjective.WBP_GPSObjective_C.PlayOutroAndRemove
	void PlayOutroAndRemove();                                                                                               // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSObjective.WBP_GPSObjective_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSObjective.WBP_GPSObjective_C.Destruct
	void Destruct();                                                                                                         // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSObjective.WBP_GPSObjective_C.ExecuteUbergraph_WBP_GPSObjective
	void ExecuteUbergraph_WBP_GPSObjective(int32_t EntryPoint);                                                              // [0x2407bf0] Final                
};

/// Class /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C
/// Size: 0x00F8 (0x000280 - 0x000378)
class UWBP_GPSQuestDetails_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UButton*                                           Button_Accept;                                              // 0x0288   (0x0008)  
	UButton*                                           Button_Accept;                                              // 0x0290   (0x0008)  
	UButton*                                           Button_Cancel;                                              // 0x0298   (0x0008)  
	UButton*                                           Button_Decline;                                             // 0x02A0   (0x0008)  
	UImage*                                            Image_QuestGiver;                                           // 0x02A8   (0x0008)  
	UTextBlock*                                        TextBlock_Desription;                                       // 0x02B0   (0x0008)  
	UTextBlock*                                        TextBlock_Location;                                         // 0x02B8   (0x0008)  
	UTextBlock*                                        TextBlock_MoneyReward;                                      // 0x02C0   (0x0008)  
	UTextBlock*                                        TextBlock_QuestgiverName;                                   // 0x02C8   (0x0008)  
	UTextBlock*                                        TextBlock_QuestName;                                        // 0x02D0   (0x0008)  
	UVerticalBox*                                      VerticalBox_Objectives;                                     // 0x02D8   (0x0008)  
	UWBP_GPSObjective_C*                               WBP_GPSObjective;                                           // 0x02E0   (0x0008)  
	UWBP_GPSObjective_C*                               WBP_GPSObjective;                                           // 0x02E8   (0x0008)  
	UWBP_GPSObjective_C*                               WBP_GPSObjective;                                           // 0x02F0   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_Content;                                     // 0x02F8   (0x0008)  
	UQuest*                                            Quest;                                                      // 0x0300   (0x0008)  
	ASurvPC_C*                                         As_Surv_PC;                                                 // 0x0308   (0x0008)  
	FMulticastInlineDelegate                           OnDecline;                                                  // 0x0310   (0x0010)  
	TArray<UWBP_GPSObjective_C*>                       ObjectiveWidgets;                                           // 0x0320   (0x0010)  
	FMulticastInlineDelegate                           OnCancel;                                                   // 0x0330   (0x0010)  
	FMulticastInlineDelegate                           OnAccept;                                                   // 0x0340   (0x0010)  
	bool                                               bLocked;                                                    // 0x0350   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0351   (0x0007)  MISSED
	TArray<UQuest*>                                    TrackedQuests;                                              // 0x0358   (0x0010)  
	FMulticastInlineDelegate                           TrackQuest;                                                 // 0x0368   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.SetLocked
	void SetLocked(bool bLocked);                                                                                            // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.CheckActiveQuestObjectivesState
	void CheckActiveQuestObjectivesState();                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.GetQuest
	void GetQuest(UQuest*& Quest);                                                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.CheckCompletedObjectives
	void CheckCompletedObjectives();                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.InitQuestDetails
	void InitQuestDetails(UQuest* Quest);                                                                                    // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.BndEvt__WBP_GPSQuestDetails_Button_Decline_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
	void BndEvt__WBP_GPSQuestDetails_Button_Decline_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();  // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.BndEvt__WBP_GPSQuestDetails_Button_Accept_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature
	void BndEvt__WBP_GPSQuestDetails_Button_Accept_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();   // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.OnInitialized
	void OnInitialized();                                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.BndEvt__WBP_GPSQuestDetails_Button_Cancel_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature
	void BndEvt__WBP_GPSQuestDetails_Button_Cancel_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();   // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.BndEvt__WBP_GPSQuestDetails_Button_Accept_1_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature
	void BndEvt__WBP_GPSQuestDetails_Button_Accept_1_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.BndEvt__WBP_GPSQuestDetails_Button_Decline_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_GPSQuestDetails_Button_Decline_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();    // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.BndEvt__WBP_GPSQuestDetails_Button_Accept_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_GPSQuestDetails_Button_Accept_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();     // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.ExecuteUbergraph_WBP_GPSQuestDetails
	void ExecuteUbergraph_WBP_GPSQuestDetails(int32_t EntryPoint);                                                           // [0x2407bf0] Final|HasDefaults    
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.TrackQuest__DelegateSignature
	void TrackQuest__DelegateSignature(bool Track);                                                                          // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.OnAccept__DelegateSignature
	void OnAccept__DelegateSignature();                                                                                      // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.OnCancel__DelegateSignature
	void OnCancel__DelegateSignature();                                                                                      // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/UI/GPS_Quests/WBP_GPSQuestDetails.WBP_GPSQuestDetails_C.OnDecline__DelegateSignature
	void OnDecline__DelegateSignature(UQuest* Quest);                                                                        // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/WeaponsSystem/BP_PiersingDamageType.BP_PiersingDamageType_C
/// Size: 0x0000 (0x000040 - 0x000040)
class UBP_PiersingDamageType_C : public UDamageType : UDamageType
{ 
public:
};

/// Class /Game/Blueprints/WeaponsSystem/BP_DefaultDamageType.BP_DefaultDamageType_C
/// Size: 0x0000 (0x000040 - 0x000040)
class UBP_DefaultDamageType_C : public UDamageType : UDamageType
{ 
public:
};

/// Class /Game/Blueprints/Trailer/WalkableArea.WalkableArea_C
/// Size: 0x0019 (0x000290 - 0x0002A9)
class AWalkableArea_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	UBoxComponent*                                     Box;                                                        // 0x0298   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x02A0   (0x0008)  
	bool                                               CanExit;                                                    // 0x02A8   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/Trailer/WalkableArea.WalkableArea_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Blueprints/Trailer/WalkableArea.WalkableArea_C.BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
	void BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/Trailer/WalkableArea.WalkableArea_C.RemoveOneIndex
	void RemoveOneIndex(FName Item, AActor* Target);                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Trailer/WalkableArea.WalkableArea_C.ExecuteUbergraph_WalkableArea
	void ExecuteUbergraph_WalkableArea(int32_t EntryPoint);                                                                  // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/SurvCameraManager.SurvCameraManager_C
/// Size: 0x0190 (0x003340 - 0x0034D0)
class ASurvCameraManager_C : public APlayerCameraManager : APlayerCameraManager
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x3340   (0x0008)  
	float                                              Timeline_0_NewTrack_0_E15C3AE94B5450B3608BF4A1DB25E119;     // 0x3348   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_0__Direction_E15C3AE94B5450B3608BF4A1DB25E119;     // 0x334C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x334D   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x3350   (0x0008)  
	FVector                                            CameraPos;                                                  // 0x3358   (0x0018)  
	bool                                               EnableLag;                                                  // 0x3370   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x3371   (0x0007)  MISSED
	FRotator                                           CameraRot;                                                  // 0x3378   (0x0018)  
	AActor*                                            Actor;                                                      // 0x3390   (0x0008)  
	FVector                                            InitLagPos;                                                 // 0x3398   (0x0018)  
	FRotator                                           InitLagRot;                                                 // 0x33B0   (0x0018)  
	unsigned char                                      UnknownData02_5[0x8];                                       // 0x33C8   (0x0008)  MISSED
	FTransform                                         SmoothedPivotTarget;                                        // 0x33D0   (0x0060)  
	FRotator                                           TargetCameraRotation;                                       // 0x3430   (0x0018)  
	double                                             RotationLagAmount;                                          // 0x3448   (0x0008)  
	FVector                                            PivotLocation;                                              // 0x3450   (0x0018)  
	FVector                                            TargetCameraLocation;                                       // 0x3468   (0x0018)  
	FVector                                            PivotOffsetLocation;                                        // 0x3480   (0x0018)  
	ASurvivalPlayer_Test_C*                            PlayerTest;                                                 // 0x3498   (0x0008)  
	FVector                                            CameraOffsetLocation;                                       // 0x34A0   (0x0018)  
	FVector                                            PivotLagSpeed;                                              // 0x34B8   (0x0018)  


	/// Functions
	// Function /Game/Blueprints/SurvCameraManager.SurvCameraManager_C.CalculateAxisIndependentLag
	void CalculateAxisIndependentLag(FVector CurrentLocation, FVector TargetLocation, FRotator CameraRotation, FVector LagSpeeds, FVector& Return); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/SurvCameraManager.SurvCameraManager_C.CustomCameraBehavior
	void CustomCameraBehavior(FVector& Location, FRotator& Rotation, double& FOV);                                           // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/SurvCameraManager.SurvCameraManager_C.BlueprintUpdateCamera
	bool BlueprintUpdateCamera(AActor* CameraTarget, FVector& NewCameraLocation, FRotator& NewCameraRotation, float& NewCameraFOV); // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/SurvCameraManager.SurvCameraManager_C.Timeline_0__FinishedFunc
	void Timeline_0__FinishedFunc();                                                                                         // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/SurvCameraManager.SurvCameraManager_C.Timeline_0__UpdateFunc
	void Timeline_0__UpdateFunc();                                                                                           // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/SurvCameraManager.SurvCameraManager_C.InpActEvt_X_K2Node_InputKeyEvent
	void InpActEvt_X_K2Node_InputKeyEvent(FKey Key);                                                                         // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/SurvCameraManager.SurvCameraManager_C.EntryAsPassenger
	void EntryAsPassenger();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/SurvCameraManager.SurvCameraManager_C.ExecuteUbergraph_SurvCameraManager
	void ExecuteUbergraph_SurvCameraManager(int32_t EntryPoint);                                                             // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C
/// Size: 0x0040 (0x000290 - 0x0002D0)
class ABP_DefaultPIckableEnv_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	UBoxComponent*                                     Box;                                                        // 0x0298   (0x0008)  
	UStaticMeshComponent*                              Cube;                                                       // 0x02A0   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x02A8   (0x0008)  
	FName                                              ItemName;                                                   // 0x02B0   (0x0008)  
	int32_t                                            ItemCount;                                                  // 0x02B8   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x02BC   (0x0004)  MISSED
	UFMODEvent*                                        PickupSound;                                                // 0x02C0   (0x0008)  
	UParticleSystem*                                   PickupParticles;                                            // 0x02C8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.OverlapStart
	void OverlapStart(bool& Success);                                                                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.OverlapEnd
	void OverlapEnd(bool& Success);                                                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.IsLocked?
	void IsLocked?(bool& Result);                                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.GetActorType
	void GetActorType(TEnumAsByte<E_ActorType>& ActorType);                                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.OnFocused
	void OnFocused(APawn* Player, AActor* HighlightActor, UActorComponent* HighlightActorComponent, TEnumAsByte<E_InteractType>& InteractType, double& LateTime); // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.OnInteract
	void OnInteract(APawn* Player);                                                                                          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.OnInteract2
	void OnInteract2(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.OnInteract3
	void OnInteract3(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.OnLocalInteract
	void OnLocalInteract(APawn* Player);                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.OnInteractVehicle
	void OnInteractVehicle(APawn* Player, int32_t SitIndex, bool SkipAnimation);                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.OnSeen
	void OnSeen(APawn* Player);                                                                                              // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.OnBeginInteract
	void OnBeginInteract(APawn* Player);                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.OnStopInteract
	void OnStopInteract(APawn* Player);                                                                                      // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.OnLostFocus
	void OnLostFocus(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.Run Lockpicking
	void Run Lockpicking();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.OnSquadCheckComplete
	void OnSquadCheckComplete();                                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.Set3DWidgetVisibility
	void Set3DWidgetVisibility(bool Visible);                                                                                // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.SetTutorial3DWidgetVisibility
	void SetTutorial3DWidgetVisibility(bool Visible);                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.DestroyInteractable
	void DestroyInteractable();                                                                                              // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.ReceiveDestroyed
	void ReceiveDestroyed();                                                                                                 // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.ItemPickuped
	void ItemPickuped();                                                                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/PIckableEnvironment/Default/BP_DefaultPIckableEnv.BP_DefaultPIckableEnv_C.ExecuteUbergraph_BP_DefaultPIckableEnv
	void ExecuteUbergraph_BP_DefaultPIckableEnv(int32_t EntryPoint);                                                         // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/HouseSystem/SkylightModifier.SkylightModifier_C
/// Size: 0x0021 (0x000290 - 0x0002B1)
class ASkylightModifier_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	UBoxComponent*                                     Box;                                                        // 0x0298   (0x0008)  
	AUltra_Dynamic_Sky_C*                              UDSky;                                                      // 0x02A0   (0x0008)  
	double                                             SkyLightOffset;                                             // 0x02A8   (0x0008)  
	bool                                               Scattering;                                                 // 0x02B0   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/HouseSystem/SkylightModifier.SkylightModifier_C.BndEvt__SkylightModifier_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__SkylightModifier_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Blueprints/HouseSystem/SkylightModifier.SkylightModifier_C.BndEvt__SkylightModifier_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
	void BndEvt__SkylightModifier_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/HouseSystem/SkylightModifier.SkylightModifier_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/HouseSystem/SkylightModifier.SkylightModifier_C.ExecuteUbergraph_SkylightModifier
	void ExecuteUbergraph_SkylightModifier(int32_t EntryPoint);                                                              // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/DayTimeSystem/Old/DayTimeController.DayTimeController_C
/// Size: 0x0178 (0x000290 - 0x000408)
class ADayTimeController_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x0298   (0x0008)  
	double                                             TimeOfDay;                                                  // 0x02A0   (0x0008)  
	double                                             TimeOffset;                                                 // 0x02A8   (0x0008)  
	double                                             SecInHour;                                                  // 0x02B0   (0x0008)  
	AActor*                                            SunDiskRotator;                                             // 0x02B8   (0x0008)  
	ABP_Sky_SphereCustom_C*                            SkySphere;                                                  // 0x02C0   (0x0008)  
	ASkyLight*                                         SkyLight;                                                   // 0x02C8   (0x0008)  
	bool                                               IsNight;                                                    // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02D1   (0x0007)  MISSED
	AActor*                                            LightRotator;                                               // 0x02D8   (0x0008)  
	double                                             LightState;                                                 // 0x02E0   (0x0008)  
	AExponentialHeightFog*                             Fog;                                                        // 0x02E8   (0x0008)  
	ADirectionalLight*                                 ActualLight;                                                // 0x02F0   (0x0008)  
	APointLight*                                       CouldsPointLight;                                           // 0x02F8   (0x0008)  
	TArray<AStaticMeshActor*>                          Clouds_MI_HDRCloud;                                         // 0x0300   (0x0010)  
	TArray<AStaticMeshActor*>                          Clouds_MI_HDRCloud;                                         // 0x0310   (0x0010)  
	UCurveFloat*                                       BloomScaleCurve;                                            // 0x0320   (0x0008)  
	UCurveFloat*                                       OcclusionDepthCurve;                                        // 0x0328   (0x0008)  
	UCurveFloat*                                       SunLightIntensityCurve;                                     // 0x0330   (0x0008)  
	UCurveFloat*                                       LightIntensityCurve;                                        // 0x0338   (0x0008)  
	UCurveLinearColor*                                 LightColorCurve;                                            // 0x0340   (0x0008)  
	UCurveLinearColor*                                 BloomTintCurve;                                             // 0x0348   (0x0008)  
	UCurveLinearColor*                                 SunLightCurve;                                              // 0x0350   (0x0008)  
	UCurveFloat*                                       FogDensityCurve;                                            // 0x0358   (0x0008)  
	UCurveFloat*                                       FogStartDistanceCurve;                                      // 0x0360   (0x0008)  
	UCurveLinearColor*                                 FogColorCurve;                                              // 0x0368   (0x0008)  
	UCurveFloat*                                       SunBrightnessCurve;                                         // 0x0370   (0x0008)  
	FMulticastInlineDelegate                           NightBegin;                                                 // 0x0378   (0x0010)  
	FMulticastInlineDelegate                           DayBegin;                                                   // 0x0388   (0x0010)  
	UCurveLinearColor*                                 SkyScatterCurve;                                            // 0x0398   (0x0008)  
	UCurveLinearColor*                                 GroundScatterCurve;                                         // 0x03A0   (0x0008)  
	UCurveLinearColor*                                 CloundTint;                                                 // 0x03A8   (0x0008)  
	UCurveLinearColor*                                 CloundPointLightColorCurve;                                 // 0x03B0   (0x0008)  
	UMaterialInstanceDynamic*                          MI_HDR_Cloud;                                               // 0x03B8   (0x0008)  
	UMaterialInstanceDynamic*                          MI_HDR_Cloud;                                               // 0x03C0   (0x0008)  
	bool                                               MainPlayerInBunker;                                         // 0x03C8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x03C9   (0x0007)  MISSED
	double                                             SkyLightScale;                                              // 0x03D0   (0x0008)  
	FTimerHandle                                       EntranceTimer;                                              // 0x03D8   (0x0008)  
	double                                             SkyLightIntensity;                                          // 0x03E0   (0x0008)  
	FTimerHandle                                       ExitTimer;                                                  // 0x03E8   (0x0008)  
	double                                             CurrentForestAmb;                                           // 0x03F0   (0x0008)  
	double                                             CurrentBunkerAmb;                                           // 0x03F8   (0x0008)  
	double                                             LightIntensity;                                             // 0x0400   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/DayTimeSystem/Old/DayTimeController.DayTimeController_C.CalculateTime
	void CalculateTime(double Delta);                                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayTimeSystem/Old/DayTimeController.DayTimeController_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/DayTimeSystem/Old/DayTimeController.DayTimeController_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/DayTimeSystem/Old/DayTimeController.DayTimeController_C.UpdateSun
	void UpdateSun();                                                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayTimeSystem/Old/DayTimeController.DayTimeController_C.BunkerEntered
	void BunkerEntered(ASurvivalPlayer_C* Survival, FVector EnterPoint);                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayTimeSystem/Old/DayTimeController.DayTimeController_C.BunkerExit
	void BunkerExit(ASurvivalPlayer_C* Survival, FVector ExitPoint);                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayTimeSystem/Old/DayTimeController.DayTimeController_C.BunekerEntranceUpdate
	void BunekerEntranceUpdate();                                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayTimeSystem/Old/DayTimeController.DayTimeController_C.BunkerExitTick
	void BunkerExitTick();                                                                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayTimeSystem/Old/DayTimeController.DayTimeController_C.ClearTimers
	void ClearTimers();                                                                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayTimeSystem/Old/DayTimeController.DayTimeController_C.ExecuteUbergraph_DayTimeController
	void ExecuteUbergraph_DayTimeController(int32_t EntryPoint);                                                             // [0x2407bf0] Final|HasDefaults    
	// Function /Game/Blueprints/DayTimeSystem/Old/DayTimeController.DayTimeController_C.DayBegin__DelegateSignature
	void DayBegin__DelegateSignature();                                                                                      // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayTimeSystem/Old/DayTimeController.DayTimeController_C.NightBegin__DelegateSignature
	void NightBegin__DelegateSignature();                                                                                    // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C
/// Size: 0x00A8 (0x000290 - 0x000338)
class ABP_DeathCamera_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	UCameraComponent*                                  Camera;                                                     // 0x0298   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x02A0   (0x0008)  
	float                                              LerpCameraRotation__by_survivor__Alpha_EC57B88F448D2717B6F0D39B3740E325; // 0x02A8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    LerpCameraRotation__by_survivor___Direction_EC57B88F448D2717B6F0D39B3740E325; // 0x02AC   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02AD   (0x0003)  MISSED
	UTimelineComponent*                                LerpCameraRotation__by_survivor_;                           // 0x02B0   (0x0008)  
	float                                              Timeline_0_Length_29FA8DA3415AB27CC6538D8516D74477;         // 0x02B8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_0__Direction_29FA8DA3415AB27CC6538D8516D74477;     // 0x02BC   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x02BD   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x02C0   (0x0008)  
	float                                              LerpCameraRotation_NewTrack_0_1946A67A4DE8DE3FC6713AA50FE07F78; // 0x02C8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    LerpCameraRotation__Direction_1946A67A4DE8DE3FC6713AA50FE07F78; // 0x02CC   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x02CD   (0x0003)  MISSED
	UTimelineComponent*                                LerpCameraRotation;                                         // 0x02D0   (0x0008)  
	float                                              FocusCameraDeadthSurv_NewTrack_0_7A25834A44495F7BC0E766944AB62F99; // 0x02D8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    FocusCameraDeadthSurv__Direction_7A25834A44495F7BC0E766944AB62F99; // 0x02DC   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x02DD   (0x0003)  MISSED
	UTimelineComponent*                                FocusCameraDeadthSurv;                                      // 0x02E0   (0x0008)  
	AActor*                                            DeadBody;                                                   // 0x02E8   (0x0008)  
	APawn*                                             Killer;                                                     // 0x02F0   (0x0008)  
	double                                             OffsetZ;                                                    // 0x02F8   (0x0008)  
	FVector                                            DirectionCamera;                                            // 0x0300   (0x0018)  
	double                                             DelayPlayShake;                                             // 0x0318   (0x0008)  
	FName                                              FocusSoketName;                                             // 0x0320   (0x0008)  
	APlayerDeadBodyV2_C*                               CastedDeadBody;                                             // 0x0328   (0x0008)  
	ASurvivalPlayer_C*                                 As_SurvivalPlayer;                                          // 0x0330   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C.CheckKiller
	void CheckKiller(bool& Result);                                                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C.FocusCameraDeadthSurv__FinishedFunc
	void FocusCameraDeadthSurv__FinishedFunc();                                                                              // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C.FocusCameraDeadthSurv__UpdateFunc
	void FocusCameraDeadthSurv__UpdateFunc();                                                                                // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C.LerpCameraRotation__FinishedFunc
	void LerpCameraRotation__FinishedFunc();                                                                                 // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C.LerpCameraRotation__UpdateFunc
	void LerpCameraRotation__UpdateFunc();                                                                                   // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C.Timeline_0__FinishedFunc
	void Timeline_0__FinishedFunc();                                                                                         // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C.Timeline_0__UpdateFunc
	void Timeline_0__UpdateFunc();                                                                                           // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C.LerpCameraRotation (by survivor)__FinishedFunc
	void LerpCameraRotation (by survivor)__FinishedFunc();                                                                   // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C.LerpCameraRotation (by survivor)__UpdateFunc
	void LerpCameraRotation (by survivor)__UpdateFunc();                                                                     // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C.SetNewCameraInPP
	void SetNewCameraInPP();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C.ReceiveDestroyed
	void ReceiveDestroyed();                                                                                                 // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/CameraStuff/BP_DeathCamera.BP_DeathCamera_C.ExecuteUbergraph_BP_DeathCamera
	void ExecuteUbergraph_BP_DeathCamera(int32_t EntryPoint);                                                                // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/BP_QuestAreaIcon.BP_QuestAreaIcon_C
/// Size: 0x0028 (0x000290 - 0x0002B8)
class ABP_QuestAreaIcon_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x0298   (0x0008)  
	UTexture2D*                                        Icon;                                                       // 0x02A0   (0x0008)  
	FVector2D                                          IconSize;                                                   // 0x02A8   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/BP_QuestAreaIcon.BP_QuestAreaIcon_C.GetMapIconData
	void GetMapIconData(FVector& Location, UTexture2D*& Icon, FVector2D& IconSize, double& RotationYaw, AActor*& WorldActor, FText& Name, FText& Description); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_QuestAreaIcon.BP_QuestAreaIcon_C.UpdateIconPosition
	void UpdateIconPosition(FVector2D Position);                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_QuestAreaIcon.BP_QuestAreaIcon_C.Zoom
	void Zoom(bool In/Out);                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_QuestAreaIcon.BP_QuestAreaIcon_C.ExecuteUbergraph_BP_QuestAreaIcon
	void ExecuteUbergraph_BP_QuestAreaIcon(int32_t EntryPoint);                                                              // [0x2407bf0] Final                
};

/// Class /Game/Blueprints/CameraStuff/ATPCCameraFOVObjectTutorial.ATPCCameraFOVObjectTutorial_C
/// Size: 0x0009 (0x000060 - 0x000069)
class UATPCCameraFOVObjectTutorial_C : public USurvCameraFOVObject : USurvCameraFOVObject
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0060   (0x0008)  
	bool                                               InCinematicMode;                                            // 0x0068   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/CameraStuff/ATPCCameraFOVObjectTutorial.ATPCCameraFOVObjectTutorial_C.K2_Tick
	void K2_Tick(float DeltaSeconds);                                                                                        // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/CameraStuff/ATPCCameraFOVObjectTutorial.ATPCCameraFOVObjectTutorial_C.K2_Validate
	void K2_Validate(bool bWithInterpolation);                                                                               // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/CameraStuff/ATPCCameraFOVObjectTutorial.ATPCCameraFOVObjectTutorial_C.ExecuteUbergraph_ATPCCameraFOVObjectTutorial
	void ExecuteUbergraph_ATPCCameraFOVObjectTutorial(int32_t EntryPoint);                                                   // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/SquadSystem/ActorRecording.ActorRecording_C
/// Size: 0x01D0 (0x000290 - 0x000460)
class AActorRecording_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	UPostProcessComponent*                             PostProcess;                                                // 0x0298   (0x0008)  
	UStaticMeshComponent*                              Char3_Lighting;                                             // 0x02A0   (0x0008)  
	URectLightComponent*                               CharLightL16;                                               // 0x02A8   (0x0008)  
	URectLightComponent*                               CharLightL20;                                               // 0x02B0   (0x0008)  
	URectLightComponent*                               CharLightL19;                                               // 0x02B8   (0x0008)  
	URectLightComponent*                               CharLightL18;                                               // 0x02C0   (0x0008)  
	URectLightComponent*                               CharLightL17;                                               // 0x02C8   (0x0008)  
	UStaticMeshComponent*                              Char2_Lighting;                                             // 0x02D0   (0x0008)  
	URectLightComponent*                               CharLightL11;                                               // 0x02D8   (0x0008)  
	URectLightComponent*                               CharLightL15;                                               // 0x02E0   (0x0008)  
	URectLightComponent*                               CharLightL14;                                               // 0x02E8   (0x0008)  
	URectLightComponent*                               CharLightL13;                                               // 0x02F0   (0x0008)  
	URectLightComponent*                               CharLightL12;                                               // 0x02F8   (0x0008)  
	UStaticMeshComponent*                              Char1_Lighting;                                             // 0x0300   (0x0008)  
	URectLightComponent*                               CharLightL6;                                                // 0x0308   (0x0008)  
	URectLightComponent*                               CharLightL10;                                               // 0x0310   (0x0008)  
	URectLightComponent*                               CharLightL9;                                                // 0x0318   (0x0008)  
	URectLightComponent*                               CharLightL8;                                                // 0x0320   (0x0008)  
	URectLightComponent*                               CharLightL7;                                                // 0x0328   (0x0008)  
	UStaticMeshComponent*                              Main_Lighting;                                              // 0x0330   (0x0008)  
	URectLightComponent*                               CharLightL4;                                                // 0x0338   (0x0008)  
	URectLightComponent*                               CharLightL3;                                                // 0x0340   (0x0008)  
	URectLightComponent*                               CharLightL2;                                                // 0x0348   (0x0008)  
	URectLightComponent*                               CharLightL5;                                                // 0x0350   (0x0008)  
	URectLightComponent*                               CharLightL1;                                                // 0x0358   (0x0008)  
	USceneCaptureComponent2D*                          SceneCaptureComponent2D3;                                   // 0x0360   (0x0008)  
	USceneCaptureComponent2D*                          SceneCaptureComponent2D2;                                   // 0x0368   (0x0008)  
	USceneCaptureComponent2D*                          SceneCaptureComponent2D1;                                   // 0x0370   (0x0008)  
	USceneComponent*                                   Scene1;                                                     // 0x0378   (0x0008)  
	USceneComponent*                                   Scene2;                                                     // 0x0380   (0x0008)  
	USceneComponent*                                   Scene3;                                                     // 0x0388   (0x0008)  
	USceneCaptureComponent2D*                          SceneCaptureComponent2D;                                    // 0x0390   (0x0008)  
	UChildActorComponent*                              PartyChar3;                                                 // 0x0398   (0x0008)  
	UChildActorComponent*                              PartyChar2;                                                 // 0x03A0   (0x0008)  
	UChildActorComponent*                              PartyChar1;                                                 // 0x03A8   (0x0008)  
	USceneCaptureComponent2D*                          SceneCaptureComponent2DMain;                                // 0x03B0   (0x0008)  
	UChildActorComponent*                              BP_ChooseCharacter;                                         // 0x03B8   (0x0008)  
	USceneComponent*                                   Scene;                                                      // 0x03C0   (0x0008)  
	bool                                               CanRotate_;                                                 // 0x03C8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x03C9   (0x0007)  MISSED
	FVector2D                                          StartLocation;                                              // 0x03D0   (0x0010)  
	TArray<UMaterialInstanceDynamic*>                  PlayerIconMaterialArray;                                    // 0x03E0   (0x0010)  
	TArray<APawn*>                                     PlayersIn;                                                  // 0x03F0   (0x0010)  
	TArray<UCharacterCreateSave_C*>                    Saves;                                                      // 0x0400   (0x0010)  
	TMap<APawn*, UMaterialInstance*>                   PlayersMaterials;                                           // 0x0410   (0x0050)  


	/// Functions
	// Function /Game/Blueprints/SquadSystem/ActorRecording.ActorRecording_C.Init
	void Init();                                                                                                             // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/SquadSystem/ActorRecording.ActorRecording_C.ClickedEnd
	void ClickedEnd();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/SquadSystem/ActorRecording.ActorRecording_C.MakeSaveFromSurvivalPlayer
	void MakeSaveFromSurvivalPlayer(ASurvivalPlayer_V2_C* SurvivalPlayer, int32_t Index);                                    // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/SquadSystem/ActorRecording.ActorRecording_C.ClickedStart
	void ClickedStart(FVector2D MouseLocation);                                                                              // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/SquadSystem/ActorRecording.ActorRecording_C.MouseMove
	void MouseMove(FVector2D MouseLocation);                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/SquadSystem/ActorRecording.ActorRecording_C.CreateNewRenderTarget
	void CreateNewRenderTarget(int32_t SlotID);                                                                              // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/SquadSystem/ActorRecording.ActorRecording_C.RefreshMesh
	void RefreshMesh(UChildActorComponent* Target, bool LocalCharacter, UCharacterCreateSave_C* Character Save Ref);         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/SquadSystem/ActorRecording.ActorRecording_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/SquadSystem/ActorRecording.ActorRecording_C.ExecuteUbergraph_ActorRecording
	void ExecuteUbergraph_ActorRecording(int32_t EntryPoint);                                                                // [0x2407bf0] Final                
};

/// Class /Game/Blueprints/BP_WalkingArea.BP_WalkingArea_C
/// Size: 0x0018 (0x000290 - 0x0002A8)
class ABP_WalkingArea_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	UBoxComponent*                                     Box;                                                        // 0x0298   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x02A0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/BP_WalkingArea.BP_WalkingArea_C.BndEvt__BP_WalkingArea_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__BP_WalkingArea_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Blueprints/BP_WalkingArea.BP_WalkingArea_C.BndEvt__BP_WalkingArea_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
	void BndEvt__BP_WalkingArea_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/BP_WalkingArea.BP_WalkingArea_C.ExecuteUbergraph_BP_WalkingArea
	void ExecuteUbergraph_BP_WalkingArea(int32_t EntryPoint);                                                                // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/CameraStuff/ATPCCameraLocationObjectV2.ATPCCameraLocationObjectV2_C
/// Size: 0x0059 (0x0004C0 - 0x000519)
class UATPCCameraLocationObjectV2_C : public USurvCameraLocationObject : USurvCameraLocationObject
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04C0   (0x0008)  
	ASurvivalPlayer_C*                                 As_Survival_Player;                                         // 0x04C8   (0x0008)  
	FVector                                            LeftTilt;                                                   // 0x04D0   (0x0018)  
	FVector                                            DefaultLeftTilt;                                            // 0x04E8   (0x0018)  
	FVector                                            RightTilt;                                                  // 0x0500   (0x0018)  
	bool                                               isLeftTilt;                                                 // 0x0518   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/CameraStuff/ATPCCameraLocationObjectV2.ATPCCameraLocationObjectV2_C.K2_OnEnterCameraMode
	void K2_OnEnterCameraMode(bool bWithInterpolation);                                                                      // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/CameraStuff/ATPCCameraLocationObjectV2.ATPCCameraLocationObjectV2_C.K2_Tick
	void K2_Tick(float DeltaSeconds);                                                                                        // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/CameraStuff/ATPCCameraLocationObjectV2.ATPCCameraLocationObjectV2_C.ExecuteUbergraph_ATPCCameraLocationObjectV2
	void ExecuteUbergraph_ATPCCameraLocationObjectV2(int32_t EntryPoint);                                                    // [0x2407bf0] Final                
};

/// Class /Game/Blueprints/CameraStuff/ATPCCameraFOVObjectV2.ATPCCameraFOVObjectV2_C
/// Size: 0x0010 (0x000060 - 0x000070)
class UATPCCameraFOVObjectV2_C : public USurvCameraFOVObject : USurvCameraFOVObject
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0060   (0x0008)  
	ASurvivalPlayer_C*                                 As_Survival_Player;                                         // 0x0068   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/CameraStuff/ATPCCameraFOVObjectV2.ATPCCameraFOVObjectV2_C.K2_Tick
	void K2_Tick(float DeltaSeconds);                                                                                        // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/CameraStuff/ATPCCameraFOVObjectV2.ATPCCameraFOVObjectV2_C.K2_Validate
	void K2_Validate(bool bWithInterpolation);                                                                               // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/CameraStuff/ATPCCameraFOVObjectV2.ATPCCameraFOVObjectV2_C.ExecuteUbergraph_ATPCCameraFOVObjectV2
	void ExecuteUbergraph_ATPCCameraFOVObjectV2(int32_t EntryPoint);                                                         // [0x2407bf0] Final                
};

/// Class /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C
/// Size: 0x0020 (0x0000A0 - 0x0000C0)
class UBPC_AdminPanel_C : public UActorComponent : UActorComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A0   (0x0008)  
	UBPC_SharpSync_C*                                  SharpSync;                                                  // 0x00A8   (0x0008)  
	UWBP_AdminPanel_C*                                 AdminPanel;                                                 // 0x00B0   (0x0008)  
	ASurvivalPlayer_V2_C*                              As_Survival_Player_V2;                                      // 0x00B8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.TimespanToString
	FString TimespanToString(FTimespan InTimespan);                                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.DateTimeToString
	FString DateTimeToString(FDateTime InDateTime);                                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.StringToTime
	FTimespan StringToTime(FString SourceString, bool& IsTimeAllowed);                                                       // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.KickPlayer
	void KickPlayer(APlayerController* TargetPlayer, FText& KickReason);                                                     // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.KickPlayerServer
	void KickPlayerServer(APlayerState* TargetPlayer, FText& KickReason);                                                    // [0x2407bf0] Net|NetServer|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.CharDataUpdate
	void CharDataUpdate(TArray<FString>& Info, FString SteamID);                                                             // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.BanPlayerServer
	void BanPlayerServer(APlayerState* TargetPlayer, FText& KickReason, FString Time, bool Mute, bool Amnesty);              // [0x2407bf0] Net|NetReliableNetServer|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.AdminPanelMessage
	void AdminPanelMessage(FText InText);                                                                                    // [0x2407bf0] Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.BanPlayerById
	void BanPlayerById(FString SteamID, FString Time, FText Reason, bool Mute, bool Amnesty);                                // [0x2407bf0] Net|NetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.SetAdmin
	void SetAdmin(FString SteamID, bool NewAdmin);                                                                           // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.AdminMessageToChat
	void AdminMessageToChat(FText InputPin);                                                                                 // [0x2407bf0] Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.WarningToPlayer
	void WarningToPlayer(UObject* Object, FText WarningMessage);                                                             // [0x2407bf0] Net|NetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.WidgetAdminPanel
	void WidgetAdminPanel();                                                                                                 // [0x2407bf0] Net|NetClient|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BPC_AdminPanel.BPC_AdminPanel_C.ExecuteUbergraph_BPC_AdminPanel
	void ExecuteUbergraph_BPC_AdminPanel(int32_t EntryPoint);                                                                // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Throwable/BP_Throwable.BP_Throwable_C
/// Size: 0x0038 (0x000290 - 0x0002C8)
class ABP_Throwable_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	UStaticMeshComponent*                              Cube;                                                       // 0x0298   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x02A0   (0x0008)  
	bool                                               IsHitted;                                                   // 0x02A8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02A9   (0x0007)  MISSED
	double                                             ImpulseValue;                                               // 0x02B0   (0x0008)  
	double                                             TorqueValue;                                                // 0x02B8   (0x0008)  
	AActor*                                            OwnerPlayer;                                                // 0x02C0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Throwable/BP_Throwable.BP_Throwable_C.Impulse
	void Impulse(FRotator Rotation);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/BP_Throwable.BP_Throwable_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/BP_Throwable.BP_Throwable_C.OnHit
	void OnHit(AActor* HitActor, UPrimitiveComponent* HitComponent, FHitResult hit);                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/BP_Throwable.BP_Throwable_C.ReceiveHit
	void ReceiveHit(UPrimitiveComponent* MyComp, AActor* Other, UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector hitNormal, FVector NormalImpulse, FHitResult& hit); // [0x2407bf0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/BP_Throwable.BP_Throwable_C.HitAction
	void HitAction(FVector HitLocation);                                                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/BP_Throwable.BP_Throwable_C.OnImpulseMulti
	void OnImpulseMulti(FRotator Rotation);                                                                                  // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/BP_Throwable.BP_Throwable_C.ExecuteUbergraph_BP_Throwable
	void ExecuteUbergraph_BP_Throwable(int32_t EntryPoint);                                                                  // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Throwable/Molotov/BP_Molotov.BP_Molotov_C
/// Size: 0x0010 (0x0002C8 - 0x0002D8)
class ABP_Molotov_C : public ABP_Throwable_C : ABP_Throwable_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C8   (0x0008)  
	UParticleSystemComponent*                          P_MolotovFireFlight;                                        // 0x02D0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Throwable/Molotov/BP_Molotov.BP_Molotov_C.HitAction
	void HitAction(FVector HitLocation);                                                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/Molotov/BP_Molotov.BP_Molotov_C.ExecuteUbergraph_BP_Molotov
	void ExecuteUbergraph_BP_Molotov(int32_t EntryPoint);                                                                    // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/Throwable/HandmadeBomb/BP_HandmadeBomb.BP_HandmadeBomb_C
/// Size: 0x0008 (0x0002C8 - 0x0002D0)
class ABP_HandmadeBomb_C : public ABP_Throwable_C : ABP_Throwable_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Throwable/HandmadeBomb/BP_HandmadeBomb.BP_HandmadeBomb_C.HitAction
	void HitAction(FVector HitLocation);                                                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Throwable/HandmadeBomb/BP_HandmadeBomb.BP_HandmadeBomb_C.ExecuteUbergraph_BP_HandmadeBomb
	void ExecuteUbergraph_BP_HandmadeBomb(int32_t EntryPoint);                                                               // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/LootGeneration/LootpointOverlap.LootpointOverlap_C
/// Size: 0x0010 (0x000290 - 0x0002A0)
class ALootpointOverlap_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	USphereComponent*                                  OverlapSphere;                                              // 0x0298   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/LootGeneration/LootpointOverlap.LootpointOverlap_C.BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Blueprints/LootGeneration/LootpointOverlap.LootpointOverlap_C.BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
	void BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/LootGeneration/LootpointOverlap.LootpointOverlap_C.ExecuteUbergraph_LootpointOverlap
	void ExecuteUbergraph_LootpointOverlap(int32_t EntryPoint);                                                              // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagBase.BP_SleepingBagBase_C
/// Size: 0x0018 (0x000290 - 0x0002A8)
class ABP_SleepingBagBase_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	USkeletalMeshComponent*                            Sleeping_Bag;                                               // 0x0298   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x02A0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagBase.BP_SleepingBagBase_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagBase.BP_SleepingBagBase_C.ExecuteUbergraph_BP_SleepingBagBase
	void ExecuteUbergraph_BP_SleepingBagBase(int32_t EntryPoint);                                                            // [0x2407bf0] Final                
};

/// Class /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C
/// Size: 0x0068 (0x0002A8 - 0x000310)
class ABP_SleepingBagStub_C : public ABP_SleepingBagBase_C : ABP_SleepingBagBase_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02A8   (0x0008)  
	UBoxComponent*                                     InteractBox;                                                // 0x02B0   (0x0008)  
	UBoxComponent*                                     Box;                                                        // 0x02B8   (0x0008)  
	TArray<UMaterialInstanceDynamic*>                  BuildingMat;                                                // 0x02C0   (0x0010)  
	AActor*                                            LocalPlayer;                                                // 0x02D0   (0x0008)  
	double                                             InteractDuration;                                           // 0x02D8   (0x0008)  
	bool                                               IsPlacing;                                                  // 0x02E0   (0x0001)  
	bool                                               IsStopping;                                                 // 0x02E1   (0x0001)  
	bool                                               CanPlace;                                                   // 0x02E2   (0x0001)  
	unsigned char                                      UnknownData00_5[0x5];                                       // 0x02E3   (0x0005)  MISSED
	TArray<UClass*>                                    ExcludedClasses;                                            // 0x02E8   (0x0010)  
	bool                                               CanBePlaced;                                                // 0x02F8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02F9   (0x0007)  MISSED
	TArray<UClass*>                                    RequiredClasses;                                            // 0x0300   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.IsLocked?
	void IsLocked?(bool& Result);                                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.GetActorType
	void GetActorType(TEnumAsByte<E_ActorType>& ActorType);                                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.OnFocused
	void OnFocused(APawn* Player, AActor* HighlightActor, UActorComponent* HighlightActorComponent, TEnumAsByte<E_InteractType>& InteractType, double& LateTime); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.AddExcludedClasses
	void AddExcludedClasses(TArray<UClass*>& Classes);                                                                       // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.CanPlaced
	void CanPlaced(bool& res);                                                                                               // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.OnInteract
	void OnInteract(APawn* Player);                                                                                          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.OnInteract2
	void OnInteract2(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.OnInteract3
	void OnInteract3(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.OnInteractVehicle
	void OnInteractVehicle(APawn* Player, int32_t SitIndex, bool SkipAnimation);                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.OnSeen
	void OnSeen(APawn* Player);                                                                                              // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.OnLostFocus
	void OnLostFocus(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.Run Lockpicking
	void Run Lockpicking();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.OnSquadCheckComplete
	void OnSquadCheckComplete();                                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.Set3DWidgetVisibility
	void Set3DWidgetVisibility(bool Visible);                                                                                // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.SetTutorial3DWidgetVisibility
	void SetTutorial3DWidgetVisibility(bool Visible);                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.DestroyInteractable
	void DestroyInteractable();                                                                                              // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.Place
	void Place();                                                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.OnLocalInteract
	void OnLocalInteract(APawn* Player);                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.OnBeginInteract
	void OnBeginInteract(APawn* Player);                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.OnStopInteract
	void OnStopInteract(APawn* Player);                                                                                      // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBagStub.BP_SleepingBagStub_C.ExecuteUbergraph_BP_SleepingBagStub
	void ExecuteUbergraph_BP_SleepingBagStub(int32_t EntryPoint);                                                            // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C
/// Size: 0x0070 (0x0002A8 - 0x000318)
class ABP_SleepingBag_C : public ABP_SleepingBagBase_C : ABP_SleepingBagBase_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02A8   (0x0008)  
	UBP_TrailComponent_C*                              BP_TrailComponent2;                                         // 0x02B0   (0x0008)  
	UBP_TrailComponent_C*                              BP_TrailComponent1;                                         // 0x02B8   (0x0008)  
	UBP_TrailComponent_C*                              BP_TrailComponent;                                          // 0x02C0   (0x0008)  
	UChildActorComponent*                              ArrowActor;                                                 // 0x02C8   (0x0008)  
	UStaticMeshComponent*                              Cube;                                                       // 0x02D0   (0x0008)  
	USceneComponent*                                   CollectPoint;                                               // 0x02D8   (0x0008)  
	UStaticMeshComponent*                              sleeping_bag_inflate;                                       // 0x02E0   (0x0008)  
	USceneComponent*                                   ExitPoint;                                                  // 0x02E8   (0x0008)  
	USceneComponent*                                   SleepPosition;                                              // 0x02F0   (0x0008)  
	UBoxComponent*                                     Box;                                                        // 0x02F8   (0x0008)  
	bool                                               Open;                                                       // 0x0300   (0x0001)  
	bool                                               Close;                                                      // 0x0301   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0302   (0x0006)  MISSED
	APawn*                                             User;                                                       // 0x0308   (0x0008)  
	AActor*                                            OwnerUser;                                                  // 0x0310   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.IsLocked?
	void IsLocked?(bool& Result);                                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.GetActorType
	void GetActorType(TEnumAsByte<E_ActorType>& ActorType);                                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.OnFocused
	void OnFocused(APawn* Player, AActor* HighlightActor, UActorComponent* HighlightActorComponent, TEnumAsByte<E_InteractType>& InteractType, double& LateTime); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.OnInteract2
	void OnInteract2(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.OnInteract3
	void OnInteract3(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.OnLocalInteract
	void OnLocalInteract(APawn* Player);                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.OnInteractVehicle
	void OnInteractVehicle(APawn* Player, int32_t SitIndex, bool SkipAnimation);                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.OnSeen
	void OnSeen(APawn* Player);                                                                                              // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.OnBeginInteract
	void OnBeginInteract(APawn* Player);                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.OnStopInteract
	void OnStopInteract(APawn* Player);                                                                                      // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.OnLostFocus
	void OnLostFocus(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.Run Lockpicking
	void Run Lockpicking();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.OnSquadCheckComplete
	void OnSquadCheckComplete();                                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.Set3DWidgetVisibility
	void Set3DWidgetVisibility(bool Visible);                                                                                // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.SetTutorial3DWidgetVisibility
	void SetTutorial3DWidgetVisibility(bool Visible);                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.DestroyInteractable
	void DestroyInteractable();                                                                                              // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.OnInteract
	void OnInteract(APawn* Player);                                                                                          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.ReleaseUser
	void ReleaseUser();                                                                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.TeleportToOwner
	void TeleportToOwner();                                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/Bag/BP_SleepingBag.BP_SleepingBag_C.ExecuteUbergraph_BP_SleepingBag
	void ExecuteUbergraph_BP_SleepingBag(int32_t EntryPoint);                                                                // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C
/// Size: 0x0138 (0x000290 - 0x0003C8)
class ABP_Sauna_Entering_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	UBoxComponent*                                     ExitInteractBox;                                            // 0x0298   (0x0008)  
	UStaticMeshComponent*                              SM_Metal_Door_01a;                                          // 0x02A0   (0x0008)  
	UCapsuleComponent*                                 Capsule;                                                    // 0x02A8   (0x0008)  
	USceneComponent*                                   PointToInteract;                                            // 0x02B0   (0x0008)  
	UBoxComponent*                                     TipBox;                                                     // 0x02B8   (0x0008)  
	USceneComponent*                                   ExitAnimationRoot;                                          // 0x02C0   (0x0008)  
	UStaticMeshComponent*                              StaticMesh;                                                 // 0x02C8   (0x0008)  
	USceneComponent*                                   Scene;                                                      // 0x02D0   (0x0008)  
	float                                              Door_NewTrack_0_1FF7D2764CB8059E3238AB86490AB6E2;           // 0x02D8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Door__Direction_1FF7D2764CB8059E3238AB86490AB6E2;           // 0x02DC   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02DD   (0x0003)  MISSED
	UTimelineComponent*                                Door;                                                       // 0x02E0   (0x0008)  
	bool                                               Has_Reset;                                                  // 0x02E8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02E9   (0x0007)  MISSED
	FTimerHandle                                       Timer_by_reset;                                             // 0x02F0   (0x0008)  
	ASurvPC_C*                                         Current_PC;                                                 // 0x02F8   (0x0008)  
	TArray<ABP_PlayerSpawnPoint_C*>                    Regions;                                                    // 0x0300   (0x0010)  
	double                                             angle;                                                      // 0x0310   (0x0008)  
	bool                                               StartTeleport;                                              // 0x0318   (0x0001)  
	bool                                               PrevLineTraceResult;                                        // 0x0319   (0x0001)  
	bool                                               InteractingAnimation;                                       // 0x031A   (0x0001)  
	unsigned char                                      UnknownData02_5[0x5];                                       // 0x031B   (0x0005)  MISSED
	UPlayerCutsceneComponent_C*                        CutscenePlayer;                                             // 0x0320   (0x0008)  
	TArray<AActor*>                                    SaunaSpots;                                                 // 0x0328   (0x0010)  
	FTimerHandle                                       SaunaUpdateTimer;                                           // 0x0338   (0x0008)  
	bool                                               PlayerInSauna;                                              // 0x0340   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x0341   (0x0007)  MISSED
	AActor*                                            PickedSaunaSpot;                                            // 0x0348   (0x0008)  
	ABP_Sauna_Exit_C*                                  BPSaunaExit;                                                // 0x0350   (0x0008)  
	ABP_Interier_Toggler_C*                            Toggler;                                                    // 0x0358   (0x0008)  
	TArray<AActor*>                                    SaunaSpotsRemoved;                                          // 0x0360   (0x0010)  
	AActor*                                            spotRef;                                                    // 0x0370   (0x0008)  
	TMap<AActor*, AActor*>                             SpotSurvRef;                                                // 0x0378   (0x0050)  


	/// Functions
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.OnFocused
	void OnFocused(APawn* Player, AActor* HighlightActor, UActorComponent* HighlightActorComponent, TEnumAsByte<E_InteractType>& InteractType, double& LateTime); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.GetActorType
	void GetActorType(TEnumAsByte<E_ActorType>& ActorType);                                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.IsLocked?
	void IsLocked?(bool& Result);                                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.MeshRemove
	void MeshRemove(AActor* spotRef);                                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.BackSaunaSpot
	void BackSaunaSpot(AActor* Ref);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.PickSaunaSpot
	void PickSaunaSpot(AActor*& SaunaSpot);                                                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.IsSomethingOnA Way
	bool IsSomethingOnA Way();                                                                                               // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.IsInViewport
	bool IsInViewport();                                                                                                     // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.On Black Screen Opened
	void On Black Screen Opened();                                                                                           // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.Door__FinishedFunc
	void Door__FinishedFunc();                                                                                               // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.Door__UpdateFunc
	void Door__UpdateFunc();                                                                                                 // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.Set3DWidgetVisibility
	void Set3DWidgetVisibility(bool Visible);                                                                                // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.OnSquadCheckComplete
	void OnSquadCheckComplete();                                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.DestroyInteractable
	void DestroyInteractable();                                                                                              // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.Run Lockpicking
	void Run Lockpicking();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.OnSeen
	void OnSeen(APawn* Player);                                                                                              // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.OnInteractVehicle
	void OnInteractVehicle(APawn* Player, int32_t SitIndex, bool SkipAnimation);                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.DetectExit
	void DetectExit();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.OnInteract3
	void OnInteract3(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.OnInteract2
	void OnInteract2(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__BP_DoorTeleport_TipBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.OnInteract
	void OnInteract(APawn* Player);                                                                                          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.Reset Timer
	void Reset Timer();                                                                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.Reset
	void Reset();                                                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.OnLostFocus
	void OnLostFocus(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.FocusOver
	void FocusOver(UUIW_PlayerMain_C* FocusOver);                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.OnLocalInteract
	void OnLocalInteract(APawn* Player);                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.servSpot
	void servSpot(AActor* Ref, ASurvivalPlayer_C* Surv);                                                                     // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.multiSpot
	void multiSpot(AActor* Ref, ASurvivalPlayer_C* Surv);                                                                    // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.PlayEndCutscene
	void PlayEndCutscene();                                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.SetTutorial3DWidgetVisibility
	void SetTutorial3DWidgetVisibility(bool Visible);                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.OnStopInteract
	void OnStopInteract(APawn* Player);                                                                                      // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.OnBeginInteract
	void OnBeginInteract(APawn* Player);                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/BP_Sauna_Entering.BP_Sauna_Entering_C.ExecuteUbergraph_BP_Sauna_Entering
	void ExecuteUbergraph_BP_Sauna_Entering(int32_t EntryPoint);                                                             // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/InventoryWorker/SG_PlayerInventory.SG_PlayerInventory_C
/// Size: 0x0010 (0x000028 - 0x000038)
class USG_PlayerInventory_C : public USaveGame : USaveGame
{ 
public:
	TArray<FString>                                    Data;                                                       // 0x0028   (0x0010)  
};

/// Class /Game/Blueprints/DayTimeSystem/Old/TrueSky/BP_TrueSkyController.BP_TrueSkyController_C
/// Size: 0x00C0 (0x000290 - 0x000350)
class ABP_TrueSkyController_C : public AActor : AActor
{ 
public:
	UAtmosphericFogComponent*                          AtmosphericFog;                                             // 0x0290   (0x0008)  
	UExponentialHeightFogComponent*                    ExponentialHeightFog_Player;                                // 0x0298   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x02A0   (0x0008)  
	ASkyLight*                                         SkyLight;                                                   // 0x02A8   (0x0008)  
	UObject*                                           TS_Actor;                                                   // 0x02B0   (0x0008)  
	double                                             SecondsInDay;                                               // 0x02B8   (0x0008)  
	double                                             TimeOfDay;                                                  // 0x02C0   (0x0008)  
	UCurveFloat*                                       SkyLightIntensityCurve;                                     // 0x02C8   (0x0008)  
	UCurveLinearColor*                                 SkyLightColorCurve;                                         // 0x02D0   (0x0008)  
	UCurveLinearColor*                                 PlayerFogInscatteringColorCurve;                            // 0x02D8   (0x0008)  
	UCurveFloat*                                       FogDensityCurve;                                            // 0x02E0   (0x0008)  
	UCurveFloat*                                       FogStartDistanceCurve;                                      // 0x02E8   (0x0008)  
	UCurveFloat*                                       FogSunMultiplierCurve;                                      // 0x02F0   (0x0008)  
	UCurveLinearColor*                                 PlayerFogInscatteringColorCurve_Blizzard;                   // 0x02F8   (0x0008)  
	UCurveFloat*                                       FogDensityCurve_Blizzard;                                   // 0x0300   (0x0008)  
	UCurveFloat*                                       FogStartDistanceCurve_Blizzard;                             // 0x0308   (0x0008)  
	bool                                               IsBlizzard;                                                 // 0x0310   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0311   (0x0007)  MISSED
	double                                             UpdateHeightFogInterpSpeed;                                 // 0x0318   (0x0008)  
	double                                             CloudLerpValue;                                             // 0x0320   (0x0008)  
	bool                                               BlizzardSetted;                                             // 0x0328   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0329   (0x0007)  MISSED
	double                                             WindPowerLerpValue;                                         // 0x0330   (0x0008)  
	bool                                               IsNight;                                                    // 0x0338   (0x0001)  
	bool                                               HasCustomIllumination;                                      // 0x0339   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x033A   (0x0002)  MISSED
	FIllumination                                      Illumination;                                               // 0x033C   (0x0008)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x0344   (0x0004)  MISSED
	double                                             IlluminationAlpha;                                          // 0x0348   (0x0008)  
};

/// Class /Game/Blueprints/UniversalMarkerSystem/WBP_ShopVendorInfo.WBP_ShopVendorInfo_C
/// Size: 0x0042 (0x000280 - 0x0002C2)
class UWBP_ShopVendorInfo_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Show;                                                       // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Expand;                                                     // 0x0290   (0x0008)  
	UHorizontalBox*                                    HorizontalBox;                                              // 0x0298   (0x0008)  
	UImage*                                            Image_Icon;                                                 // 0x02A0   (0x0008)  
	UTextBlock*                                        Text_VandorName;                                            // 0x02A8   (0x0008)  
	UTextBlock*                                        Text_VendorType;                                            // 0x02B0   (0x0008)  
	UWBP_TutorialQuest3DTracker_C*                     WBP_TutorialQuest3DTracker;                                 // 0x02B8   (0x0008)  
	bool                                               Expanded;                                                   // 0x02C0   (0x0001)  
	bool                                               Showed;                                                     // 0x02C1   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/UniversalMarkerSystem/WBP_ShopVendorInfo.WBP_ShopVendorInfo_C.Init
	void Init(UPaperSprite* Icon, FText Type, FText Name);                                                                   // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/UniversalMarkerSystem/WBP_ShopVendorInfo.WBP_ShopVendorInfo_C.GetExpand
	void GetExpand(bool& Expanded);                                                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/UniversalMarkerSystem/WBP_ShopVendorInfo.WBP_ShopVendorInfo_C.GetShow
	void GetShow(bool& Showed);                                                                                              // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/UniversalMarkerSystem/WBP_ShopVendorInfo.WBP_ShopVendorInfo_C.ExpandName
	void ExpandName(bool Expand);                                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/UniversalMarkerSystem/WBP_ShopVendorInfo.WBP_ShopVendorInfo_C.ShowContent
	void ShowContent(bool Show);                                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/UniversalMarkerSystem/WBP_ShopVendorInfo.WBP_ShopVendorInfo_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/UniversalMarkerSystem/WBP_ShopVendorInfo.WBP_ShopVendorInfo_C.ExecuteUbergraph_WBP_ShopVendorInfo
	void ExecuteUbergraph_WBP_ShopVendorInfo(int32_t EntryPoint);                                                            // [0x2407bf0] Final                
};

/// Class /Game/Blueprints/DamageTypes/FireDamageType.FireDamageType_C
/// Size: 0x0000 (0x000040 - 0x000040)
class UFireDamageType_C : public UDamageType : UDamageType
{ 
public:
};

/// Class /Game/Blueprints/QuestSystem/V5/QuestEvents/InitQuestZones.InitQuestZones_C
/// Size: 0x0008 (0x000038 - 0x000040)
class UInitQuestZones_C : public UQuestEvent : UQuestEvent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0038   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/QuestSystem/V5/QuestEvents/InitQuestZones.InitQuestZones_C.Add Message
	void Add Message(UQuestContext* Context);                                                                                // [0x2407bf0] Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/QuestEvents/InitQuestZones.InitQuestZones_C.ExecuteEvent
	void ExecuteEvent(UQuestContext* Context, FQuestEventPayload& Payload);                                                  // [0x2407bf0] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/QuestEvents/InitQuestZones.InitQuestZones_C.ExecuteUbergraph_InitQuestZones
	void ExecuteUbergraph_InitQuestZones(int32_t EntryPoint);                                                                // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/QuestSystem/V5/QuestEvents/DeactivateQuestZones.DeactivateQuestZones_C
/// Size: 0x0008 (0x000038 - 0x000040)
class UDeactivateQuestZones_C : public UQuestEvent : UQuestEvent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0038   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/QuestSystem/V5/QuestEvents/DeactivateQuestZones.DeactivateQuestZones_C.ExecuteEvent
	void ExecuteEvent(UQuestContext* Context, FQuestEventPayload& Payload);                                                  // [0x2407bf0] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/QuestEvents/DeactivateQuestZones.DeactivateQuestZones_C.ExecuteUbergraph_DeactivateQuestZones
	void ExecuteUbergraph_DeactivateQuestZones(int32_t EntryPoint);                                                          // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/QuestSystem/V5/QuestEvents/AddProgressInUI.AddProgressInUI_C
/// Size: 0x0018 (0x000038 - 0x000050)
class UAddProgressInUI_C : public UQuestEvent : UQuestEvent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0038   (0x0008)  
	FName                                              Variable_Variable;                                          // 0x0040   (0x0008)  
	bool                                               Additive;                                                   // 0x0048   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0049   (0x0003)  MISSED
	int32_t                                            Value;                                                      // 0x004C   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/QuestSystem/V5/QuestEvents/AddProgressInUI.AddProgressInUI_C.SetValueProgress
	int32_t SetValueProgress(UQuestContext* Context);                                                                        // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/QuestEvents/AddProgressInUI.AddProgressInUI_C.ExecuteEvent
	void ExecuteEvent(UQuestContext* Context, FQuestEventPayload& Payload);                                                  // [0x2407bf0] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/QuestEvents/AddProgressInUI.AddProgressInUI_C.ExecuteUbergraph_AddProgressInUI
	void ExecuteUbergraph_AddProgressInUI(int32_t EntryPoint);                                                               // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/QuestSystem/V5/QuestEvents/ActivateQuestZones.ActivateQuestZones_C
/// Size: 0x000A (0x000038 - 0x000042)
class UActivateQuestZones_C : public UQuestEvent : UQuestEvent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0038   (0x0008)  
	bool                                               Progreess_Zone;                                             // 0x0040   (0x0001)  
	bool                                               Random;                                                     // 0x0041   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/QuestSystem/V5/QuestEvents/ActivateQuestZones.ActivateQuestZones_C.ExecuteEvent
	void ExecuteEvent(UQuestContext* Context, FQuestEventPayload& Payload);                                                  // [0x2407bf0] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Blueprints/QuestSystem/V5/QuestEvents/ActivateQuestZones.ActivateQuestZones_C.ExecuteUbergraph_ActivateQuestZones
	void ExecuteUbergraph_ActivateQuestZones(int32_t EntryPoint);                                                            // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/BurbWire/BP_BurbWire.BP_BurbWire_C
/// Size: 0x0010 (0x000290 - 0x0002A0)
class ABP_BurbWire_C : public AActor : AActor
{ 
public:
	UBoxComponent*                                     CollisionBox;                                               // 0x0290   (0x0008)  
	UStaticMeshComponent*                              StaticMesh;                                                 // 0x0298   (0x0008)  
};

/// Class /Game/Blueprints/FMODParamTask.FMODParamTask_C
/// Size: 0x0049 (0x000028 - 0x000071)
class UFMODParamTask_C : public UObject : UObject
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0028   (0x0008)  
	UFMODAudioComponent*                               Comp;                                                       // 0x0030   (0x0008)  
	FName                                              ParamName;                                                  // 0x0038   (0x0008)  
	double                                             ToValue;                                                    // 0x0040   (0x0008)  
	double                                             LerpTime;                                                   // 0x0048   (0x0008)  
	double                                             InitParamValue;                                             // 0x0050   (0x0008)  
	UCurveFloat*                                       Curve;                                                      // 0x0058   (0x0008)  
	double                                             CurrentTime;                                                // 0x0060   (0x0008)  
	FTimerHandle                                       Timer;                                                      // 0x0068   (0x0008)  
	bool                                               stopped;                                                    // 0x0070   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/FMODParamTask.FMODParamTask_C.StartTask
	void StartTask();                                                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/FMODParamTask.FMODParamTask_C.Tick
	void Tick();                                                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/FMODParamTask.FMODParamTask_C.StopTask
	void StopTask();                                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/FMODParamTask.FMODParamTask_C.ExecuteUbergraph_FMODParamTask
	void ExecuteUbergraph_FMODParamTask(int32_t EntryPoint);                                                                 // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C
/// Size: 0x00D0 (0x000290 - 0x000360)
class ABP_BlizzardControllerV2_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	UFMODAudioComponent*                               Wind;                                                       // 0x0298   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x02A0   (0x0008)  
	float                                              Fog_FogDensity_39DFC88C433FF73B29A16CA3263E19C0;            // 0x02A8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Fog__Direction_39DFC88C433FF73B29A16CA3263E19C0;            // 0x02AC   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02AD   (0x0003)  MISSED
	UTimelineComponent*                                Fog;                                                        // 0x02B0   (0x0008)  
	bool                                               ForceBlizzard;                                              // 0x02B8   (0x0001)  
	bool                                               IsBlizzard;                                                 // 0x02B9   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x02BA   (0x0006)  MISSED
	double                                             BlizzardDelayTimer;                                         // 0x02C0   (0x0008)  
	double                                             BlizzardDurationTimer;                                      // 0x02C8   (0x0008)  
	FMulticastInlineDelegate                           OnBlizzardStart;                                            // 0x02D0   (0x0010)  
	FMulticastInlineDelegate                           OnBlizzardStop;                                             // 0x02E0   (0x0010)  
	FTimerHandle                                       HeightUpTimerHandle;                                        // 0x02F0   (0x0008)  
	FTimerHandle                                       HeightDownTimerHandle;                                      // 0x02F8   (0x0008)  
	bool                                               TransitionBlizzardOn;                                       // 0x0300   (0x0001)  
	bool                                               TransitionBlizzardOff;                                      // 0x0301   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x0302   (0x0006)  MISSED
	double                                             TransitionBlizzardTime;                                     // 0x0308   (0x0008)  
	double                                             TransitionToBlizzard;                                       // 0x0310   (0x0008)  
	bool                                               InHouse;                                                    // 0x0318   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x0319   (0x0007)  MISSED
	double                                             TransitionToNormal;                                         // 0x0320   (0x0008)  
	AUltra_Dynamic_Weather_C*                          UltraDynamicSkyWeather;                                     // 0x0328   (0x0008)  
	FFloatRange                                        BlizzardDelay;                                              // 0x0330   (0x0010)  
	FFloatRange                                        BlizzardDuration;                                           // 0x0340   (0x0010)  
	double                                             WindHeightUp;                                               // 0x0350   (0x0008)  
	double                                             WindHeightDown;                                             // 0x0358   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.OnRep_IsBlizzard
	void OnRep_IsBlizzard();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.CalculateNextBlizzard
	void CalculateNextBlizzard(bool ForceBlizzard);                                                                          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x2407bf0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.Fog__FinishedFunc
	void Fog__FinishedFunc();                                                                                                // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.Fog__UpdateFunc
	void Fog__UpdateFunc();                                                                                                  // [0x2407bf0] BlueprintEvent       
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.HeightUp
	void HeightUp();                                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.HeightDown
	void HeightDown();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.HouseEntered
	void HouseEntered();                                                                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.HouseLeaved
	void HouseLeaved();                                                                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.WaitBlizzard
	void WaitBlizzard();                                                                                                     // [0x2407bf0] Net|NetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.StopWind
	void StopWind();                                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.PlayWind
	void PlayWind();                                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.BunkerEntered
	void BunkerEntered();                                                                                                    // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.BunkerLeaved
	void BunkerLeaved();                                                                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.StartBlizzard
	void StartBlizzard();                                                                                                    // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.StopBlizzard
	void StopBlizzard();                                                                                                     // [0x2407bf0] Net|NetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.ExecuteUbergraph_BP_BlizzardControllerV2
	void ExecuteUbergraph_BP_BlizzardControllerV2(int32_t EntryPoint);                                                       // [0x2407bf0] Final|HasDefaults    
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.OnBlizzardStop__DelegateSignature
	void OnBlizzardStop__DelegateSignature();                                                                                // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/DayCycle/BP_BlizzardControllerV2.BP_BlizzardControllerV2_C.OnBlizzardStart__DelegateSignature
	void OnBlizzardStart__DelegateSignature();                                                                               // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C
/// Size: 0x0091 (0x000290 - 0x000321)
class ABP_CampingBase_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	USceneComponent*                                   Scene1;                                                     // 0x0298   (0x0008)  
	USceneComponent*                                   Scene4;                                                     // 0x02A0   (0x0008)  
	USceneComponent*                                   Scene3;                                                     // 0x02A8   (0x0008)  
	USceneComponent*                                   Scene2;                                                     // 0x02B0   (0x0008)  
	USceneComponent*                                   Points;                                                     // 0x02B8   (0x0008)  
	USphereComponent*                                  CampingBound;                                               // 0x02C0   (0x0008)  
	USceneComponent*                                   Root;                                                       // 0x02C8   (0x0008)  
	TArray<UStaticMeshComponent*>                      Meshes;                                                     // 0x02D0   (0x0010)  
	TArray<UMaterialInterface*>                        DefaultMaterials;                                           // 0x02E0   (0x0010)  
	TArray<UMaterialInstanceDynamic*>                  StateMaterials;                                             // 0x02F0   (0x0010)  
	bool                                               IsBuilt;                                                    // 0x0300   (0x0001)  
	bool                                               IsCanRemoved;                                               // 0x0301   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0302   (0x0006)  MISSED
	AActor*                                            Box;                                                        // 0x0308   (0x0008)  
	TArray<AActor*>                                    IgnoreActors;                                               // 0x0310   (0x0010)  
	bool                                               IsBuildable;                                                // 0x0320   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.CheckForSurface
	void CheckForSurface(bool& CanBePlaced);                                                                                 // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.SetCollisionResponse
	void SetCollisionResponse(bool CollisionEnabled);                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.ChangeToDefaultMaterials
	void ChangeToDefaultMaterials();                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.ChangeToStateMaterials
	void ChangeToStateMaterials();                                                                                           // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.SetCampBuildingState
	void SetCampBuildingState(bool CanBuildCamping);                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.StoreAllMeshes
	void StoreAllMeshes();                                                                                                   // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.StoreAllMaterials
	void StoreAllMaterials();                                                                                                // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.CampingBuilt
	void CampingBuilt();                                                                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.CampingBuildingState
	void CampingBuildingState();                                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.RemoveSelf
	void RemoveSelf();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.UpdateLocationAndRotation
	void UpdateLocationAndRotation(FVector Location, FRotator Rotation);                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.CampingBuiltV2
	void CampingBuiltV2();                                                                                                   // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.BuildCampTrailer
	void BuildCampTrailer();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.BuildingStateUpd
	void BuildingStateUpd();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/CampingSystem/BP_CampingBase.BP_CampingBase_C.ExecuteUbergraph_BP_CampingBase
	void ExecuteUbergraph_BP_CampingBase(int32_t EntryPoint);                                                                // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Blueprints/EMptySkeletal.EMptySkeletal_C
/// Size: 0x0050 (0x000290 - 0x0002E0)
class AEMptySkeletal_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	USkeletalMeshComponent*                            SkeletalMesh;                                               // 0x0298   (0x0008)  
	USkeletalMesh*                                     Mesh;                                                       // 0x02A0   (0x0008)  
	UAnimSequence*                                     Anim;                                                       // 0x02A8   (0x0008)  
	double                                             DurationToDrop;                                             // 0x02B0   (0x0008)  
	double                                             AnimDelay;                                                  // 0x02B8   (0x0008)  
	double                                             DisappearDelay;                                             // 0x02C0   (0x0008)  
	double                                             VisibilityDelay;                                            // 0x02C8   (0x0008)  
	TArray<UMaterialInstance*>                         CustomMaterials;                                            // 0x02D0   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/EMptySkeletal.EMptySkeletal_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x2407bf0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/EMptySkeletal.EMptySkeletal_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/EMptySkeletal.EMptySkeletal_C.ExecuteUbergraph_EMptySkeletal
	void ExecuteUbergraph_EMptySkeletal(int32_t EntryPoint);                                                                 // [0x2407bf0] Final                
};

/// Class /Game/Blueprints/SquadSystem/Lobby/AN_StopAdditive.AN_StopAdditive_C
/// Size: 0x0001 (0x000038 - 0x000039)
class UAN_StopAdditive_C : public UAnimNotify : UAnimNotify
{ 
public:
	bool                                               Head;                                                       // 0x0038   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/SquadSystem/Lobby/AN_StopAdditive.AN_StopAdditive_C.Received_Notify
	bool Received_Notify(USkeletalMeshComponent* meshComp, UAnimSequenceBase* Animation, FAnimNotifyEventReference& EventReference); // [0x2407bf0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/Blueprints/SquadSystem/Lobby/ABP_CreateCharacter.ABP_CreateCharacter_C
/// Size: 0x0C4A (0x000350 - 0x000F9A)
class UABP_CreateCharacter_C : public UAnimInstance : UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x0358   (0x0018)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0370   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0378   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0380   (0x0020)  
	FAnimNode_BlendListByInt                           AnimGraphNode_BlendListByInt;                               // 0x03A0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x03E8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0430   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0478   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x04C0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0508   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0550   (0x0020)  
	FAnimNode_BlendListByInt                           AnimGraphNode_BlendListByInt;                               // 0x0570   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x05B8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0600   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0648   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0690   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x06B0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x06F8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0718   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive;                                // 0x07E0   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x08A8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x08F0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0938   (0x0048)  
	FAnimNode_BlendListByInt                           AnimGraphNode_BlendListByInt;                               // 0x0980   (0x0048)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x09C8   (0x0048)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0A10   (0x0108)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0B18   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0B40   (0x0028)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0B68   (0x0108)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive;                                // 0x0C70   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0D38   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0D80   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0DA8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0DD0   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0E18   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0E60   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0EA8   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0EF0   (0x0048)  
