
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package Chaos.

/// Struct /Script/Chaos.ManagedArrayCollection
/// Size: 0x00B0 (0x000000 - 0x0000B0)
struct FManagedArrayCollection
{ 
	unsigned char                                      UnknownData00_1[0xB0];                                      // 0x0000   (0x00B0)  MISSED
};

/// Struct /Script/Chaos.ClosestPhysicsObjectResult
/// Size: 0x0028 (0x000000 - 0x000028)
struct FClosestPhysicsObjectResult
{ 
	unsigned char                                      UnknownData00_1[0x28];                                      // 0x0000   (0x0028)  MISSED
};

/// Struct /Script/Chaos.ChaosSolverConfiguration
/// Size: 0x0068 (0x000000 - 0x000068)
struct FChaosSolverConfiguration
{ 
	int32_t                                            PositionIterations;                                         // 0x0000   (0x0004)  
	int32_t                                            VelocityIterations;                                         // 0x0004   (0x0004)  
	int32_t                                            ProjectionIterations;                                       // 0x0008   (0x0004)  
	float                                              CollisionMarginFraction;                                    // 0x000C   (0x0004)  
	float                                              CollisionMarginMax;                                         // 0x0010   (0x0004)  
	float                                              CollisionCullDistance;                                      // 0x0014   (0x0004)  
	float                                              CollisionMaxPushOutVelocity;                                // 0x0018   (0x0004)  
	float                                              ClusterConnectionFactor;                                    // 0x001C   (0x0004)  
	EClusterUnionMethod                                ClusterUnionConnectionType;                                 // 0x0020   (0x0001)  
	bool                                               bGenerateCollisionData;                                     // 0x0021   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0022   (0x0002)  MISSED
	FSolverCollisionFilterSettings                     CollisionFilterSettings;                                    // 0x0024   (0x0010)  
	bool                                               bGenerateBreakData;                                         // 0x0034   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0035   (0x0003)  MISSED
	FSolverBreakingFilterSettings                      BreakingFilterSettings;                                     // 0x0038   (0x0010)  
	bool                                               bGenerateTrailingData;                                      // 0x0048   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0049   (0x0003)  MISSED
	FSolverTrailingFilterSettings                      TrailingFilterSettings;                                     // 0x004C   (0x0010)  
	int32_t                                            Iterations;                                                 // 0x005C   (0x0004)  
	int32_t                                            PushOutIterations;                                          // 0x0060   (0x0004)  
	bool                                               bGenerateContactGraph;                                      // 0x0064   (0x0001)  
	unsigned char                                      UnknownData03_6[0x3];                                       // 0x0065   (0x0003)  MISSED
};

/// Struct /Script/Chaos.SolverTrailingFilterSettings
/// Size: 0x0010 (0x000000 - 0x000010)
struct FSolverTrailingFilterSettings
{ 
	bool                                               FilterEnabled;                                              // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              MinMass;                                                    // 0x0004   (0x0004)  
	float                                              MinSpeed;                                                   // 0x0008   (0x0004)  
	float                                              MinVolume;                                                  // 0x000C   (0x0004)  
};

/// Struct /Script/Chaos.SolverBreakingFilterSettings
/// Size: 0x0010 (0x000000 - 0x000010)
struct FSolverBreakingFilterSettings
{ 
	bool                                               FilterEnabled;                                              // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              MinMass;                                                    // 0x0004   (0x0004)  
	float                                              MinSpeed;                                                   // 0x0008   (0x0004)  
	float                                              MinVolume;                                                  // 0x000C   (0x0004)  
};

/// Struct /Script/Chaos.SolverCollisionFilterSettings
/// Size: 0x0010 (0x000000 - 0x000010)
struct FSolverCollisionFilterSettings
{ 
	bool                                               FilterEnabled;                                              // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              MinMass;                                                    // 0x0004   (0x0004)  
	float                                              MinSpeed;                                                   // 0x0008   (0x0004)  
	float                                              MinImpulse;                                                 // 0x000C   (0x0004)  
};

/// Struct /Script/Chaos.SolverCollisionData
/// Size: 0x00C0 (0x000000 - 0x0000C0)
struct FSolverCollisionData
{ 
	FVector                                            Location;                                                   // 0x0000   (0x0018)  
	FVector                                            AccumulatedImpulse;                                         // 0x0018   (0x0018)  
	FVector                                            Normal;                                                     // 0x0030   (0x0018)  
	FVector                                            Velocity1;                                                  // 0x0048   (0x0018)  
	FVector                                            Velocity2;                                                  // 0x0060   (0x0018)  
	FVector                                            AngularVelocity1;                                           // 0x0078   (0x0018)  
	FVector                                            AngularVelocity2;                                           // 0x0090   (0x0018)  
	float                                              Mass1;                                                      // 0x00A8   (0x0004)  
	float                                              Mass2;                                                      // 0x00AC   (0x0004)  
	int32_t                                            ParticleIndex;                                              // 0x00B0   (0x0004)  
	int32_t                                            LevelsetIndex;                                              // 0x00B4   (0x0004)  
	int32_t                                            ParticleIndexMesh;                                          // 0x00B8   (0x0004)  
	int32_t                                            LevelsetIndexMesh;                                          // 0x00BC   (0x0004)  
};

/// Struct /Script/Chaos.SolverBreakingData
/// Size: 0x0058 (0x000000 - 0x000058)
struct FSolverBreakingData
{ 
	FVector                                            Location;                                                   // 0x0000   (0x0018)  
	FVector                                            Velocity;                                                   // 0x0018   (0x0018)  
	FVector                                            AngularVelocity;                                            // 0x0030   (0x0018)  
	float                                              Mass;                                                       // 0x0048   (0x0004)  
	int32_t                                            ParticleIndex;                                              // 0x004C   (0x0004)  
	int32_t                                            ParticleIndexMesh;                                          // 0x0050   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0054   (0x0004)  MISSED
};

/// Struct /Script/Chaos.SolverTrailingData
/// Size: 0x0058 (0x000000 - 0x000058)
struct FSolverTrailingData
{ 
	FVector                                            Location;                                                   // 0x0000   (0x0018)  
	FVector                                            Velocity;                                                   // 0x0018   (0x0018)  
	FVector                                            AngularVelocity;                                            // 0x0030   (0x0018)  
	float                                              Mass;                                                       // 0x0048   (0x0004)  
	int32_t                                            ParticleIndex;                                              // 0x004C   (0x0004)  
	int32_t                                            ParticleIndexMesh;                                          // 0x0050   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0054   (0x0004)  MISSED
};

/// Struct /Script/Chaos.RecordedFrame
/// Size: 0x00B8 (0x000000 - 0x0000B8)
struct FRecordedFrame
{ 
	TArray<FTransform>                                 Transforms;                                                 // 0x0000   (0x0010)  
	TArray<int32_t>                                    TransformIndices;                                           // 0x0010   (0x0010)  
	TArray<int32_t>                                    PreviousTransformIndices;                                   // 0x0020   (0x0010)  
	TArray<bool>                                       DisabledFlags;                                              // 0x0030   (0x0010)  
	TArray<FSolverCollisionData>                       Collisions;                                                 // 0x0040   (0x0010)  
	TArray<FSolverBreakingData>                        Breakings;                                                  // 0x0050   (0x0010)  
	TSet<FSolverTrailingData>                          Trailings;                                                  // 0x0060   (0x0050)  
	float                                              Timestamp;                                                  // 0x00B0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x00B4   (0x0004)  MISSED
};

/// Struct /Script/Chaos.RecordedTransformTrack
/// Size: 0x0010 (0x000000 - 0x000010)
struct FRecordedTransformTrack
{ 
	TArray<FRecordedFrame>                             Records;                                                    // 0x0000   (0x0010)  
};

/// Struct /Script/Chaos.SolverRemovalFilterSettings
/// Size: 0x000C (0x000000 - 0x00000C)
struct FSolverRemovalFilterSettings
{ 
	bool                                               FilterEnabled;                                              // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              MinMass;                                                    // 0x0004   (0x0004)  
	float                                              MinVolume;                                                  // 0x0008   (0x0004)  
};

/// Enum /Script/Chaos.ChaosDeformableSimSpace
/// Size: 0x04
enum ChaosDeformableSimSpace : uint8_t
{
	World0                                                                           = 0,
	ComponentXf1                                                                     = 1,
	bone2                                                                            = 2,
	ChaosDeformableSimSpace_MAX3                                                     = 3
};

/// Enum /Script/Chaos.ESetMaskConditionType
/// Size: 0x05
enum ESetMaskConditionType : uint8_t
{
	Field_Set_Always0                                                                = 0,
	Field_Set_IFF_NOT_Interior1                                                      = 1,
	Field_Set_IFF_NOT_Exterior2                                                      = 2,
