
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package Characters.

/// Struct /Game/Characters/Abbie/abbie2/Abbie_v2/Abbie_Skeleton_AnimBlueprint.Abbie_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x014F (0x000001 - 0x000150)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0008   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0010   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0018   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x0019   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x001A   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0020   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0030   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0034   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x003C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0040   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0044   (0x002C)  
	float                                              __FloatProperty;                                            // 0x0070   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0074   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0075   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x0076   (0x0001)  
	unsigned char                                      UnknownData03_5[0x1];                                       // 0x0077   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x0078   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0080   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x0084   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0088   (0x0020)  
	FName                                              __NameProperty;                                             // 0x00A8   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00B0   (0x0008)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00B8   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0138   (0x0018)  
};

/// Struct /Game/Characters/Abbie/abbie2/Abbie_v2/Abbie_Skeleton_AnimBlueprint.Abbie_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
};

/// Struct /Game/Characters/Rob/RobAnimationBlueprint.RobAnimationBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0157 (0x000001 - 0x000158)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0008   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0010   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0018   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x0019   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x001A   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0020   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0030   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0034   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x003C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0040   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0044   (0x002C)  
	float                                              __FloatProperty;                                            // 0x0070   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0074   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0075   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x0076   (0x0001)  
	unsigned char                                      UnknownData03_5[0x1];                                       // 0x0077   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x0078   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0080   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0088   (0x0004)  
	FName                                              __NameProperty;                                             // 0x008C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0094   (0x0008)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x009C   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x00A0   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00C0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0140   (0x0018)  
};

/// Struct /Game/Characters/Rob/RobAnimationBlueprint.RobAnimationBlueprint_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
};

/// Struct /Game/Characters/Chriss/Chris__1__Skeleton_AnimBlueprint.Chris__1__Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0147 (0x000001 - 0x000148)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0002   (0x0002)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x000C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0010   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0014   (0x002C)  
	float                                              __FloatProperty;                                            // 0x0040   (0x0004)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0044   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x0045   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x0046   (0x0002)  MISSED
	FName                                              __NameProperty;                                             // 0x0048   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0050   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0054   (0x0004)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0058   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0060   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0068   (0x0001)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0069   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x006A   (0x0001)  
	unsigned char                                      UnknownData03_5[0x5];                                       // 0x006B   (0x0005)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0070   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0080   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0088   (0x0008)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0090   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00B0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0130   (0x0018)  
};

/// Struct /Game/Characters/Chriss/Chris__1__Skeleton_AnimBlueprint.Chris__1__Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
};

/// Struct /Game/Characters/Lenny/V2/Lenny_Skeleton_AnimBlueprint.Lenny_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x014F (0x000001 - 0x000150)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0010   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0018   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0020   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x0021   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x0022   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0028   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0038   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0039   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x003C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0044   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0048   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x004C   (0x002C)  
	float                                              __FloatProperty;                                            // 0x0078   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x007C   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x007D   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x007E   (0x0001)  
	unsigned char                                      UnknownData04_5[0x1];                                       // 0x007F   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x0080   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0088   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0090   (0x0004)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x0094   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0098   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00B8   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0138   (0x0018)  
};

/// Struct /Game/Characters/Lenny/V2/Lenny_Skeleton_AnimBlueprint.Lenny_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
};

/// Class /Game/Characters/Abbie/abbie2/Abbie_v2/Abbie_Skeleton_AnimBlueprint.Abbie_Skeleton_AnimBlueprint_C
/// Size: 0x05C9 (0x000350 - 0x000919)
class UAbbie_Skeleton_AnimBlueprint_C : public UAnimInstance : UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x0358   (0x0002)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x035A   (0x0006)  MISSED
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0368   (0x0008)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0370   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x03B8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x03E0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0428   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0448   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0490   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x04B0   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0578   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x05A0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x05E8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0608   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0650   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0670   (0x00C8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0738   (0x0108)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0840   (0x0028)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0868   (0x0048)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x08B0   (0x0048)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x08F8   (0x0020)  
	bool                                               bSurvInteracted;                                            // 0x0918   (0x0001)  


	/// Functions
	// Function /Game/Characters/Abbie/abbie2/Abbie_v2/Abbie_Skeleton_AnimBlueprint.Abbie_Skeleton_AnimBlueprint_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Abbie/abbie2/Abbie_v2/Abbie_Skeleton_AnimBlueprint.Abbie_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Abbie_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_B98C11704AA27B8ACD81A6AE3BFCAC70
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abbie_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_B98C11704AA27B8ACD81A6AE3BFCAC70(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Characters/Abbie/abbie2/Abbie_v2/Abbie_Skeleton_AnimBlueprint.Abbie_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Abbie_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_84A6013D4D434BE1577BB894A2221559
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abbie_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_84A6013D4D434BE1577BB894A2221559(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Characters/Abbie/abbie2/Abbie_v2/Abbie_Skeleton_AnimBlueprint.Abbie_Skeleton_AnimBlueprint_C.StopInteracting
	void StopInteracting();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Abbie/abbie2/Abbie_v2/Abbie_Skeleton_AnimBlueprint.Abbie_Skeleton_AnimBlueprint_C.OnInteracted
	void OnInteracted();                                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Abbie/abbie2/Abbie_v2/Abbie_Skeleton_AnimBlueprint.Abbie_Skeleton_AnimBlueprint_C.ExecuteUbergraph_Abbie_Skeleton_AnimBlueprint
	void ExecuteUbergraph_Abbie_Skeleton_AnimBlueprint(int32_t EntryPoint);                                                  // [0x2407bf0] Final                
};

/// Class /Game/Characters/Rob/RobAnimationBlueprint.RobAnimationBlueprint_C
/// Size: 0x06B1 (0x000350 - 0x000A01)
class URobAnimationBlueprint_C : public UAnimInstance : UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x0358   (0x0002)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x035A   (0x0006)  MISSED
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0368   (0x0008)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0370   (0x0108)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0478   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x04A0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x04C8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0510   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0530   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0578   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0598   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0660   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x06A8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x06D0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0718   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0738   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0780   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x07A0   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0868   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0888   (0x00C8)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0950   (0x0020)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0970   (0x0048)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x09B8   (0x0048)  
	bool                                               bSurvInteracted;                                            // 0x0A00   (0x0001)  


	/// Functions
	// Function /Game/Characters/Rob/RobAnimationBlueprint.RobAnimationBlueprint_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Rob/RobAnimationBlueprint.RobAnimationBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RobAnimationBlueprint_AnimGraphNode_TransitionResult_20A27DD54E4DFF083AED3BADF88D6572
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RobAnimationBlueprint_AnimGraphNode_TransitionResult_20A27DD54E4DFF083AED3BADF88D6572(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Characters/Rob/RobAnimationBlueprint.RobAnimationBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RobAnimationBlueprint_AnimGraphNode_TransitionResult_EA34BE3247E0C05181F8CD8CD3D0688F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RobAnimationBlueprint_AnimGraphNode_TransitionResult_EA34BE3247E0C05181F8CD8CD3D0688F(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Characters/Rob/RobAnimationBlueprint.RobAnimationBlueprint_C.StopInteracting
	void StopInteracting();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Rob/RobAnimationBlueprint.RobAnimationBlueprint_C.OnInteracted
	void OnInteracted();                                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Rob/RobAnimationBlueprint.RobAnimationBlueprint_C.ExecuteUbergraph_RobAnimationBlueprint
	void ExecuteUbergraph_RobAnimationBlueprint(int32_t EntryPoint);                                                         // [0x2407bf0] Final                
};

/// Class /Game/Characters/Chriss/Chris__1__Skeleton_AnimBlueprint.Chris__1__Skeleton_AnimBlueprint_C
/// Size: 0x05C9 (0x000350 - 0x000919)
class UChris__1__Skeleton_AnimBlueprint_C : public UAnimInstance : UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x0358   (0x0002)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x035A   (0x0006)  MISSED
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0368   (0x0008)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0370   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0398   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x03E0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0400   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0448   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0468   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0530   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0558   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x05A0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x05C0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0608   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0628   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x06F0   (0x0048)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0738   (0x0048)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0780   (0x0048)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x07C8   (0x0108)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x08D0   (0x0020)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x08F0   (0x0028)  
	bool                                               bSurvInteracted;                                            // 0x0918   (0x0001)  


	/// Functions
	// Function /Game/Characters/Chriss/Chris__1__Skeleton_AnimBlueprint.Chris__1__Skeleton_AnimBlueprint_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Chriss/Chris__1__Skeleton_AnimBlueprint.Chris__1__Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Chris__1__Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_8DCEAA2344ED27A263E24BBAFFB429C4
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chris__1__Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_8DCEAA2344ED27A263E24BBAFFB429C4(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Characters/Chriss/Chris__1__Skeleton_AnimBlueprint.Chris__1__Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Chris__1__Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_45CD4DED4A225470F39513B638B4EB13
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chris__1__Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_45CD4DED4A225470F39513B638B4EB13(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Characters/Chriss/Chris__1__Skeleton_AnimBlueprint.Chris__1__Skeleton_AnimBlueprint_C.OnInteracted
	void OnInteracted();                                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Chriss/Chris__1__Skeleton_AnimBlueprint.Chris__1__Skeleton_AnimBlueprint_C.StopInteracting
	void StopInteracting();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Chriss/Chris__1__Skeleton_AnimBlueprint.Chris__1__Skeleton_AnimBlueprint_C.ExecuteUbergraph_Chris__1__Skeleton_AnimBlueprint
	void ExecuteUbergraph_Chris__1__Skeleton_AnimBlueprint(int32_t EntryPoint);                                              // [0x2407bf0] Final                
};

/// Class /Game/Characters/Lenny/V2/Lenny_Skeleton_AnimBlueprint.Lenny_Skeleton_AnimBlueprint_C
/// Size: 0x05E0 (0x000350 - 0x000930)
class ULenny_Skeleton_AnimBlueprint_C : public UAnimInstance : UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x0358   (0x0002)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x035A   (0x0006)  MISSED
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0368   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0370   (0x0020)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0390   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x03D8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0400   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0448   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0468   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x04B0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x04D0   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0598   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x05C0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0608   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0628   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0670   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0690   (0x00C8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0758   (0x0108)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0860   (0x0028)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0888   (0x0048)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x08D0   (0x0048)  
	bool                                               bSurvInteracted;                                            // 0x0918   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0919   (0x0007)  MISSED
	UFMODAudioComponent*                               NewVar;                                                     // 0x0920   (0x0008)  
	UFMODAudioComponent*                               lenny_wrinig;                                               // 0x0928   (0x0008)  


	/// Functions
	// Function /Game/Characters/Lenny/V2/Lenny_Skeleton_AnimBlueprint.Lenny_Skeleton_AnimBlueprint_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Lenny/V2/Lenny_Skeleton_AnimBlueprint.Lenny_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Lenny_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1167D57A483559DEB6093AB867209326
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Lenny_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1167D57A483559DEB6093AB867209326(); // [0x2407bf0] BlueprintEvent       
