
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package Custom_Lens_Flare_VFX.

/// Class /Game/Custom_Lens_Flare_VFX/Blueprints/LensFlare_BP.LensFlare_BP_C
/// Size: 0x04A0 (0x000290 - 0x000730)
class ALensFlare_BP_C : public AActor : AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	UMaterialBillboardComponent*                       LensFlare;                                                  // 0x0298   (0x0008)  
	USceneComponent*                                   Scene;                                                      // 0x02A0   (0x0008)  
	double                                             DeltaTime;                                                  // 0x02A8   (0x0008)  
	UMaterialInstanceDynamic*                          FlareDynamicMI;                                             // 0x02B0   (0x0008)  
	UMaterialInterface*                                FlareMat;                                                   // 0x02B8   (0x0008)  
	double                                             GlobalBrightness;                                           // 0x02C0   (0x0008)  
	double                                             GhostsBrightness;                                           // 0x02C8   (0x0008)  
	bool                                               UseFadeDistance;                                            // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02D1   (0x0007)  MISSED
	double                                             FadeDistance;                                               // 0x02D8   (0x0008)  
	bool                                               UseDistanceBloom;                                           // 0x02E0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02E1   (0x0007)  MISSED
	double                                             IncreasingBloomByDistance;                                  // 0x02E8   (0x0008)  
	FLinearColor                                       GlobalColor;                                                // 0x02F0   (0x0010)  
	double                                             FadeOutSpeed;                                               // 0x0300   (0x0008)  
	double                                             FadeInSpeed;                                                // 0x0308   (0x0008)  
	double                                             BaseSizeY;                                                  // 0x0310   (0x0008)  
	double                                             BaseSizeX;                                                  // 0x0318   (0x0008)  
	double                                             FlickerIntensity;                                           // 0x0320   (0x0008)  
	double                                             FlickerTime;                                                // 0x0328   (0x0008)  
	double                                             Luminosity;                                                 // 0x0330   (0x0008)  
	TArray<AActor*>                                    Actors_for_ignore_lens_flare_;                              // 0x0338   (0x0010)  
	double                                             HaloBrightness;                                             // 0x0348   (0x0008)  
	double                                             HaloContrast;                                               // 0x0350   (0x0008)  
	double                                             HaloOpacity;                                                // 0x0358   (0x0008)  
	double                                             HaloInnerRadius;                                            // 0x0360   (0x0008)  
	FLinearColor                                       HaloOuterColor;                                             // 0x0368   (0x0010)  
	FLinearColor                                       HaloInnerColor;                                             // 0x0378   (0x0010)  
	UTexture*                                          HaloTexture;                                                // 0x0388   (0x0008)  
	double                                             CentreFlareBrightness;                                      // 0x0390   (0x0008)  
	double                                             CentreFlareContrast;                                        // 0x0398   (0x0008)  
	FLinearColor                                       CentreFlareColor;                                           // 0x03A0   (0x0010)  
	UTexture*                                          CentreFlareTexture;                                         // 0x03B0   (0x0008)  
	double                                             MainFlareBrightness;                                        // 0x03B8   (0x0008)  
	double                                             MainFlareContrast;                                          // 0x03C0   (0x0008)  
	double                                             MainFlareInnerRadius;                                       // 0x03C8   (0x0008)  
	double                                             MainFlareSize;                                              // 0x03D0   (0x0008)  
	FLinearColor                                       MainLensInnerColor;                                         // 0x03D8   (0x0010)  
	FLinearColor                                       MainOuterColor;                                             // 0x03E8   (0x0010)  
	UTexture*                                          MainFlare;                                                  // 0x03F8   (0x0008)  
	double                                             HaloTextureSize;                                            // 0x0400   (0x0008)  
	double                                             CentreFlareSize;                                            // 0x0408   (0x0008)  
	double                                             ReflectionBrightness;                                       // 0x0410   (0x0008)  
	double                                             ReflectionContrast;                                         // 0x0418   (0x0008)  
	FLinearColor                                       ReflectionColor;                                            // 0x0420   (0x0010)  
	UTexture*                                          ReflectionCentreTexture;                                    // 0x0430   (0x0008)  
	double                                             ReflectionSize;                                             // 0x0438   (0x0008)  
	double                                             FlareOpposite1_Brightness;                                  // 0x0440   (0x0008)  
	double                                             FlareOpposite1_Contrast;                                    // 0x0448   (0x0008)  
	double                                             FlareOppositeSize01;                                        // 0x0450   (0x0008)  
	FLinearColor                                       FlareOppositeColor01;                                       // 0x0458   (0x0010)  
	UTexture*                                          FlareOpposite01;                                            // 0x0468   (0x0008)  
	double                                             FlareOpposite2_Brightness;                                  // 0x0470   (0x0008)  
	double                                             FlareOpposite2_Contrast;                                    // 0x0478   (0x0008)  
	double                                             FlareOppositeSize02;                                        // 0x0480   (0x0008)  
	UTexture*                                          FlareOpposite02;                                            // 0x0488   (0x0008)  
	FLinearColor                                       FlareOppositeColor02;                                       // 0x0490   (0x0010)  
	double                                             OppositeFlaresAxisProjection;                               // 0x04A0   (0x0008)  
	double                                             FlareFrontBrightness01;                                     // 0x04A8   (0x0008)  
	double                                             FlareFrontContrast01;                                       // 0x04B0   (0x0008)  
	double                                             FlareFrontSize01;                                           // 0x04B8   (0x0008)  
	double                                             FlareFrontProximityCentre01;                                // 0x04C0   (0x0008)  
	FLinearColor                                       FlareFrontColor01;                                          // 0x04C8   (0x0010)  
	UTexture*                                          FlareFront01;                                               // 0x04D8   (0x0008)  
	double                                             FlareFrontBrightness02;                                     // 0x04E0   (0x0008)  
	double                                             FlareFrontContrast02;                                       // 0x04E8   (0x0008)  
	double                                             FlareFrontSize02;                                           // 0x04F0   (0x0008)  
	double                                             FlareFrontProximityCentre02;                                // 0x04F8   (0x0008)  
	FLinearColor                                       FlareFrontColor02;                                          // 0x0500   (0x0010)  
	UTexture*                                          FlareFront02;                                               // 0x0510   (0x0008)  
	double                                             FrontFlaresAxisProjection;                                  // 0x0518   (0x0008)  
	double                                             ReflectedFlareBrightness01;                                 // 0x0520   (0x0008)  
	double                                             ReflectedFlareContrast01;                                   // 0x0528   (0x0008)  
	double                                             ReflectedFlareSize01;                                       // 0x0530   (0x0008)  
	double                                             ReflectedFlareProximityCentre01;                            // 0x0538   (0x0008)  
	FLinearColor                                       ReflectedFlareColor01;                                      // 0x0540   (0x0010)  
	UTexture*                                          ReflectedFlare01;                                           // 0x0550   (0x0008)  
	double                                             ReflectedFlareBrightness02;                                 // 0x0558   (0x0008)  
	double                                             ReflectedFlareContrast02;                                   // 0x0560   (0x0008)  
	double                                             ReflectedFlareSize02;                                       // 0x0568   (0x0008)  
	double                                             ReflectedFlareProximityCentre02;                            // 0x0570   (0x0008)  
	FLinearColor                                       ReflectedFlareColor02;                                      // 0x0578   (0x0010)  
	UTexture*                                          ReflectedFlare02;                                           // 0x0588   (0x0008)  
	double                                             GlobalMinorFlareBrightness01;                               // 0x0590   (0x0008)  
	double                                             GlobalMinorFlareContrast01;                                 // 0x0598   (0x0008)  
	double                                             GlobalMinorFlareSize01;                                     // 0x05A0   (0x0008)  
	double                                             MinorFlareSizeRandom01;                                     // 0x05A8   (0x0008)  
	double                                             MinorFlareProximityCentre01;                                // 0x05B0   (0x0008)  
	FLinearColor                                       GlobalMinorFlareColor01;                                    // 0x05B8   (0x0010)  
	double                                             GlobalMinorFlareBrightness02;                               // 0x05C8   (0x0008)  
	double                                             GlobalMinorFlareContrast02;                                 // 0x05D0   (0x0008)  
	double                                             GlobalMinorFlareSize02;                                     // 0x05D8   (0x0008)  
	double                                             MinorFlareSizeRandom02;                                     // 0x05E0   (0x0008)  
	double                                             MinorFlareProximityCentre02;                                // 0x05E8   (0x0008)  
	FLinearColor                                       GlobalMinorFlareColor02;                                    // 0x05F0   (0x0010)  
	UTexture*                                          MinorFlare01;                                               // 0x0600   (0x0008)  
	double                                             Minor1_Contrast;                                            // 0x0608   (0x0008)  
	double                                             Minor1_Brightness;                                          // 0x0610   (0x0008)  
	UTexture*                                          MinorFlare02;                                               // 0x0618   (0x0008)  
	double                                             AdditionalFlareBrightness;                                  // 0x0620   (0x0008)  
	double                                             AdditionalFlareContrast;                                    // 0x0628   (0x0008)  
	double                                             AdditionalFlareSize;                                        // 0x0630   (0x0008)  
	FLinearColor                                       AdditionalFlareColor;                                       // 0x0638   (0x0010)  
	UTexture*                                          AdditionalFlare;                                            // 0x0648   (0x0008)  
	double                                             IrisBrightness;                                             // 0x0650   (0x0008)  
	double                                             IrisContrast;                                               // 0x0658   (0x0008)  
	double                                             IrisSize;                                                   // 0x0660   (0x0008)  
	double                                             IrisProximityCentre;                                        // 0x0668   (0x0008)  
	FLinearColor                                       IrisColor;                                                  // 0x0670   (0x0010)  
	UTexture*                                          Iris;                                                       // 0x0680   (0x0008)  
	double                                             Minor2_Contrast;                                            // 0x0688   (0x0008)  
	double                                             Minor2_Brightness;                                          // 0x0690   (0x0008)  
	UTexture*                                          MinorFlare03;                                               // 0x0698   (0x0008)  
	double                                             Minor3_Contrast;                                            // 0x06A0   (0x0008)  
	double                                             Minor3_Brightness;                                          // 0x06A8   (0x0008)  
	UTexture*                                          MinorFlare04;                                               // 0x06B0   (0x0008)  
	double                                             Minor4_Contrast;                                            // 0x06B8   (0x0008)  
	double                                             Minor4_Brightness;                                          // 0x06C0   (0x0008)  
	UTexture*                                          MinorFlare05;                                               // 0x06C8   (0x0008)  
	double                                             Minor5_Contrast;                                            // 0x06D0   (0x0008)  
	double                                             Minor5_Brightness;                                          // 0x06D8   (0x0008)  
	UTexture*                                          MinorFlare06;                                               // 0x06E0   (0x0008)  
	double                                             Minor6_Contrast;                                            // 0x06E8   (0x0008)  
	double                                             Minor6_Brightness;                                          // 0x06F0   (0x0008)  
	UTexture*                                          MinorFlare07;                                               // 0x06F8   (0x0008)  
	double                                             Minor7_Contrast;                                            // 0x0700   (0x0008)  
	double                                             Minor7_Brightness;                                          // 0x0708   (0x0008)  
	UTexture*                                          MinorFlare08;                                               // 0x0710   (0x0008)  
	double                                             Minor8_Contrast;                                            // 0x0718   (0x0008)  
	double                                             Minor8_Brightness;                                          // 0x0720   (0x0008)  
	ULevelSequence*                                    Scale_and_Brightness;                                       // 0x0728   (0x0008)  


	/// Functions
	// Function /Game/Custom_Lens_Flare_VFX/Blueprints/LensFlare_BP.LensFlare_BP_C.InitFlare
	void InitFlare();                                                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Custom_Lens_Flare_VFX/Blueprints/LensFlare_BP.LensFlare_BP_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x2407bf0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Custom_Lens_Flare_VFX/Blueprints/LensFlare_BP.LensFlare_BP_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Custom_Lens_Flare_VFX/Blueprints/LensFlare_BP.LensFlare_BP_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Custom_Lens_Flare_VFX/Blueprints/LensFlare_BP.LensFlare_BP_C.ExecuteUbergraph_LensFlare_BP
	void ExecuteUbergraph_LensFlare_BP(int32_t EntryPoint);                                                                  // [0x2407bf0] Final|HasDefaults    
};

