
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package Multiplayer.

/// Class /Game/Multiplayer/I_GI_Survival.I_GI_Survival_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UI_GI_Survival_C : public UInterface : UInterface
{ 
public:
};

/// Class /Game/Multiplayer/GI_Survival.GI_Survival_C
/// Size: 0x0318 (0x000218 - 0x000530)
class UGI_Survival_C : public USurvivalGameInstance : USurvivalGameInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0218   (0x0008)  
	TArray<UObject*>                                   PreLoadedTiles;                                             // 0x0220   (0x0010)  
	FString                                            PlayFabUserID;                                              // 0x0230   (0x0010)  
	FName                                              SpawnRegion;                                                // 0x0240   (0x0008)  
	bool                                               PendingTeleport;                                            // 0x0248   (0x0001)  
	bool                                               ServerAddress;                                              // 0x0249   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x024A   (0x0002)  MISSED
	int32_t                                            DeathCounter;                                               // 0x024C   (0x0004)  
	int32_t                                            CurrentQuestIndex;                                          // 0x0250   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0254   (0x0004)  MISSED
	FFMODEventInstance                                 LoadingScreenAmbient;                                       // 0x0258   (0x0008)  
	USG_Tutorial_C*                                    CurrentTutorialSaveSlot;                                    // 0x0260   (0x0008)  
	bool                                               bIsAfterMenu;                                               // 0x0268   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0269   (0x0003)  MISSED
	FQualifiedFrameTime                                LoadingScreenTime;                                          // 0x026C   (0x0010)  
	int32_t                                            ShadowsQuality;                                             // 0x027C   (0x0004)  
	int32_t                                            TexturesQuality;                                            // 0x0280   (0x0004)  
	int32_t                                            PostProcessQuality;                                         // 0x0284   (0x0004)  
	int32_t                                            AntiAliacingQuality;                                        // 0x0288   (0x0004)  
	int32_t                                            ShadingQuality;                                             // 0x028C   (0x0004)  
	int32_t                                            EffectsQuality;                                             // 0x0290   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x0294   (0x0004)  MISSED
	UGameSettings_C*                                   GameSettings;                                               // 0x0298   (0x0008)  
	UCharacterCreateSave_C*                            GI_CharacterSaveRef;                                        // 0x02A0   (0x0008)  
	bool                                               CharactedCreated;                                           // 0x02A8   (0x0001)  
	unsigned char                                      UnknownData04_5[0x7];                                       // 0x02A9   (0x0007)  MISSED
	UPostProcessComponent*                             PlayerPPV;                                                  // 0x02B0   (0x0008)  
	double                                             LensIntensityDefault;                                       // 0x02B8   (0x0008)  
	TSet<UQuest*>                                      NPCQuests;                                                  // 0x02C0   (0x0050)  
	bool                                               InHub;                                                      // 0x0310   (0x0001)  
	unsigned char                                      UnknownData05_5[0x7];                                       // 0x0311   (0x0007)  MISSED
	TSet<UQuest*>                                      SpecQuests;                                                 // 0x0318   (0x0050)  
	UPerkTestSave_C*                                   PerkSaveRef;                                                // 0x0368   (0x0008)  
	bool                                               IsNewCharacter;                                             // 0x0370   (0x0001)  
	bool                                               bDisclaimerShowed;                                          // 0x0371   (0x0001)  
	bool                                               bEnableVoiceLines;                                          // 0x0372   (0x0001)  
	bool                                               bEnableTextChat;                                            // 0x0373   (0x0001)  
	bool                                               bEnableVoiceChat;                                           // 0x0374   (0x0001)  
	unsigned char                                      UnknownData06_5[0x3];                                       // 0x0375   (0x0003)  MISSED
	FString                                            ConnectionErrorText;                                        // 0x0378   (0x0010)  
	bool                                               bConnectAttempt;                                            // 0x0388   (0x0001)  
	unsigned char                                      UnknownData07_5[0x7];                                       // 0x0389   (0x0007)  MISSED
	USG_Dialogue_C*                                    As_SG_Dialogue;                                             // 0x0390   (0x0008)  
	TArray<FString>                                    TDBSERVERCREDENTIALS;                                       // 0x0398   (0x0010)  
	FString                                            VoiceCulture;                                               // 0x03A8   (0x0010)  
	float                                              MouseSensitivity;                                           // 0x03B8   (0x0004)  
	bool                                               MouseInverse;                                               // 0x03BC   (0x0001)  
	unsigned char                                      UnknownData08_5[0x3];                                       // 0x03BD   (0x0003)  MISSED
	USavePrivacyPolicy_C*                              PrivacyPolicySaveRef;                                       // 0x03C0   (0x0008)  
	bool                                               bNeedTutorReset;                                            // 0x03C8   (0x0001)  
	bool                                               NewCharacterCreated;                                        // 0x03C9   (0x0001)  
	unsigned char                                      UnknownData09_5[0x6];                                       // 0x03CA   (0x0006)  MISSED
	UDatabaseReference*                                DatabaseServerListReference;                                // 0x03D0   (0x0008)  
	TMap<FString, FString>                             NewServers;                                                 // 0x03D8   (0x0050)  
	TMap<FString, FString>                             Servers;                                                    // 0x0428   (0x0050)  
	FMulticastInlineDelegate                           ServerListReady;                                            // 0x0478   (0x0010)  
	FTimerHandle                                       LoadLevelTimerHandle;                                       // 0x0488   (0x0008)  
	bool                                               bMovieShowed;                                               // 0x0490   (0x0001)  
	TEnumAsByte<Enum_WarningMessageType>               Type_Message;                                               // 0x0491   (0x0001)  
	unsigned char                                      UnknownData10_5[0x6];                                       // 0x0492   (0x0006)  MISSED
	FText                                              Description_Text;                                           // 0x0498   (0x0018)  
	bool                                               New_State;                                                  // 0x04B0   (0x0001)  
	bool                                               bKickedFromAFK;                                             // 0x04B1   (0x0001)  
	bool                                               Agones;                                                     // 0x04B2   (0x0001)  
	unsigned char                                      UnknownData11_5[0x5];                                       // 0x04B3   (0x0005)  MISSED
	FString                                            CurrentServerList;                                          // 0x04B8   (0x0010)  
	UFirestoreQuery*                                   CurrentQuery;                                               // 0x04C8   (0x0008)  
	FString                                            WarningMessageTime;                                         // 0x04D0   (0x0010)  
	FString                                            GameVersion;                                                // 0x04E0   (0x0010)  
	bool                                               ResolutionFix;                                              // 0x04F0   (0x0001)  
	unsigned char                                      UnknownData12_5[0x7];                                       // 0x04F1   (0x0007)  MISSED
	UUser*                                             User;                                                       // 0x04F8   (0x0008)  
	FMulticastInlineDelegate                           OnCharacterLoaded;                                          // 0x0500   (0x0010)  
	double                                             RenderScale;                                                // 0x0510   (0x0008)  
	bool                                               WasCreated_;                                                // 0x0518   (0x0001)  
	unsigned char                                      UnknownData13_5[0x7];                                       // 0x0519   (0x0007)  MISSED
	FString                                            Server;                                                     // 0x0520   (0x0010)  


	/// Functions
	// Function /Game/Multiplayer/GI_Survival.GI_Survival_C.GetKickedFromAFK
	void GetKickedFromAFK(bool& OutKickedFromAFK);                                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Multiplayer/GI_Survival.GI_Survival_C.GetWarningMessage
	void GetWarningMessage(TEnumAsByte<Enum_WarningMessageType>& Type Message, FText& Description Text, FString& Time, bool& New State); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Multiplayer/GI_Survival.GI_Survival_C.GetMovieShowed
	void GetMovieShowed(bool& Showed);                                                                                       // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
