
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package SurvAnimator.

/// Struct /Game/SurvAnimator/New_Character/HUB/RoundedSofa/Menu/ABP_Bar_Menu_Rig_Skeleton.ABP_Bar_Menu_Rig_Skeleton_C.AnimBlueprintGeneratedConstantData
/// Size: 0x010F (0x000001 - 0x000110)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0010   (0x0020)  
	bool                                               __BoolProperty;                                             // 0x0030   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0034   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0038   (0x002C)  
	float                                              __FloatProperty;                                            // 0x0064   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0068   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0069   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x006A   (0x0001)  
	unsigned char                                      UnknownData03_5[0x1];                                       // 0x006B   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x006C   (0x0008)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x0074   (0x0004)  MISSED
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0078   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00F8   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.AnimBlueprintGeneratedConstantData
/// Size: 0x019F (0x000001 - 0x0001A0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_6[0x18C];                                     // 0x0014   (0x018C)  MISSED
};

/// Struct /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.AnimBlueprintGeneratedMutableData
/// Size: 0x001D (0x000001 - 0x00001E)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0004   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0008   (0x0004)  
	char                                               __ByteProperty;                                             // 0x000C   (0x0001)  
	char                                               __ByteProperty;                                             // 0x000D   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x000E   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0010   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0014   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0018   (0x0004)  
	char                                               __ByteProperty;                                             // 0x001C   (0x0001)  
	char                                               __ByteProperty;                                             // 0x001D   (0x0001)  
};

/// Struct /Game/SurvAnimator/FP/Skeletal_Mesh/ABP_Surv_FP.ABP_Surv_FP_C.AnimBlueprintGeneratedConstantData
/// Size: 0x021F (0x000001 - 0x000220)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0008   (0x0020)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0028   (0x0010)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0038   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0039   (0x0007)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0040   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0050   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0058   (0x0004)  
	FName                                              __NameProperty;                                             // 0x005C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0064   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0068   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0070   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0074   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x007C   (0x0004)  
	TEnumAsByte<ESequenceEvalReinit>                   __ByteProperty;                                             // 0x0080   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0081   (0x0007)  MISSED
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0088   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0090   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0098   (0x0004)  
	float                                              __FloatProperty;                                            // 0x009C   (0x0004)  
	FName                                              __NameProperty;                                             // 0x00A0   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x00A8   (0x0004)  
	FName                                              __NameProperty;                                             // 0x00AC   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x00B4   (0x0004)  
	FName                                              __NameProperty;                                             // 0x00B8   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x00C0   (0x0004)  
	FName                                              __NameProperty;                                             // 0x00C4   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x00CC   (0x0004)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x00D0   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x00D8   (0x0010)  
	UBlendProfile*                                     __BlendProfile;                                             // 0x00E8   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x00F0   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x00F8   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x00F9   (0x0001)  
	unsigned char                                      UnknownData03_5[0x6];                                       // 0x00FA   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0100   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0110   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0111   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0114   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0118   (0x002C)  
	float                                              __FloatProperty;                                            // 0x0144   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0148   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0149   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x014A   (0x0001)  
	unsigned char                                      UnknownData05_5[0x1];                                       // 0x014B   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x014C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0154   (0x0004)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0158   (0x0020)  
	FName                                              __NameProperty;                                             // 0x0178   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0180   (0x0008)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0188   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0208   (0x0018)  
};

/// Struct /Game/SurvAnimator/FP/Skeletal_Mesh/ABP_Surv_FP.ABP_Surv_FP_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0034 (0x000001 - 0x000035)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0008   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0010   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0011   (0x0007)  MISSED
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0018   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0020   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0030   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0031   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0032   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0033   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0034   (0x0001)  
};

/// Struct /Game/SurvAnimator/Trader/Trader_Body_Skeleton_AnimBlueprint.Trader_Body_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0147 (0x000001 - 0x000148)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0002   (0x0002)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x000C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0010   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0014   (0x002C)  
	float                                              __FloatProperty;                                            // 0x0040   (0x0004)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0044   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x0045   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x0046   (0x0002)  MISSED
	FName                                              __NameProperty;                                             // 0x0048   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0050   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0054   (0x0004)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0058   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0060   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0068   (0x0001)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0069   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x006A   (0x0001)  
	unsigned char                                      UnknownData03_5[0x5];                                       // 0x006B   (0x0005)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0070   (0x0010)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0080   (0x0020)  
	FName                                              __NameProperty;                                             // 0x00A0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00A8   (0x0008)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00B0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0130   (0x0018)  
};

/// Struct /Game/SurvAnimator/Trader/Trader_Body_Skeleton_AnimBlueprint.Trader_Body_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
};

/// Struct /Game/SurvAnimator/Trader/Head_Traider_Skeleton_AnimBlueprint.Head_Traider_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0107 (0x000001 - 0x000108)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0002   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0004   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0008   (0x002C)  
	float                                              __FloatProperty;                                            // 0x0034   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0038   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0039   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x003A   (0x0001)  
	unsigned char                                      UnknownData01_5[0x5];                                       // 0x003B   (0x0005)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0040   (0x0020)  
	FName                                              __NameProperty;                                             // 0x0060   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0068   (0x0008)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0070   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00F0   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/Curves/DirectionVelocityBlend.DirectionVelocityBlend
/// Size: 0x0020 (0x000000 - 0x000020)
struct FDirectionVelocityBlend
{ 
	double                                             F_2_FFD06F8A43E85C606FD49ABD8067F0F0;                       // 0x0000   (0x0008)  
	double                                             B_4_301F82534F5257F0BBA22191AACCB639;                       // 0x0008   (0x0008)  
	double                                             R_18_B362F63D4E4E2ACA029693B7261EA4B4;                      // 0x0010   (0x0008)  
	double                                             L_19_D351CE13413D55EB72F90385BE6735E5;                      // 0x0018   (0x0008)  
};

/// Struct /Game/SurvAnimator/New_Character/SurviveLocomotion.SurviveLocomotion_C.AnimBlueprintGeneratedConstantData
/// Size: 0x049F (0x000001 - 0x0004A0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0004   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0008   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0010   (0x0004)  
	int32_t                                            __IntProperty;                                              // 0x0014   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0018   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0020   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0028   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0030   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0038   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0040   (0x0010)  
	TEnumAsByte<ESequenceEvalReinit>                   __ByteProperty;                                             // 0x0050   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0051   (0x0007)  MISSED
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0058   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0060   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0070   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0078   (0x0008)  
	float                                              __FloatProperty;                                            // 0x0080   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0084   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0088   (0x0004)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x008C   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x008D   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0090   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0094   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0098   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x009C   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x00A0   (0x0010)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x00B0   (0x0020)  
	FName                                              __NameProperty;                                             // 0x00D0   (0x0008)  
	float                                              __FloatProperty;                                            // 0x00D8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00DC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00E0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00E4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00E8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00EC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00F0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00F4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00F8   (0x0004)  
	FName                                              __NameProperty;                                             // 0x00FC   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0104   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0108   (0x0004)  
	FName                                              __NameProperty;                                             // 0x010C   (0x0008)  
	float                                              __FloatProperty;                                            // 0x0114   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0118   (0x0004)  
	FName                                              __NameProperty;                                             // 0x011C   (0x0008)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x0124   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0128   (0x0010)  
	float                                              __FloatProperty;                                            // 0x0138   (0x0004)  
	FName                                              __NameProperty;                                             // 0x013C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0144   (0x0008)  
	FName                                              __NameProperty;                                             // 0x014C   (0x0008)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x0154   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0158   (0x0020)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0178   (0x0001)  
	unsigned char                                      UnknownData06_5[0x7];                                       // 0x0179   (0x0007)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0180   (0x0010)  
	float                                              __FloatProperty;                                            // 0x0190   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0194   (0x0008)  
	unsigned char                                      UnknownData07_5[0x4];                                       // 0x019C   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x01A0   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x01B0   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x01C0   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x01D0   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x01E0   (0x0010)  
	FName                                              __NameProperty;                                             // 0x01F0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01F8   (0x0008)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0200   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0210   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0218   (0x0004)  
	float                                              __FloatProperty;                                            // 0x021C   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0220   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0228   (0x0004)  
	unsigned char                                      UnknownData08_5[0x4];                                       // 0x022C   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0230   (0x0010)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0240   (0x0001)  
	unsigned char                                      UnknownData09_5[0x3];                                       // 0x0241   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0244   (0x0008)  
	unsigned char                                      UnknownData10_5[0x4];                                       // 0x024C   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0250   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0260   (0x0008)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0268   (0x0020)  
	FName                                              __NameProperty;                                             // 0x0288   (0x0008)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0290   (0x0020)  
	TArray<float>                                      __ArrayProperty;                                            // 0x02B0   (0x0010)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x02C0   (0x0001)  
	unsigned char                                      UnknownData11_5[0x7];                                       // 0x02C1   (0x0007)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x02C8   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x02D8   (0x0010)  
	FName                                              __NameProperty;                                             // 0x02E8   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x02F0   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0300   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0310   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0320   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0328   (0x0004)  
	unsigned char                                      UnknownData12_5[0x4];                                       // 0x032C   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0330   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0340   (0x0010)  
	UBlendProfile*                                     __BlendProfile;                                             // 0x0350   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0358   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0360   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x0361   (0x0001)  
	unsigned char                                      UnknownData13_5[0x6];                                       // 0x0362   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0368   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0378   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0388   (0x0001)  
	unsigned char                                      UnknownData14_5[0x3];                                       // 0x0389   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x038C   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0390   (0x002C)  
	float                                              __FloatProperty;                                            // 0x03BC   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x03C0   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x03C1   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x03C2   (0x0001)  
	unsigned char                                      UnknownData15_5[0x1];                                       // 0x03C3   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x03C4   (0x0008)  
	FName                                              __NameProperty;                                             // 0x03CC   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x03D4   (0x0004)  
	FName                                              __NameProperty;                                             // 0x03D8   (0x0008)  
	FName                                              __NameProperty;                                             // 0x03E0   (0x0008)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x03E8   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0408   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0488   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/SurviveLocomotion.SurviveLocomotion_C.AnimBlueprintGeneratedMutableData
/// Size: 0x01D8 (0x000001 - 0x0001D9)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0002   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0003   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0004   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0005   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0006   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0008   (0x0004)  
	float                                              __FloatProperty;                                            // 0x000C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0010   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0014   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0018   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x001C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x001D   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0020   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0024   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0025   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0028   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x002C   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x002D   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0030   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0034   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0035   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0038   (0x0004)  
	float                                              __FloatProperty;                                            // 0x003C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0040   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0044   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0045   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0046   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0047   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0048   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0049   (0x0001)  
	char                                               __ByteProperty;                                             // 0x004A   (0x0001)  
	unsigned char                                      UnknownData05_5[0x1];                                       // 0x004B   (0x0001)  MISSED
	float                                              __FloatProperty;                                            // 0x004C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0050   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0054   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0058   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0059   (0x0001)  
	unsigned char                                      UnknownData06_5[0x2];                                       // 0x005A   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x005C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0060   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0064   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0068   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0069   (0x0001)  
	char                                               __ByteProperty;                                             // 0x006A   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x006B   (0x0001)  
	char                                               __ByteProperty;                                             // 0x006C   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x006D   (0x0001)  
	char                                               __ByteProperty;                                             // 0x006E   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x006F   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0070   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0071   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0072   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0073   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0074   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0075   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0076   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0077   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0078   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0079   (0x0001)  
	char                                               __ByteProperty;                                             // 0x007A   (0x0001)  
	char                                               __ByteProperty;                                             // 0x007B   (0x0001)  
	char                                               __ByteProperty;                                             // 0x007C   (0x0001)  
	char                                               __ByteProperty;                                             // 0x007D   (0x0001)  
	char                                               __ByteProperty;                                             // 0x007E   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x007F   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0080   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0081   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0082   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0083   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0084   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0085   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0086   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0087   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0088   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0089   (0x0001)  
	char                                               __ByteProperty;                                             // 0x008A   (0x0001)  
	char                                               __ByteProperty;                                             // 0x008B   (0x0001)  
	float                                              __FloatProperty;                                            // 0x008C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0090   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0094   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0098   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x009C   (0x0001)  
	char                                               __ByteProperty;                                             // 0x009D   (0x0001)  
	unsigned char                                      UnknownData07_5[0x2];                                       // 0x009E   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x00A0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00A4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00A8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00AC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00B0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00B4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00B8   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x00BC   (0x0001)  
	unsigned char                                      UnknownData08_5[0x3];                                       // 0x00BD   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x00C0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00C4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00C8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00CC   (0x0004)  
	char                                               __ByteProperty;                                             // 0x00D0   (0x0001)  
	unsigned char                                      UnknownData09_5[0x3];                                       // 0x00D1   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x00D4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00D8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00DC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00E0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00E4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00E8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00EC   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x00F0   (0x0001)  
	unsigned char                                      UnknownData10_5[0x3];                                       // 0x00F1   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x00F4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00F8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00FC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0100   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0104   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0108   (0x0004)  
	float                                              __FloatProperty;                                            // 0x010C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0110   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0114   (0x0001)  
	unsigned char                                      UnknownData11_5[0x3];                                       // 0x0115   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0118   (0x0004)  
	float                                              __FloatProperty;                                            // 0x011C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0120   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0124   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0125   (0x0001)  
	unsigned char                                      UnknownData12_5[0x2];                                       // 0x0126   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0128   (0x0004)  
	float                                              __FloatProperty;                                            // 0x012C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0130   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0134   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0138   (0x0004)  
	float                                              __FloatProperty;                                            // 0x013C   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0140   (0x0001)  
	unsigned char                                      UnknownData13_5[0x3];                                       // 0x0141   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0144   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0148   (0x0004)  
	float                                              __FloatProperty;                                            // 0x014C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0150   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0154   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0158   (0x0004)  
	float                                              __FloatProperty;                                            // 0x015C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0160   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0164   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0168   (0x0004)  
	float                                              __FloatProperty;                                            // 0x016C   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0170   (0x0001)  
	unsigned char                                      UnknownData14_5[0x3];                                       // 0x0171   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0174   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0178   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x017C   (0x0001)  
	unsigned char                                      UnknownData15_5[0x3];                                       // 0x017D   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0180   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0184   (0x0001)  
	unsigned char                                      UnknownData16_5[0x3];                                       // 0x0185   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0188   (0x0004)  
	float                                              __FloatProperty;                                            // 0x018C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0190   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0194   (0x0001)  
	unsigned char                                      UnknownData17_5[0x3];                                       // 0x0195   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0198   (0x0004)  
	float                                              __FloatProperty;                                            // 0x019C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01A0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01A4   (0x0004)  
	char                                               __ByteProperty;                                             // 0x01A8   (0x0001)  
	unsigned char                                      UnknownData18_5[0x3];                                       // 0x01A9   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x01AC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01B0   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x01B4   (0x0001)  
	unsigned char                                      UnknownData19_5[0x3];                                       // 0x01B5   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x01B8   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x01BC   (0x0001)  
	unsigned char                                      UnknownData20_5[0x3];                                       // 0x01BD   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x01C0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01C4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01C8   (0x0004)  
	char                                               __ByteProperty;                                             // 0x01CC   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01CD   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01CE   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01CF   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01D0   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01D1   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01D2   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01D3   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01D4   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01D5   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01D6   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01D7   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01D8   (0x0001)  
};

/// Struct /Game/SurvAnimator/New_Character/SurviveLocomotion_Fem.SurviveLocomotion_Fem_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0000 (0x0004A0 - 0x0004A0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintGeneratedConstantData
{ 
};

/// Struct /Game/SurvAnimator/New_Character/SurviveAnimator2.SurviveAnimator2_C.AnimBlueprintGeneratedConstantData
/// Size: 0x07EF (0x000001 - 0x0007F0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0010   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0018   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0020   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0028   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0038   (0x0010)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0048   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0050   (0x0010)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0060   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0068   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0070   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0078   (0x0008)  
	UBlendProfile*                                     __BlendProfile;                                             // 0x0080   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0088   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0098   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00A0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00A8   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00B0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00B8   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00C0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00C8   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00D0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00D8   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00E0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00E8   (0x0008)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x00F0   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0100   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0108   (0x0004)  
	FName                                              __NameProperty;                                             // 0x010C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0114   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0118   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0120   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0124   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0128   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0138   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0148   (0x0010)  
	int32_t                                            __IntProperty;                                              // 0x0158   (0x0004)  
	FName                                              __NameProperty;                                             // 0x015C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0164   (0x0008)  
	FName                                              __NameProperty;                                             // 0x016C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0174   (0x0008)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x017C   (0x0004)  MISSED
	TArray<None>                                       __ArrayProperty;                                            // 0x0180   (0x0010)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0190   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0191   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0194   (0x0008)  
	FName                                              __NameProperty;                                             // 0x019C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01A4   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01AC   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01B4   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01BC   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01C4   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01CC   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01D4   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01DC   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01E4   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01EC   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01F4   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01FC   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0204   (0x0008)  
	FName                                              __NameProperty;                                             // 0x020C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0214   (0x0008)  
	FName                                              __NameProperty;                                             // 0x021C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0224   (0x0008)  
	FName                                              __NameProperty;                                             // 0x022C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0234   (0x0008)  
	FName                                              __NameProperty;                                             // 0x023C   (0x0008)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x0244   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0248   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0258   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0268   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0278   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0280   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0288   (0x0008)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0290   (0x0020)  
	FName                                              __NameProperty;                                             // 0x02B0   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x02B8   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x02C8   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x02D8   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x02E8   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x02F8   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0308   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0318   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0328   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0338   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0348   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0358   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0360   (0x0010)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0370   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0378   (0x0001)  
	unsigned char                                      UnknownData06_5[0x7];                                       // 0x0379   (0x0007)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0380   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0390   (0x0008)  
	float                                              __FloatProperty;                                            // 0x0398   (0x0004)  
	unsigned char                                      UnknownData07_5[0x4];                                       // 0x039C   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x03A0   (0x0010)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x03B0   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x03B8   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x03C8   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x03D8   (0x0010)  
	TEnumAsByte<ESequenceEvalReinit>                   __ByteProperty;                                             // 0x03E8   (0x0001)  
	unsigned char                                      UnknownData08_5[0x7];                                       // 0x03E9   (0x0007)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x03F0   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0400   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0410   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0418   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0428   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0430   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0438   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0448   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0450   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0458   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0468   (0x0008)  
	float                                              __FloatProperty;                                            // 0x0470   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0474   (0x0008)  
	FName                                              __NameProperty;                                             // 0x047C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0484   (0x0008)  
	FName                                              __NameProperty;                                             // 0x048C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0494   (0x0008)  
	unsigned char                                      UnknownData09_5[0x4];                                       // 0x049C   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x04A0   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x04B0   (0x0010)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x04C0   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x04C1   (0x0001)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x04C2   (0x0001)  
	unsigned char                                      UnknownData10_5[0x5];                                       // 0x04C3   (0x0005)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x04C8   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x04D8   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x04E8   (0x0010)  
	FName                                              __NameProperty;                                             // 0x04F8   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0500   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0504   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x050C   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0510   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0518   (0x0004)  
	unsigned char                                      UnknownData11_5[0x4];                                       // 0x051C   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0520   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0530   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0540   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0550   (0x0010)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0560   (0x0020)  
	FName                                              __NameProperty;                                             // 0x0580   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0588   (0x0004)  
	FName                                              __NameProperty;                                             // 0x058C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0594   (0x0004)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0598   (0x0020)  
	FName                                              __NameProperty;                                             // 0x05B8   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x05C0   (0x0004)  
	unsigned char                                      UnknownData12_5[0x4];                                       // 0x05C4   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x05C8   (0x0010)  
	FName                                              __NameProperty;                                             // 0x05D8   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x05E0   (0x0004)  
	unsigned char                                      UnknownData13_5[0x4];                                       // 0x05E4   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x05E8   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x05F8   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0608   (0x0008)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0610   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0620   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0630   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0640   (0x0010)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0650   (0x002C)  
	unsigned char                                      UnknownData14_5[0x4];                                       // 0x067C   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0680   (0x0010)  
	UBlendProfile*                                     __BlendProfile;                                             // 0x0690   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0698   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x06A0   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x06A1   (0x0001)  
	unsigned char                                      UnknownData15_5[0x6];                                       // 0x06A2   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x06A8   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x06B8   (0x0001)  
	unsigned char                                      UnknownData16_5[0x3];                                       // 0x06B9   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x06BC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x06C0   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x06C4   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x06C5   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x06C6   (0x0001)  
	unsigned char                                      UnknownData17_5[0x1];                                       // 0x06C7   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x06C8   (0x0008)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x06D0   (0x0020)  
	FAnimSubsystem_Tag                                 AnimBlueprintExtension_Tag;                                 // 0x06F0   (0x0060)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0750   (0x0080)  
	FAnimSubsystem                                     AnimBlueprintExtension_NodeRelevancy;                       // 0x07D0   (0x0008)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x07D8   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/SurviveAnimator2.SurviveAnimator2_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0357 (0x000001 - 0x000358)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0008   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0010   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0018   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0020   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0028   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0030   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0038   (0x0008)  
	float                                              __FloatProperty;                                            // 0x0040   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0044   (0x0004)  MISSED
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0048   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0050   (0x0008)  
	float                                              __FloatProperty;                                            // 0x0058   (0x0004)  
	float                                              __FloatProperty;                                            // 0x005C   (0x0004)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0060   (0x0008)  
	float                                              __FloatProperty;                                            // 0x0068   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x006C   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x006D   (0x0001)  
	char                                               __ByteProperty;                                             // 0x006E   (0x0001)  
	char                                               __ByteProperty;                                             // 0x006F   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0070   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0071   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0072   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0073   (0x0001)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0074   (0x0004)  MISSED
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0078   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0080   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0081   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0082   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0083   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0084   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0085   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0086   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0087   (0x0001)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0088   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0090   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0098   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x00A0   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x00A8   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x00B0   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x00B8   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x00C0   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x00C8   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x00D0   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x00D1   (0x0007)  MISSED
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x00D8   (0x0008)  
	char                                               __ByteProperty;                                             // 0x00E0   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x00E1   (0x0001)  
	char                                               __ByteProperty;                                             // 0x00E2   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x00E3   (0x0001)  
	float                                              __FloatProperty;                                            // 0x00E4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00E8   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x00EC   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x00ED   (0x0001)  
	unsigned char                                      UnknownData04_5[0x2];                                       // 0x00EE   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x00F0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00F4   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x00F8   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x00F9   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x00FC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0100   (0x0004)  
	unsigned char                                      UnknownData06_5[0x4];                                       // 0x0104   (0x0004)  MISSED
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0108   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0110   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0118   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0120   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0128   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0129   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x012A   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x012B   (0x0001)  
	unsigned char                                      UnknownData07_5[0x4];                                       // 0x012C   (0x0004)  MISSED
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0130   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0138   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0140   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0141   (0x0001)  
	unsigned char                                      UnknownData08_5[0x6];                                       // 0x0142   (0x0006)  MISSED
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0148   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0150   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0158   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0159   (0x0001)  
	char                                               __ByteProperty;                                             // 0x015A   (0x0001)  
	unsigned char                                      UnknownData09_5[0x1];                                       // 0x015B   (0x0001)  MISSED
	float                                              __FloatProperty;                                            // 0x015C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0160   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0164   (0x0001)  
	unsigned char                                      UnknownData10_5[0x3];                                       // 0x0165   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0168   (0x0004)  
	float                                              __FloatProperty;                                            // 0x016C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0170   (0x0001)  
	unsigned char                                      UnknownData11_5[0x3];                                       // 0x0171   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0174   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0178   (0x0004)  
	char                                               __ByteProperty;                                             // 0x017C   (0x0001)  
	char                                               __ByteProperty;                                             // 0x017D   (0x0001)  
	char                                               __ByteProperty;                                             // 0x017E   (0x0001)  
	char                                               __ByteProperty;                                             // 0x017F   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0180   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0181   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0182   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0183   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0184   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0185   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0186   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0187   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0188   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0189   (0x0001)  
	char                                               __ByteProperty;                                             // 0x018A   (0x0001)  
	char                                               __ByteProperty;                                             // 0x018B   (0x0001)  
	char                                               __ByteProperty;                                             // 0x018C   (0x0001)  
	char                                               __ByteProperty;                                             // 0x018D   (0x0001)  
	char                                               __ByteProperty;                                             // 0x018E   (0x0001)  
	char                                               __ByteProperty;                                             // 0x018F   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0190   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0191   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0192   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0193   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0194   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0195   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0196   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0197   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0198   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0199   (0x0001)  
	char                                               __ByteProperty;                                             // 0x019A   (0x0001)  
	char                                               __ByteProperty;                                             // 0x019B   (0x0001)  
	char                                               __ByteProperty;                                             // 0x019C   (0x0001)  
	char                                               __ByteProperty;                                             // 0x019D   (0x0001)  
	char                                               __ByteProperty;                                             // 0x019E   (0x0001)  
	char                                               __ByteProperty;                                             // 0x019F   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01A0   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01A1   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01A2   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01A3   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01A4   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01A5   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01A6   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01A7   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01A8   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01A9   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01AA   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01AB   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01AC   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01AD   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01AE   (0x0001)  
	unsigned char                                      UnknownData12_5[0x1];                                       // 0x01AF   (0x0001)  MISSED
	float                                              __FloatProperty;                                            // 0x01B0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01B4   (0x0004)  
	char                                               __ByteProperty;                                             // 0x01B8   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01B9   (0x0001)  
	unsigned char                                      UnknownData13_5[0x6];                                       // 0x01BA   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x01C0   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x01D0   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01D1   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01D2   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01D3   (0x0001)  
	float                                              __FloatProperty;                                            // 0x01D4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01D8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01DC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01E0   (0x0004)  
	char                                               __ByteProperty;                                             // 0x01E4   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01E5   (0x0001)  
	unsigned char                                      UnknownData14_5[0x2];                                       // 0x01E6   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x01E8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01EC   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x01F0   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01F1   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01F2   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01F3   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01F4   (0x0001)  
	char                                               __ByteProperty;                                             // 0x01F5   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01F6   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01F7   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01F8   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x01F9   (0x0001)  
	unsigned char                                      UnknownData15_5[0x2];                                       // 0x01FA   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x01FC   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0200   (0x0001)  
	unsigned char                                      UnknownData16_5[0x3];                                       // 0x0201   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0204   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0208   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x020C   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x020D   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x020E   (0x0001)  
	char                                               __ByteProperty;                                             // 0x020F   (0x0001)  
	float                                              __FloatProperty;                                            // 0x0210   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0214   (0x0001)  
	unsigned char                                      UnknownData17_5[0x3];                                       // 0x0215   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0218   (0x0004)  
	float                                              __FloatProperty;                                            // 0x021C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0220   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0221   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0222   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0223   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0224   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0225   (0x0001)  
	unsigned char                                      UnknownData18_5[0x2];                                       // 0x0226   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0228   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x022C   (0x0001)  
	unsigned char                                      UnknownData19_5[0x3];                                       // 0x022D   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0230   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0234   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0235   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0236   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0237   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0238   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0239   (0x0001)  
	unsigned char                                      UnknownData20_5[0x6];                                       // 0x023A   (0x0006)  MISSED
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0240   (0x0008)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x0248   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0250   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0251   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0252   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0253   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0254   (0x0001)  
	unsigned char                                      UnknownData21_5[0x3];                                       // 0x0255   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0258   (0x0004)  
	float                                              __FloatProperty;                                            // 0x025C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0260   (0x0001)  
	unsigned char                                      UnknownData22_5[0x3];                                       // 0x0261   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0264   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0268   (0x0004)  
	char                                               __ByteProperty;                                             // 0x026C   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x026D   (0x0001)  
	char                                               __ByteProperty;                                             // 0x026E   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x026F   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0270   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0271   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0272   (0x0001)  
	unsigned char                                      UnknownData23_5[0x1];                                       // 0x0273   (0x0001)  MISSED
	float                                              __FloatProperty;                                            // 0x0274   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0278   (0x0001)  
	unsigned char                                      UnknownData24_5[0x3];                                       // 0x0279   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x027C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0280   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0284   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0285   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0286   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0287   (0x0001)  
	int32_t                                            __IntProperty;                                              // 0x0288   (0x0004)  
	float                                              __FloatProperty;                                            // 0x028C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0290   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0294   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0298   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0299   (0x0001)  
	char                                               __ByteProperty;                                             // 0x029A   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x029B   (0x0001)  
	float                                              __FloatProperty;                                            // 0x029C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02A0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02A4   (0x0004)  
	char                                               __ByteProperty;                                             // 0x02A8   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02A9   (0x0001)  
	unsigned char                                      UnknownData25_5[0x2];                                       // 0x02AA   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x02AC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02B0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02B4   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x02B8   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02B9   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02BA   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02BB   (0x0001)  
	float                                              __FloatProperty;                                            // 0x02BC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02C0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02C4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02C8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02CC   (0x0004)  
	char                                               __ByteProperty;                                             // 0x02D0   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02D1   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02D2   (0x0001)  
	unsigned char                                      UnknownData26_5[0x1];                                       // 0x02D3   (0x0001)  MISSED
	float                                              __FloatProperty;                                            // 0x02D4   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x02D8   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02D9   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02DA   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02DB   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02DC   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02DD   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02DE   (0x0001)  
	unsigned char                                      UnknownData27_5[0x1];                                       // 0x02DF   (0x0001)  MISSED
	float                                              __FloatProperty;                                            // 0x02E0   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x02E4   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02E5   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02E6   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02E7   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02E8   (0x0001)  
	unsigned char                                      UnknownData28_5[0x3];                                       // 0x02E9   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x02EC   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x02F0   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02F1   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02F2   (0x0001)  
	unsigned char                                      UnknownData29_5[0x1];                                       // 0x02F3   (0x0001)  MISSED
	int32_t                                            __IntProperty;                                              // 0x02F4   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x02F8   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02F9   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02FA   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02FB   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02FC   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02FD   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02FE   (0x0001)  
	unsigned char                                      UnknownData30_5[0x1];                                       // 0x02FF   (0x0001)  MISSED
	int32_t                                            __IntProperty;                                              // 0x0300   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0304   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0305   (0x0001)  
	unsigned char                                      UnknownData31_5[0x2];                                       // 0x0306   (0x0002)  MISSED
	int32_t                                            __IntProperty;                                              // 0x0308   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x030C   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x030D   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x030E   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x030F   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0310   (0x0001)  
	unsigned char                                      UnknownData32_5[0x3];                                       // 0x0311   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0314   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0318   (0x0004)  
	float                                              __FloatProperty;                                            // 0x031C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0320   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0324   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0328   (0x0004)  
	float                                              __FloatProperty;                                            // 0x032C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0330   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0334   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0338   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x033C   (0x0001)  
	unsigned char                                      UnknownData33_5[0x3];                                       // 0x033D   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0340   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0344   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0348   (0x0004)  
	float                                              __FloatProperty;                                            // 0x034C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0350   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0351   (0x0001)  
	unsigned char                                      UnknownData34_5[0x2];                                       // 0x0352   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0354   (0x0004)  
};

/// Struct /Game/SurvAnimator/New_Character/SurviveAnimator1_Sound.SurviveAnimator1_Sound_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0000 (0x0007F0 - 0x0007F0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintGeneratedConstantData
{ 
};

/// Struct /Game/SurvAnimator/New_Character/ABP_H5.ABP_H5_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/Female_V2/Female_SkeletalMeshes/Hairs_V2/female_H11_undercut/ABP_female_H11_undercut.ABP_female_H11_undercut_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/Heads/MW_3/ABP_MW_3_LOD.ABP_MW_3_LOD_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0137 (0x000001 - 0x000138)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0010   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0018   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0020   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x0021   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x0022   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0028   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0038   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0039   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x003C   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0040   (0x002C)  
	float                                              __FloatProperty;                                            // 0x006C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0070   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0071   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x0072   (0x0001)  
	unsigned char                                      UnknownData04_5[0x1];                                       // 0x0073   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x0074   (0x0008)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x007C   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0080   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00A0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0120   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/Heads/MW_3/ABP_MW_3_LOD.ABP_MW_3_LOD_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
};

/// Struct /Game/SurvAnimator/New_Character/ABP_H8.ABP_H8_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/V3/Hair/ABP_H_Cap.ABP_H_Cap_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/SurvAnimator/CharSpeedSettings.CharSpeedSettings
/// Size: 0x00B8 (0x000000 - 0x0000B8)
struct FCharSpeedSettings
{ 
	double                                             WalkF_42_FC56DA0E4122A364BD260C8F727BCEA7;                  // 0x0000   (0x0008)  
	double                                             WalkFRL_43_3077C0084C746D06BC6F92AA20CAA372;                // 0x0008   (0x0008)  
	double                                             WalkRL_62_5C6C56DB4B94DA81EF917093C4BAB075;                 // 0x0010   (0x0008)  
	double                                             WalkBRL_45_6F17260445D85996EC86A09833FD6BD5;                // 0x0018   (0x0008)  
	double                                             WalkB_44_6543BBC64E14BDE12CA3DB8CF983CA35;                  // 0x0020   (0x0008)  
	double                                             JogF_46_3C63B0BE43D2104EC19C40B37057837F;                   // 0x0028   (0x0008)  
	double                                             JogFRL_47_CFC1392F465EFC16A31579AB6142D663;                 // 0x0030   (0x0008)  
	double                                             JogRL_56_6B6EFB2244BF550DFC2E02AFF67CF046;                  // 0x0038   (0x0008)  
	double                                             JogBRL_49_38D0B9204F0A78107A9F46A2C5604402;                 // 0x0040   (0x0008)  
	double                                             JogB_48_B07B0E8246A71E71140E64ACB262DC5B;                   // 0x0048   (0x0008)  
	double                                             CrouchF_50_F3494FDC4C8942C6777E90AFD5746128;                // 0x0050   (0x0008)  
	double                                             CrouchFRL_58_D1B6B9BD481328232CBB78AB7B449B64;              // 0x0058   (0x0008)  
	double                                             CrouchRL_52_FC042DE547134F8A9689C5AE2E1D4AEE;               // 0x0060   (0x0008)  
	double                                             CrouchBRL_60_96A12F9F4DE532D9A907C0913FF41E70;              // 0x0068   (0x0008)  
	double                                             CrouchB_53_7D43C666421480DFE13CB5986513C037;                // 0x0070   (0x0008)  
	double                                             Run_51_4A8EF2AD49F8B5C81FAD2490DF96A257;                    // 0x0078   (0x0008)  
	double                                             StandAim_27_0FDDC8EE4BF29F7360281A8482D15A2B;               // 0x0080   (0x0008)  
	double                                             CrouchAim_29_97FEFF4A43F4EC5EB223BBB5D1E5A68D;              // 0x0088   (0x0008)  
	double                                             CrawlF_65_262E881045D74CAF4CB7C9899088615B;                 // 0x0090   (0x0008)  
	double                                             CrawlFRL_67_51297BD24EBAF7A09A6710856FD122D5;               // 0x0098   (0x0008)  
	double                                             CrawlRL_69_0E0BBA1340087C0CCE5624BA22C5A44E;                // 0x00A0   (0x0008)  
	double                                             CrawlBRL_71_1EF343F940808BC370CF5E9A910A2034;               // 0x00A8   (0x0008)  
	double                                             CrawlB_73_2839E31C4CA23CBF78AB899258A94D56;                 // 0x00B0   (0x0008)  
};

/// Struct /Game/SurvAnimator/Anims/Pose/SurviveAnimator.SurviveAnimator_C.AnimBlueprintGeneratedConstantData
/// Size: 0x077F (0x000001 - 0x000780)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0014   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x001C   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0020   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0028   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0030   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0038   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0040   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0048   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0050   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0058   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0060   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0068   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0070   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0078   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0080   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0088   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0090   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0098   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00A0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00A8   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00B0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00B8   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00C0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00C8   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00D0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00D8   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00E0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00E8   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00F0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00F8   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0100   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0108   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0110   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0118   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0120   (0x0008)  
	float                                              __FloatProperty;                                            // 0x0128   (0x0004)  
	FName                                              __NameProperty;                                             // 0x012C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0134   (0x0008)  
	FName                                              __NameProperty;                                             // 0x013C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0144   (0x0008)  
	FName                                              __NameProperty;                                             // 0x014C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0154   (0x0008)  
	FName                                              __NameProperty;                                             // 0x015C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0164   (0x0008)  
	FName                                              __NameProperty;                                             // 0x016C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0174   (0x0008)  
	FName                                              __NameProperty;                                             // 0x017C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0184   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x018C   (0x0004)  MISSED
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0190   (0x0010)  
	FName                                              __NameProperty;                                             // 0x01A0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x01A8   (0x0008)  
	float                                              __FloatProperty;                                            // 0x01B0   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x01B4   (0x0004)  MISSED
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x01B8   (0x0010)  
	FName                                              __NameProperty;                                             // 0x01C8   (0x0008)  
	float                                              __FloatProperty;                                            // 0x01D0   (0x0004)  
	FName                                              __NameProperty;                                             // 0x01D4   (0x0008)  
	float                                              __FloatProperty;                                            // 0x01DC   (0x0004)  
	FName                                              __NameProperty;                                             // 0x01E0   (0x0008)  
	float                                              __FloatProperty;                                            // 0x01E8   (0x0004)  
	FName                                              __NameProperty;                                             // 0x01EC   (0x0008)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x01F4   (0x0004)  MISSED
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x01F8   (0x0010)  
	float                                              __FloatProperty;                                            // 0x0208   (0x0004)  
	FName                                              __NameProperty;                                             // 0x020C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0214   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x021C   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0220   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0228   (0x0004)  
	FName                                              __NameProperty;                                             // 0x022C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0234   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0238   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0240   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0248   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x024C   (0x0004)  MISSED
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0250   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0260   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0268   (0x0004)  
	FName                                              __NameProperty;                                             // 0x026C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0274   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0278   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0280   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0288   (0x0004)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x028C   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x028D   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0290   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0298   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x02A0   (0x0004)  
	FName                                              __NameProperty;                                             // 0x02A4   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x02AC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02B0   (0x0004)  
	FName                                              __NameProperty;                                             // 0x02B4   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x02BC   (0x0004)  
	FName                                              __NameProperty;                                             // 0x02C0   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x02C8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02CC   (0x0004)  
	TArray<float>                                      __ArrayProperty;                                            // 0x02D0   (0x0010)  
	FName                                              __NameProperty;                                             // 0x02E0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x02E8   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x02F0   (0x0004)  
	unsigned char                                      UnknownData06_5[0x4];                                       // 0x02F4   (0x0004)  MISSED
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x02F8   (0x0010)  
	float                                              __FloatProperty;                                            // 0x0308   (0x0004)  
	FName                                              __NameProperty;                                             // 0x030C   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0314   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0318   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0320   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0324   (0x0008)  
	float                                              __FloatProperty;                                            // 0x032C   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0330   (0x0008)  
	float                                              __FloatProperty;                                            // 0x0338   (0x0004)  
	FName                                              __NameProperty;                                             // 0x033C   (0x0008)  
	unsigned char                                      UnknownData07_5[0x4];                                       // 0x0344   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0348   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0358   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0368   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0378   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0388   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0398   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x03A8   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x03B8   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x03C8   (0x0010)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x03D8   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x03E0   (0x0001)  
	unsigned char                                      UnknownData08_5[0x7];                                       // 0x03E1   (0x0007)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x03E8   (0x0010)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x03F8   (0x0001)  
	unsigned char                                      UnknownData09_5[0x7];                                       // 0x03F9   (0x0007)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0400   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0410   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0418   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0420   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0424   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x042C   (0x0004)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0430   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0440   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0450   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0460   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0468   (0x0004)  
	FName                                              __NameProperty;                                             // 0x046C   (0x0008)  
	unsigned char                                      UnknownData10_5[0x4];                                       // 0x0474   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0478   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0488   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0498   (0x0008)  
	FName                                              __NameProperty;                                             // 0x04A0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x04A8   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x04B0   (0x0010)  
	FName                                              __NameProperty;                                             // 0x04C0   (0x0008)  
	TEnumAsByte<ESequenceEvalReinit>                   __ByteProperty;                                             // 0x04C8   (0x0001)  
	unsigned char                                      UnknownData11_5[0x3];                                       // 0x04C9   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x04CC   (0x0004)  
	UAnimSequenceBase*                                 __AnimSequenceBase;                                         // 0x04D0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x04D8   (0x0008)  
	FName                                              __NameProperty;                                             // 0x04E0   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x04E8   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x04F8   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0508   (0x0010)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0518   (0x0001)  
	unsigned char                                      UnknownData12_5[0x7];                                       // 0x0519   (0x0007)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0520   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0530   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0540   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0550   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0560   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0570   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0578   (0x0008)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0580   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0590   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x05A0   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x05B0   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x05C0   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x05D0   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x05E0   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x05F0   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0600   (0x0010)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x0610   (0x0001)  
	unsigned char                                      UnknownData13_5[0x7];                                       // 0x0611   (0x0007)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0618   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0628   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0630   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0634   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x063C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0640   (0x0004)  
	FName                                              __NameProperty;                                             // 0x0644   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x064C   (0x0004)  
	UBlendProfile*                                     __BlendProfile;                                             // 0x0650   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0658   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0660   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x0661   (0x0001)  
	unsigned char                                      UnknownData14_5[0x6];                                       // 0x0662   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0668   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0678   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0680   (0x0001)  
	unsigned char                                      UnknownData15_5[0x3];                                       // 0x0681   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0684   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0688   (0x002C)  
	float                                              __FloatProperty;                                            // 0x06B4   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x06B8   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x06B9   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x06BA   (0x0001)  
	unsigned char                                      UnknownData16_5[0x1];                                       // 0x06BB   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x06BC   (0x0008)  
	unsigned char                                      UnknownData17_5[0x4];                                       // 0x06C4   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x06C8   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x06E8   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0768   (0x0018)  
};

/// Struct /Game/SurvAnimator/Anims/Pose/SurviveAnimator.SurviveAnimator_C.AnimBlueprintGeneratedMutableData
/// Size: 0x038A (0x000001 - 0x00038B)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0002   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0004   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0008   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x000C   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x000D   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x000E   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x000F   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0010   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0011   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0012   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0013   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0014   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0015   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0016   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0017   (0x0001)  
	float                                              __FloatProperty;                                            // 0x0018   (0x0004)  
	float                                              __FloatProperty;                                            // 0x001C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0020   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0024   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0028   (0x0004)  
	char                                               __ByteProperty;                                             // 0x002C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x002D   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0030   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0034   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0038   (0x0004)  
	float                                              __FloatProperty;                                            // 0x003C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0040   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0041   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0042   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0043   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0044   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0045   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0046   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0047   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0048   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0049   (0x0001)  
	char                                               __ByteProperty;                                             // 0x004A   (0x0001)  
	unsigned char                                      UnknownData02_5[0x1];                                       // 0x004B   (0x0001)  MISSED
	float                                              __FloatProperty;                                            // 0x004C   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0050   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0051   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0054   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0058   (0x0004)  
	float                                              __FloatProperty;                                            // 0x005C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0060   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0064   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0068   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0069   (0x0001)  
	char                                               __ByteProperty;                                             // 0x006A   (0x0001)  
	char                                               __ByteProperty;                                             // 0x006B   (0x0001)  
	char                                               __ByteProperty;                                             // 0x006C   (0x0001)  
	char                                               __ByteProperty;                                             // 0x006D   (0x0001)  
	char                                               __ByteProperty;                                             // 0x006E   (0x0001)  
	char                                               __ByteProperty;                                             // 0x006F   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0070   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0071   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0072   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0073   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0074   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0075   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0076   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0077   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0078   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0079   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x007C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0080   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0084   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x0085   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0088   (0x0004)  
	float                                              __FloatProperty;                                            // 0x008C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0090   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0094   (0x0001)  
	unsigned char                                      UnknownData06_5[0x3];                                       // 0x0095   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0098   (0x0004)  
	char                                               __ByteProperty;                                             // 0x009C   (0x0001)  
	char                                               __ByteProperty;                                             // 0x009D   (0x0001)  
	unsigned char                                      UnknownData07_5[0x2];                                       // 0x009E   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x00A0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00A4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00A8   (0x0004)  
	char                                               __ByteProperty;                                             // 0x00AC   (0x0001)  
	unsigned char                                      UnknownData08_5[0x3];                                       // 0x00AD   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x00B0   (0x0004)  
	char                                               __ByteProperty;                                             // 0x00B4   (0x0001)  
	unsigned char                                      UnknownData09_5[0x3];                                       // 0x00B5   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x00B8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00BC   (0x0004)  
	char                                               __ByteProperty;                                             // 0x00C0   (0x0001)  
	unsigned char                                      UnknownData10_5[0x3];                                       // 0x00C1   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x00C4   (0x0004)  
	char                                               __ByteProperty;                                             // 0x00C8   (0x0001)  
	unsigned char                                      UnknownData11_5[0x3];                                       // 0x00C9   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x00CC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00D0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00D4   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x00D8   (0x0001)  
	unsigned char                                      UnknownData12_5[0x3];                                       // 0x00D9   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x00DC   (0x0004)  
	char                                               __ByteProperty;                                             // 0x00E0   (0x0001)  
	unsigned char                                      UnknownData13_5[0x3];                                       // 0x00E1   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x00E4   (0x0004)  
	char                                               __ByteProperty;                                             // 0x00E8   (0x0001)  
	char                                               __ByteProperty;                                             // 0x00E9   (0x0001)  
	unsigned char                                      UnknownData14_5[0x2];                                       // 0x00EA   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x00EC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00F0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x00F4   (0x0004)  
	char                                               __ByteProperty;                                             // 0x00F8   (0x0001)  
	unsigned char                                      UnknownData15_5[0x3];                                       // 0x00F9   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x00FC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0100   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0104   (0x0001)  
	unsigned char                                      UnknownData16_5[0x3];                                       // 0x0105   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0108   (0x0004)  
	char                                               __ByteProperty;                                             // 0x010C   (0x0001)  
	unsigned char                                      UnknownData17_5[0x3];                                       // 0x010D   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0110   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0114   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0118   (0x0001)  
	unsigned char                                      UnknownData18_5[0x3];                                       // 0x0119   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x011C   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0120   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0121   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0122   (0x0001)  
	unsigned char                                      UnknownData19_5[0x1];                                       // 0x0123   (0x0001)  MISSED
	float                                              __FloatProperty;                                            // 0x0124   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0128   (0x0004)  
	float                                              __FloatProperty;                                            // 0x012C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0130   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0134   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0138   (0x0004)  
	float                                              __FloatProperty;                                            // 0x013C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0140   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0144   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0148   (0x0004)  
	float                                              __FloatProperty;                                            // 0x014C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0150   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0154   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0155   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0156   (0x0001)  
	unsigned char                                      UnknownData20_5[0x1];                                       // 0x0157   (0x0001)  MISSED
	float                                              __FloatProperty;                                            // 0x0158   (0x0004)  
	float                                              __FloatProperty;                                            // 0x015C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0160   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0164   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0165   (0x0001)  
	unsigned char                                      UnknownData21_5[0x2];                                       // 0x0166   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0168   (0x0004)  
	float                                              __FloatProperty;                                            // 0x016C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0170   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0174   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0178   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x017C   (0x0001)  
	unsigned char                                      UnknownData22_5[0x3];                                       // 0x017D   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0180   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0184   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0188   (0x0004)  
	float                                              __FloatProperty;                                            // 0x018C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0190   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0194   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0198   (0x0004)  
	float                                              __FloatProperty;                                            // 0x019C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01A0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01A4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01A8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01AC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01B0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01B4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01B8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01BC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01C0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01C4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01C8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01CC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01D0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01D4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01D8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01DC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01E0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01E4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01E8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01EC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01F0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01F4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01F8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x01FC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0200   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0204   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0208   (0x0004)  
	float                                              __FloatProperty;                                            // 0x020C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0210   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0214   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0218   (0x0004)  
	float                                              __FloatProperty;                                            // 0x021C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0220   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0224   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0228   (0x0004)  
	float                                              __FloatProperty;                                            // 0x022C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0230   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0234   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0238   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0239   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x023A   (0x0001)  
	unsigned char                                      UnknownData23_5[0x1];                                       // 0x023B   (0x0001)  MISSED
	float                                              __FloatProperty;                                            // 0x023C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0240   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0244   (0x0001)  
	unsigned char                                      UnknownData24_5[0x3];                                       // 0x0245   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0248   (0x0004)  
	float                                              __FloatProperty;                                            // 0x024C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0250   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0254   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0258   (0x0001)  
	unsigned char                                      UnknownData25_5[0x3];                                       // 0x0259   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x025C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0260   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0264   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0268   (0x0004)  
	float                                              __FloatProperty;                                            // 0x026C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0270   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0271   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0272   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0273   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0274   (0x0001)  
	unsigned char                                      UnknownData26_5[0x3];                                       // 0x0275   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0278   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x027C   (0x0001)  
	unsigned char                                      UnknownData27_5[0x3];                                       // 0x027D   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0280   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0284   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0288   (0x0004)  
	float                                              __FloatProperty;                                            // 0x028C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0290   (0x0001)  
	unsigned char                                      UnknownData28_5[0x3];                                       // 0x0291   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0294   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0298   (0x0004)  
	float                                              __FloatProperty;                                            // 0x029C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02A0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02A4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02A8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02AC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02B0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02B4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02B8   (0x0004)  
	char                                               __ByteProperty;                                             // 0x02BC   (0x0001)  
	unsigned char                                      UnknownData29_5[0x3];                                       // 0x02BD   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x02C0   (0x0004)  
	char                                               __ByteProperty;                                             // 0x02C4   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02C5   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02C6   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02C7   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02C8   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02C9   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02CA   (0x0001)  
	char                                               __ByteProperty;                                             // 0x02CB   (0x0001)  
	float                                              __FloatProperty;                                            // 0x02CC   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData30_5[0x3];                                       // 0x02D1   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x02D4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02D8   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02DC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02E0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02E4   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02E8   (0x0004)  
	char                                               __ByteProperty;                                             // 0x02EC   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x02ED   (0x0001)  
	unsigned char                                      UnknownData31_5[0x2];                                       // 0x02EE   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x02F0   (0x0004)  
	float                                              __FloatProperty;                                            // 0x02F4   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x02F8   (0x0001)  
	unsigned char                                      UnknownData32_5[0x3];                                       // 0x02F9   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x02FC   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0300   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0304   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0305   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0306   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0307   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0308   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0309   (0x0001)  
	unsigned char                                      UnknownData33_5[0x2];                                       // 0x030A   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x030C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0310   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0314   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0315   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0316   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0317   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0318   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0319   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x031A   (0x0001)  
	unsigned char                                      UnknownData34_5[0x1];                                       // 0x031B   (0x0001)  MISSED
	float                                              __FloatProperty;                                            // 0x031C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0320   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0321   (0x0001)  
	unsigned char                                      UnknownData35_5[0x2];                                       // 0x0322   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0324   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0328   (0x0004)  
	char                                               __ByteProperty;                                             // 0x032C   (0x0001)  
	char                                               __ByteProperty;                                             // 0x032D   (0x0001)  
	unsigned char                                      UnknownData36_5[0x2];                                       // 0x032E   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0330   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0334   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0335   (0x0001)  
	unsigned char                                      UnknownData37_5[0x2];                                       // 0x0336   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0338   (0x0004)  
	float                                              __FloatProperty;                                            // 0x033C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0340   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0344   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0348   (0x0004)  
	float                                              __FloatProperty;                                            // 0x034C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0350   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0354   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0358   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0359   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x035A   (0x0001)  
	unsigned char                                      UnknownData38_5[0x1];                                       // 0x035B   (0x0001)  MISSED
	float                                              __FloatProperty;                                            // 0x035C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0360   (0x0001)  
	char                                               __ByteProperty;                                             // 0x0361   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0362   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0363   (0x0001)  
	float                                              __FloatProperty;                                            // 0x0364   (0x0004)  
	char                                               __ByteProperty;                                             // 0x0368   (0x0001)  
	unsigned char                                      UnknownData39_5[0x3];                                       // 0x0369   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x036C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0370   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0374   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0378   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x037C   (0x0001)  
	unsigned char                                      UnknownData40_5[0x3];                                       // 0x037D   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0380   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0384   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0388   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0389   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x038A   (0x0001)  
};

/// Struct /Game/SurvAnimator/New_Character/Female_V2/Female_SkeletalMeshes/Heads/ABP_Female_Head1.ABP_Female_Head1_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0137 (0x000001 - 0x000138)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0010   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0018   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0020   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x0021   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x0022   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0028   (0x0010)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0038   (0x0020)  
	bool                                               __BoolProperty;                                             // 0x0058   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0059   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x005C   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0060   (0x002C)  
	float                                              __FloatProperty;                                            // 0x008C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0090   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0091   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x0092   (0x0001)  
	unsigned char                                      UnknownData04_5[0x1];                                       // 0x0093   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x0094   (0x0008)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x009C   (0x0004)  MISSED
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00A0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0120   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/Female_V2/Female_SkeletalMeshes/Heads/ABP_Female_Head1.ABP_Female_Head1_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
};

/// Struct /Game/SurvAnimator/Anims/Pose/SurviveAnimator_Sound.SurviveAnimator_Sound_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0000 (0x000780 - 0x000780)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintGeneratedConstantData
{ 
};

/// Struct /Game/SurvAnimator/New_Character/Female/ABP_FemaleHead.ABP_FemaleHead_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00F7 (0x000001 - 0x0000F8)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0008   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0010   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0018   (0x0001)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0019   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x001A   (0x0001)  
	unsigned char                                      UnknownData01_5[0x5];                                       // 0x001B   (0x0005)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0020   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0030   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0038   (0x0008)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0040   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0060   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00E0   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/Female/ABP_FemaleHead.ABP_FemaleHead_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
};

/// Struct /Game/SurvAnimator/New_Character/ABP_DeadBody.ABP_DeadBody_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0008   (0x0020)  
	FName                                              __NameProperty;                                             // 0x0028   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0030   (0x0008)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/SurvAnimator/Anims/Pose/SurviveAnim_IK.SurviveAnim_IK_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00F7 (0x000001 - 0x0000F8)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0008   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0010   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0018   (0x0001)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0019   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x001A   (0x0001)  
	unsigned char                                      UnknownData01_5[0x5];                                       // 0x001B   (0x0005)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0020   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0030   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0038   (0x0008)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0040   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0060   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00E0   (0x0018)  
};

/// Struct /Game/SurvAnimator/Anims/Pose/SurviveAnim_IK.SurviveAnim_IK_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
};

/// Struct /Game/SurvAnimator/New_Character/Heads/MaterialsData/S_Mat.S_Mat
/// Size: 0x0008 (0x000000 - 0x000008)
struct FS_Mat
{ 
	UMaterialInterface*                                SkinMaterial_3_6EBCA389440F9B6BEC5F54A4A2AA7428;            // 0x0000   (0x0008)  
};

/// Struct /Game/SurvAnimator/New_Character/TestABP.TestABP_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0157 (0x000001 - 0x000158)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0008   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0010   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0018   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x0019   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x001A   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0020   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0030   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0038   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x003C   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x003D   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0040   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x0048   (0x0004)  
	float                                              __FloatProperty;                                            // 0x004C   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0050   (0x002C)  
	float                                              __FloatProperty;                                            // 0x007C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0080   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0081   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x0082   (0x0001)  
	unsigned char                                      UnknownData03_5[0x1];                                       // 0x0083   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x0084   (0x0008)  
	int32_t                                            __IntProperty;                                              // 0x008C   (0x0004)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0090   (0x0020)  
	FName                                              __NameProperty;                                             // 0x00B0   (0x0008)  
	FName                                              __NameProperty;                                             // 0x00B8   (0x0008)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00C0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0140   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/TestABP.TestABP_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
};

/// Struct /Game/SurvAnimator/Hero_Skeleton/Cutscene_AnimBP.Cutscene_AnimBP_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0167 (0x000001 - 0x000168)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0008   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0018   (0x0010)  
	TArray<int32_t>                                    __ArrayProperty;                                            // 0x0028   (0x0010)  
	FName                                              __NameProperty;                                             // 0x0038   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0040   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0041   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x0044   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0048   (0x002C)  
	float                                              __FloatProperty;                                            // 0x0074   (0x0004)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0078   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x0079   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x007A   (0x0002)  MISSED
	FName                                              __NameProperty;                                             // 0x007C   (0x0008)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x0084   (0x0004)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0088   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0090   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0098   (0x0001)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0099   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x009A   (0x0001)  
	unsigned char                                      UnknownData04_5[0x5];                                       // 0x009B   (0x0005)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x00A0   (0x0010)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x00B0   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00D0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0150   (0x0018)  
};

/// Struct /Game/SurvAnimator/Hero_Skeleton/Cutscene_AnimBP.Cutscene_AnimBP_C.AnimBlueprintGeneratedMutableData
/// Size: 0x002D (0x000001 - 0x00002E)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0002   (0x0002)  MISSED
	float                                              __FloatProperty;                                            // 0x0004   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0008   (0x0004)  
	float                                              __FloatProperty;                                            // 0x000C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0010   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0014   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0018   (0x0004)  
	float                                              __FloatProperty;                                            // 0x001C   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0020   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0024   (0x0004)  
	float                                              __FloatProperty;                                            // 0x0028   (0x0004)  
	char                                               __ByteProperty;                                             // 0x002C   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x002D   (0x0001)  
};

/// Struct /Game/SurvAnimator/New_Character/BasicMesh/TDB_APP_FIK.TDB_APP_FIK_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0107 (0x000001 - 0x000108)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0008   (0x0010)  
	TArray<float>                                      __ArrayProperty;                                            // 0x0018   (0x0010)  
	UBlendProfile*                                     __BlendProfile;                                             // 0x0028   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0030   (0x0008)  
	bool                                               __BoolProperty;                                             // 0x0038   (0x0001)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0039   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x003A   (0x0001)  
	unsigned char                                      UnknownData01_5[0x1];                                       // 0x003B   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x003C   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0044   (0x0008)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x004C   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0050   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0070   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00F0   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/BasicMesh/TDB_APP_FIK.TDB_APP_FIK_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0018 (0x000001 - 0x000019)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0002   (0x0001)  
	bool                                               __BoolProperty;                                             // 0x0003   (0x0001)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0008   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0018   (0x0001)  
};

/// Struct /Game/SurvAnimator/New_Character/Heads/WhiteHead/ABP_WhiteHead.ABP_WhiteHead_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0137 (0x000001 - 0x000138)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0010   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0018   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0020   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x0021   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x0022   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0028   (0x0010)  
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0038   (0x0020)  
	bool                                               __BoolProperty;                                             // 0x0058   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0059   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x005C   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0060   (0x002C)  
	float                                              __FloatProperty;                                            // 0x008C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0090   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0091   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x0092   (0x0001)  
	unsigned char                                      UnknownData04_5[0x1];                                       // 0x0093   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x0094   (0x0008)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x009C   (0x0004)  MISSED
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00A0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0120   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/Heads/WhiteHead/ABP_WhiteHead.ABP_WhiteHead_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
};

/// Struct /Game/SurvAnimator/New_Character/V3/Hair/Hair_Skeleton_AnimBlueprint.Hair_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/SurvMale_Ragdoll.SurvMale_Ragdoll_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0008   (0x0020)  
	FName                                              __NameProperty;                                             // 0x0028   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0030   (0x0008)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/SurvAnimator/Parkour/WindowClimb/S_WindowClimb.S_WindowClimb
/// Size: 0x0034 (0x000000 - 0x000034)
struct FS_WindowClimb
{ 
	UCurveFloat*                                       TimelineCurve_16_56B0A7B740CEA564E07AE094E916851C;          // 0x0000   (0x0008)  
	float                                              TimelineLength_2_D5B1481A405C8A6353DA0FAD1AE7999E;          // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	UCurveVector*                                      BeginCurve_11_B719554748CAA5DEA1A4A6B267977865;             // 0x0010   (0x0008)  
	UCurveVector*                                      EndCurve_13_BD3876D146A99FB58453A9B680351B25;               // 0x0018   (0x0008)  
	UAnimMontage*                                      Montage_5_B248EF074C3510AA136849857BE7C71E;                 // 0x0020   (0x0008)  
	float                                              SwitchOffset_8_4CFBCE044D1E17E30D02628853630F00;            // 0x0028   (0x0004)  
	float                                              CutOfTime_19_27BA3F9F4800F523C4D62CA0AF631E57;              // 0x002C   (0x0004)  
	float                                              DistanceToCutOff_22_A8F885ED4FDEFBBC2555DAB8C595FB6E;       // 0x0030   (0x0004)  
};

/// Struct /Game/SurvAnimator/New_Character/V3/Hair_V2/H11_undercut/ABP_H11_undercut.ABP_H11_undercut_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/Female/ABP_Female_Hair_ponytail.ABP_Female_Hair_ponytail_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0001   (0x0007)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0008   (0x0020)  
	FName                                              __NameProperty;                                             // 0x0028   (0x0008)  
	FName                                              __NameProperty;                                             // 0x0030   (0x0008)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/V3/Hair_V2/H2_side/ABP_H2_side.ABP_H2_side_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/Heads/MW_4/ABP_MW_4_LOD.ABP_MW_4_LOD_C.AnimBlueprintGeneratedConstantData
/// Size: 0x0137 (0x000001 - 0x000138)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x000C   (0x0004)  MISSED
	UBlendProfile*                                     __BlendProfile;                                             // 0x0010   (0x0008)  
	UCurveFloat*                                       __CurveFloat;                                               // 0x0018   (0x0008)  
	EAlphaBlendOption                                  __EnumProperty;                                             // 0x0020   (0x0001)  
	EBlendListTransitionType                           __EnumProperty;                                             // 0x0021   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x0022   (0x0006)  MISSED
	TArray<float>                                      __ArrayProperty;                                            // 0x0028   (0x0010)  
	bool                                               __BoolProperty;                                             // 0x0038   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0039   (0x0003)  MISSED
	float                                              __FloatProperty;                                            // 0x003C   (0x0004)  
	FInputScaleBiasClampConstants                      __StructProperty;                                           // 0x0040   (0x002C)  
	float                                              __FloatProperty;                                            // 0x006C   (0x0004)  
	bool                                               __BoolProperty;                                             // 0x0070   (0x0001)  
	EAnimSyncMethod                                    __EnumProperty;                                             // 0x0071   (0x0001)  
	TEnumAsByte<EAnimGroupRole>                        __ByteProperty;                                             // 0x0072   (0x0001)  
	unsigned char                                      UnknownData04_5[0x1];                                       // 0x0073   (0x0001)  MISSED
	FName                                              __NameProperty;                                             // 0x0074   (0x0008)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x007C   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0080   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x00A0   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x0120   (0x0018)  
};

/// Struct /Game/SurvAnimator/New_Character/Heads/MW_4/ABP_MW_4_LOD.ABP_MW_4_LOD_C.AnimBlueprintGeneratedMutableData
/// Size: 0x0001 (0x000001 - 0x000002)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{ 
	bool                                               __BoolProperty;                                             // 0x0001   (0x0001)  
};

/// Class /Game/SurvAnimator/FP/Skeletal_Mesh/FP_Hands_Rig_CtrlRig.FP_Hands_Rig_CtrlRig_C
/// Size: 0x00D8 (0x0003F8 - 0x0004D0)
class UFP_Hands_Rig_CtrlRig_C : public UControlRig : UControlRig
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x03F8   (0x0008)  MISSED
	FTransform                                         OffsetHandRTransform;                                       // 0x0400   (0x0060)  
	FRotator                                           RollValue;                                                  // 0x0460   (0x0018)  
	FVector                                            RollPivotLocation;                                          // 0x0478   (0x0018)  
	double                                             RightHandAlpha;                                             // 0x0490   (0x0008)  
	FRotator                                           InclineRotation;                                            // 0x0498   (0x0018)  
	double                                             Tilt;                                                       // 0x04B0   (0x0008)  
	FVector                                            ElbowLoc;                                                   // 0x04B8   (0x0018)  
};

/// Class /Game/SurvAnimator/FP/Skeletal_Mesh/FP_Hands_Rig_CtrlRig.RigVMMemory_Literal
/// Size: 0x0240 (0x000028 - 0x000268)
class URigVMMemory_Literal : public URigVMMemoryStorage : URigVMMemoryStorage
{ 
public:
	FName                                              RigVMModel___SetControlRotator_1_Control__Const;            // 0x0028   (0x0008)  
	float                                              RigVMModel___SetControlRotator_1_Weight__Const;             // 0x0030   (0x0004)  
	TEnumAsByte<ERigVMTransformSpace>                  RigVMModel___SetControlRotator_1_Space__Const;              // 0x0034   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0035   (0x0003)  MISSED
	FRigElementKey                                     RigVMModel___RigUnit_SetRelativeTransformForItem_2_Child__Const; // 0x0038   (0x000C)  
	FRigElementKey                                     RigVMModel___RigUnit_SetRelativeTransformForItem_2_Parent__Const; // 0x0044   (0x000C)  
	bool                                               RigVMModel___RigUnit_SetRelativeTransformForItem_2_bParentInitial__Const; // 0x0050   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0051   (0x0003)  MISSED
	FRigElementKey                                     RigVMModel___RigUnit_GetRelativeTransformForItem_Parent__Const; // 0x0054   (0x000C)  
	bool                                               RigVMModel___RigUnit_SetRelativeTransformForItem_2_bPropagateToChildren__Const; // 0x0060   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0061   (0x0003)  MISSED
	FRigElementKey                                     RigVMModel___RigUnit_SetTransform_Item__Const;              // 0x0064   (0x000C)  
	TEnumAsByte<ERigVMTransformSpace>                  RigVMModel___RigUnit_SetTransform_Space__Const;             // 0x0070   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0071   (0x0003)  MISSED
	FRigElementKey                                     RigVMModel___GetTransform_Item__Const;                      // 0x0074   (0x000C)  
	FRigElementKey                                     RigVMModel___RigUnit_SetTransform_1_Item__Const;            // 0x0080   (0x000C)  
	FRigElementKey                                     RigVMModel___GetTransform_2_Item__Const;                    // 0x008C   (0x000C)  
	FRigElementKey                                     RigVMModel___RigUnit_SetRelativeTransformForItem_Parent__Const; // 0x0098   (0x000C)  
	FRigElementKey                                     RigVMModel___GetRelativeTransformForItem_Parent__Const;     // 0x00A4   (0x000C)  
	FName                                              RigVMModel___SetControlRotator_Control__Const;              // 0x00B0   (0x0008)  
	FRigElementKey                                     RigVMModel___RigUnit_SetTransform_1_1_1_Item__Const;        // 0x00B8   (0x000C)  
	unsigned char                                      UnknownData04_5[0xC];                                       // 0x00C4   (0x000C)  MISSED
	FTransform                                         RigVMModel___RigUnit_SetTransform_1_1_1_Value__Const;       // 0x00D0   (0x0060)  
	FRigElementKey                                     RigVMModel___TwoBoneIKSimplePerItem_ItemA__Const;           // 0x0130   (0x000C)  
	FRigElementKey                                     RigVMModel___GetTransform_1_Item__Const;                    // 0x013C   (0x000C)  
	FVector                                            RigVMModel___TwoBoneIKSimplePerItem_PrimaryAxis__Const;     // 0x0148   (0x0018)  
	FVector                                            RigVMModel___TwoBoneIKSimplePerItem_SecondaryAxis__Const;   // 0x0160   (0x0018)  
	double                                             RigVMModel___Multiply_B__Const;                             // 0x0178   (0x0008)  
	TEnumAsByte<EControlRigVectorKind>                 RigVMModel___TwoBoneIKSimplePerItem_PoleVectorKind__Const;  // 0x0180   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x0181   (0x0003)  MISSED
	FRigElementKey                                     RigVMModel___TwoBoneIKSimplePerItem_PoleVectorSpace__Const; // 0x0184   (0x000C)  
	float                                              RigVMModel___TwoBoneIKSimplePerItem_StretchStartRatio__Const; // 0x0190   (0x0004)  
	float                                              RigVMModel___TwoBoneIKSimplePerItem_StretchMaximumRatio__Const; // 0x0194   (0x0004)  
	float                                              RigVMModel___TwoBoneIKSimplePerItem_ItemALength__Const;     // 0x0198   (0x0004)  
	unsigned char                                      UnknownData06_5[0x4];                                       // 0x019C   (0x0004)  MISSED
	FRigUnit_TwoBoneIKSimple_DebugSettings             RigVMModel___TwoBoneIKSimplePerItem_DebugSettings__Const;   // 0x01A0   (0x0070)  
	FRigElementKey                                     RigVMModel___TwoBoneIKSimplePerItem_1_ItemA__Const;         // 0x0210   (0x000C)  
	FRigElementKey                                     RigVMModel___TwoBoneIKSimplePerItem_1_ItemB__Const;         // 0x021C   (0x000C)  
	FRigElementKey                                     RigVMModel___TwoBoneIKSimplePerItem_1_EffectorItem__Const;  // 0x0228   (0x000C)  
	unsigned char                                      UnknownData07_5[0x4];                                       // 0x0234   (0x0004)  MISSED
	FVector                                            RigVMModel___TwoBoneIKSimplePerItem_1_PrimaryAxis__Const;   // 0x0238   (0x0018)  
	FVector                                            RigVMModel___TwoBoneIKSimplePerItem_1_SecondaryAxis__Const; // 0x0250   (0x0018)  
};

/// Class /Game/SurvAnimator/FP/Skeletal_Mesh/FP_Hands_Rig_CtrlRig.RigVMMemory_Work
/// Size: 0x0728 (0x000028 - 0x000750)
class URigVMMemory_Work : public URigVMMemoryStorage : URigVMMemoryStorage
{ 
public:
	TArray<FCachedRigElement>                          RigVMModel___SetControlRotator_1_CachedControlIndex;        // 0x0028   (0x0010)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0038   (0x0008)  MISSED
	FTransform                                         RigVMModel___RigUnit_GetRelativeTransformForItem_RelativeTransform; // 0x0040   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_GetRelativeTransformForItem_CachedChild; // 0x00A0   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_GetRelativeTransformForItem_CachedParent; // 0x00B0   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetRelativeTransformForItem_2_CachedChild; // 0x00C0   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetRelativeTransformForItem_2_CachedParent; // 0x00D0   (0x0010)  
	FTransform                                         RigVMModel___GetTransform_Transform;                        // 0x00E0   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___GetTransform_CachedIndex;                      // 0x0140   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetTransform_CachedIndex;              // 0x0150   (0x0010)  
	FTransform                                         RigVMModel___GetTransform_2_Transform;                      // 0x0160   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___GetTransform_2_CachedIndex;                    // 0x01C0   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetTransform_1_CachedIndex;            // 0x01D0   (0x0010)  
	FTransform                                         RigVMModel___GetRelativeTransformForItem_RelativeTransform; // 0x01E0   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___GetRelativeTransformForItem_CachedChild;       // 0x0240   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___GetRelativeTransformForItem_CachedParent;      // 0x0250   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetRelativeTransformForItem_CachedChild; // 0x0260   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetRelativeTransformForItem_CachedParent; // 0x0270   (0x0010)  
	FTransform                                         RigVMModel___GetRelativeTransformForItem_1_RelativeTransform; // 0x0280   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___GetRelativeTransformForItem_1_CachedChild;     // 0x02E0   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___GetRelativeTransformForItem_1_CachedParent;    // 0x02F0   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetRelativeTransformForItem_1_CachedChild; // 0x0300   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetRelativeTransformForItem_1_CachedParent; // 0x0310   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetTranslation_CachedIndex;            // 0x0320   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___SetControlRotator_CachedControlIndex;          // 0x0330   (0x0010)  
	FTransform                                         RigVMModel___GetTransform_3_Transform;                      // 0x0340   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___GetTransform_3_CachedIndex;                    // 0x03A0   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetTransform_2_CachedIndex;            // 0x03B0   (0x0010)  
	FTransform                                         RigVMModel___GetTransform_2_1_Transform;                    // 0x03C0   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___GetTransform_2_1_CachedIndex;                  // 0x0420   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetTransform_1_1_CachedIndex;          // 0x0430   (0x0010)  
	FTransform                                         RigVMModel___RigUnit_SetTransform_1_1_1_Value__IO;          // 0x0440   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetTransform_1_1_1_CachedIndex;        // 0x04A0   (0x0010)  
	FTransform                                         RigVMModel___GetTransform_1_Transform;                      // 0x04B0   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___GetTransform_1_CachedIndex;                    // 0x0510   (0x0010)  
	double                                             RigVMModel___Add_Result;                                    // 0x0520   (0x0008)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x0528   (0x0008)  MISSED
	FTransform                                         RigVMModel___RigUnit_GetTransform_Transform;                // 0x0530   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_GetTransform_CachedIndex;              // 0x0590   (0x0010)  
	double                                             RigVMModel___Add_A;                                         // 0x05A0   (0x0008)  
	double                                             RigVMModel___Multiply_Result;                               // 0x05A8   (0x0008)  
	FVector                                            RigVMModel___TwoBoneIKSimplePerItem_PoleVector__IO;         // 0x05B0   (0x0018)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_CachedItemAIndex;       // 0x05C8   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_CachedItemBIndex;       // 0x05D8   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_CachedEffectorItemIndex; // 0x05E8   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_CachedPoleVectorSpaceIndex; // 0x05F8   (0x0010)  
	unsigned char                                      UnknownData02_5[0x8];                                       // 0x0608   (0x0008)  MISSED
	FTransform                                         RigVMModel___GetTransform_1_1_Transform;                    // 0x0610   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___GetTransform_1_1_CachedIndex;                  // 0x0670   (0x0010)  
	FTransform                                         RigVMModel___RigUnit_GetTransform_1_Transform;              // 0x0680   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_GetTransform_1_CachedIndex;            // 0x06E0   (0x0010)  
	FVector                                            RigVMModel___TwoBoneIKSimplePerItem_1_PoleVector;           // 0x06F0   (0x0018)  
	float                                              RigVMModel___TwoBoneIKSimplePerItem_1_Weight;               // 0x0708   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x070C   (0x0004)  MISSED
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_1_CachedItemAIndex;     // 0x0710   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_1_CachedItemBIndex;     // 0x0720   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_1_CachedEffectorItemIndex; // 0x0730   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_1_CachedPoleVectorSpaceIndex; // 0x0740   (0x0010)  
};

/// Class /Game/SurvAnimator/FP/Skeletal_Mesh/FP_Compass_CtrlRig.FP_Compass_CtrlRig_C
/// Size: 0x00C8 (0x0003F8 - 0x0004C0)
class UFP_Compass_CtrlRig_C : public UControlRig : UControlRig
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x03F8   (0x0008)  MISSED
	FTransform                                         OffsetHandRTransform;                                       // 0x0400   (0x0060)  
	FTransform                                         ChestOffsetTransform;                                       // 0x0460   (0x0060)  
};

/// Class /Game/SurvAnimator/FP/Skeletal_Mesh/FP_Compass_CtrlRig.RigVMMemory_Literal
/// Size: 0x0168 (0x000028 - 0x000190)
class URigVMMemory_Literal : public URigVMMemoryStorage : URigVMMemoryStorage
{ 
public:
	FRigElementKey                                     RigVMModel___RigUnit_SetTransform_Item__Const;              // 0x0028   (0x000C)  
	TEnumAsByte<ERigVMTransformSpace>                  RigVMModel___RigUnit_SetTransform_Space__Const;             // 0x0034   (0x0001)  
	bool                                               RigVMModel___RigUnit_SetTransform_bInitial__Const;          // 0x0035   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0036   (0x0002)  MISSED
	FRigElementKey                                     RigVMModel___GetTransform_Item__Const;                      // 0x0038   (0x000C)  
	float                                              RigVMModel___RigUnit_SetTransform_Weight__Const;            // 0x0044   (0x0004)  
	bool                                               RigVMModel___RigUnit_SetTransform_bPropagateToChildren__Const; // 0x0048   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0049   (0x0003)  MISSED
	FRigElementKey                                     RigVMModel___RigUnit_SetRelativeTransformForItem_Child__Const; // 0x004C   (0x000C)  
	FRigElementKey                                     RigVMModel___TwoBoneIKSimplePerItem_ItemA__Const;           // 0x0058   (0x000C)  
	FRigElementKey                                     RigVMModel___TwoBoneIKSimplePerItem_ItemB__Const;           // 0x0064   (0x000C)  
	FVector                                            RigVMModel___TwoBoneIKSimplePerItem_PrimaryAxis__Const;     // 0x0070   (0x0018)  
	FVector                                            RigVMModel___TwoBoneIKSimplePerItem_SecondaryAxis__Const;   // 0x0088   (0x0018)  
	TEnumAsByte<EControlRigVectorKind>                 RigVMModel___TwoBoneIKSimplePerItem_PoleVectorKind__Const;  // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x00A1   (0x0003)  MISSED
	FRigElementKey                                     RigVMModel___TwoBoneIKSimplePerItem_PoleVectorSpace__Const; // 0x00A4   (0x000C)  
	float                                              RigVMModel___TwoBoneIKSimplePerItem_StretchStartRatio__Const; // 0x00B0   (0x0004)  
	float                                              RigVMModel___TwoBoneIKSimplePerItem_StretchMaximumRatio__Const; // 0x00B4   (0x0004)  
	float                                              RigVMModel___TwoBoneIKSimplePerItem_ItemALength__Const;     // 0x00B8   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x00BC   (0x0004)  MISSED
	FRigUnit_TwoBoneIKSimple_DebugSettings             RigVMModel___TwoBoneIKSimplePerItem_DebugSettings__Const;   // 0x00C0   (0x0070)  
	FRigElementKey                                     RigVMModel___TwoBoneIKSimplePerItem_1_ItemA__Const;         // 0x0130   (0x000C)  
	FRigElementKey                                     RigVMModel___TwoBoneIKSimplePerItem_1_ItemB__Const;         // 0x013C   (0x000C)  
	FRigElementKey                                     RigVMModel___TwoBoneIKSimplePerItem_1_EffectorItem__Const;  // 0x0148   (0x000C)  
	FRigElementKey                                     RigVMModel___GetTransform_1_1_Item__Const;                  // 0x0154   (0x000C)  
	FVector                                            RigVMModel___TwoBoneIKSimplePerItem_1_PrimaryAxis__Const;   // 0x0160   (0x0018)  
	FVector                                            RigVMModel___TwoBoneIKSimplePerItem_1_SecondaryAxis__Const; // 0x0178   (0x0018)  
};

/// Class /Game/SurvAnimator/FP/Skeletal_Mesh/FP_Compass_CtrlRig.RigVMMemory_Work
/// Size: 0x0320 (0x000028 - 0x000348)
class URigVMMemory_Work : public URigVMMemoryStorage : URigVMMemoryStorage
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FTransform                                         RigVMModel___GetTransform_Transform;                        // 0x0030   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___GetTransform_CachedIndex;                      // 0x0090   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetTransform_CachedIndex;              // 0x00A0   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetRelativeTransformForItem_CachedChild; // 0x00B0   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_SetRelativeTransformForItem_CachedParent; // 0x00C0   (0x0010)  
	FTransform                                         RigVMModel___GetTransform_1_Transform;                      // 0x00D0   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___GetTransform_1_CachedIndex;                    // 0x0130   (0x0010)  
	FTransform                                         RigVMModel___RigUnit_GetTransform_Transform;                // 0x0140   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_GetTransform_CachedIndex;              // 0x01A0   (0x0010)  
	FVector                                            RigVMModel___TwoBoneIKSimplePerItem_PoleVector;             // 0x01B0   (0x0018)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_CachedItemAIndex;       // 0x01C8   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_CachedItemBIndex;       // 0x01D8   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_CachedEffectorItemIndex; // 0x01E8   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_CachedPoleVectorSpaceIndex; // 0x01F8   (0x0010)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x0208   (0x0008)  MISSED
	FTransform                                         RigVMModel___GetTransform_1_1_Transform;                    // 0x0210   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___GetTransform_1_1_CachedIndex;                  // 0x0270   (0x0010)  
	FTransform                                         RigVMModel___RigUnit_GetTransform_1_Transform;              // 0x0280   (0x0060)  
	TArray<FCachedRigElement>                          RigVMModel___RigUnit_GetTransform_1_CachedIndex;            // 0x02E0   (0x0010)  
	FVector                                            RigVMModel___TwoBoneIKSimplePerItem_1_PoleVector;           // 0x02F0   (0x0018)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_1_CachedItemAIndex;     // 0x0308   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_1_CachedItemBIndex;     // 0x0318   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_1_CachedEffectorItemIndex; // 0x0328   (0x0010)  
	TArray<FCachedRigElement>                          RigVMModel___TwoBoneIKSimplePerItem_1_CachedPoleVectorSpaceIndex; // 0x0338   (0x0010)  
};

/// Class /Game/SurvAnimator/New_Character/HUB/RoundedSofa/Menu/ABP_Bar_Menu_Rig_Skeleton.ABP_Bar_Menu_Rig_Skeleton_C
/// Size: 0x00C8 (0x000350 - 0x000418)
class UABP_Bar_Menu_Rig_Skeleton_C : public UAnimInstance : UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0358   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0360   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0368   (0x0020)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0388   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x03D0   (0x0048)  


	/// Functions
	// Function /Game/SurvAnimator/New_Character/HUB/RoundedSofa/Menu/ABP_Bar_Menu_Rig_Skeleton.ABP_Bar_Menu_Rig_Skeleton_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/HUB/RoundedSofa/Menu/ABP_Bar_Menu_Rig_Skeleton.ABP_Bar_Menu_Rig_Skeleton_C.ExecuteUbergraph_ABP_Bar_Menu_Rig_Skeleton
	void ExecuteUbergraph_ABP_Bar_Menu_Rig_Skeleton(int32_t EntryPoint);                                                     // [0x2407bf0] Final                
};

/// Class /Game/SurvAnimator/New_Character/HUB/RoundedSofa/Menu/A_Menu.A_Menu_C
/// Size: 0x0010 (0x000290 - 0x0002A0)
class AA_Menu_C : public AActor : AActor
{ 
public:
	USkeletalMeshComponent*                            SkeletalMesh;                                               // 0x0290   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x0298   (0x0008)  
};

/// Class /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C
/// Size: 0x0809 (0x000350 - 0x000B59)
class UABP_Surv_Simpled_Pose_C : public UAnimInstance : UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x0358   (0x0020)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0378   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0380   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0388   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x03A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x03D0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x03F8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0420   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0448   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0470   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0498   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x04E0   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x0500   (0x0070)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x0570   (0x0070)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x05E0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0628   (0x0020)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x0648   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0690   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x06D8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0720   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x0740   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x07B0   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x07D0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0818   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x0838   (0x0070)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x08A8   (0x0070)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x0918   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0960   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0980   (0x0048)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x09C8   (0x0048)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x0A10   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0A58   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0A78   (0x00C8)  
	bool                                               K2Node_PropertyAccess;                                      // 0x0B40   (0x0001)  
	bool                                               K2Node_PropertyAccess;                                      // 0x0B41   (0x0001)  
	bool                                               K2Node_PropertyAccess;                                      // 0x0B42   (0x0001)  
	bool                                               IsMoving;                                                   // 0x0B43   (0x0001)  
	TEnumAsByte<StanceState>                           Stance;                                                     // 0x0B44   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0B45   (0x0003)  MISSED
	float                                              Direction;                                                  // 0x0B48   (0x0004)  
	bool                                               Cond_UsingITems;                                            // 0x0B4C   (0x0001)  
	bool                                               Cond_ToAiming;                                              // 0x0B4D   (0x0001)  
	bool                                               Cond_ToSwim;                                                // 0x0B4E   (0x0001)  
	bool                                               Cond_ToIdle;                                                // 0x0B4F   (0x0001)  
	ASurvivalPlayer_C*                                 CharRef;                                                    // 0x0B50   (0x0008)  
	bool                                               InTurn;                                                     // 0x0B58   (0x0001)  


	/// Functions
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.GetFPPTacticalGripOffset
	void GetFPPTacticalGripOffset(FTransform& GripOffset);                                                                   // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.IsSpineMontage
	void IsSpineMontage(bool& Return);                                                                                       // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.InFlatSurface
	void InFlatSurface(bool& Return);                                                                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.SetJumpPrepare
	void SetJumpPrepare(bool Value, bool& Nothing);                                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.IsJumpPrepare
	void IsJumpPrepare(bool& Return);                                                                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.SetSpineMotageBool
	void SetSpineMotageBool(bool Value, bool& Nothing);                                                                      // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.SetRubberDirection
	void SetRubberDirection(double Direction, bool& Nothing);                                                                // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.SetDriving
	void SetDriving(bool InCar, bool Driver, TEnumAsByte<CarTipe> CarTipe, int32_t SitIndex, bool& Nothing);                 // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.GetDriving
	void GetDriving(bool& IsDriving);                                                                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.SetLeftHandVariant
	void SetLeftHandVariant(double Variant, bool& Success);                                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.GetInteractAnim
	void GetInteractAnim(UAnimSequence*& Sequence);                                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.IsRootRotation
	void IsRootRotation(bool& rm);                                                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.SetLootTarget
	void SetLootTarget(FTransform TargetTransform, bool& Return);                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.IsReloading
	void IsReloading(bool& IsReloading);                                                                                     // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.GetTacticalGripPoses
	void GetTacticalGripPoses(FS_WeaponGripType& GripPoses);                                                                 // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.GetFireSprayOffset
	void GetFireSprayOffset(double& SprayOffset);                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.GetTacticalGripOffset
	void GetTacticalGripOffset(FTransform& GripOffset);                                                                      // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.GetKneltTime
	void GetKneltTime(double& Time);                                                                                         // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.GetInventoryLayerState
	void GetInventoryLayerState(bool& Active?);                                                                              // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.IsInTurn
	void IsInTurn(bool& Return);                                                                                             // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.GetSurvController
	void GetSurvController(ASurvPC_C*& SurvPC);                                                                              // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.GetCameraOffset
	void GetCameraOffset(FVector& PelvisOffset, FVector& InterpOffset);                                                      // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.CheckEndEat
	void CheckEndEat(bool& Eat?);                                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.BlueprintThreadSafeUpdateAnimation
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);                                                                // [0x2407bf0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.BPI_CameraShake
	void BPI_CameraShake(UClass* ShakeClass, bool NeedChangeScale, double Scale);                                            // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.PlayMontage
	void PlayMontage(UAnimMontage* AnimMontage, bool IsHipfire, bool Reloading, double PlayRate, double StartTime);          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.SetWeaponType
	void SetWeaponType(TEnumAsByte<BPE_Weapon_Type> WeaponType);                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.SetReloadState
	void SetReloadState(bool State);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.CallEatMesh
	void CallEatMesh(FName ItemType, double DurationAttached, double AnimDelay, double DissappearDelay, double PlayRate);    // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.SetItemUsingAnim
	void SetItemUsingAnim(UAnimSequence* Anim, bool SpecialItem, bool CanMove, bool HasStandAnim, bool WepNotHiding);        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvAnimator/New_Character/ABP_Surv_Simpled_Pose.ABP_Surv_Simpled_Pose_C.ResetItemUsingAnim
