
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package SurvivalPlayer.

/// Class /Game/SurvivalPlayer.SurvivalPlayer_C
/// Size: 0x2F89 (0x0007B0 - 0x003739)
class ASurvivalPlayer_C : public ACharacterHeadStim : ACharacterHeadStim
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x07B0   (0x0008)  
	UBoxComponent*                                     Box;                                                        // 0x07B8   (0x0008)  
	UBPC_BarPlayerComponent_C*                         BPC_BarPlayerComponent;                                     // 0x07C0   (0x0008)  
	UFMODAudioComponent*                               BreathSprint;                                               // 0x07C8   (0x0008)  
	UFMODAudioComponent*                               BreathSystem;                                               // 0x07D0   (0x0008)  
	UBPC_BreathSystemReplication_C*                    BPC_BreathSystemReplication;                                // 0x07D8   (0x0008)  
	UPlayerInventoryCollector_C*                       PlayerInventoryCollector;                                   // 0x07E0   (0x0008)  
	UAC_SurvQuestInteract_C*                           AC_SurvQuestInteract;                                       // 0x07E8   (0x0008)  
	UBPC_Binoculars_C*                                 BPC_Binoculars;                                             // 0x07F0   (0x0008)  
	UBPC_NegativeEffects_C*                            BPC_NegativeEffects;                                        // 0x07F8   (0x0008)  
	USceneComponent*                                   GpsSocket;                                                  // 0x0800   (0x0008)  
	USurvivalATPCCameraComponent_C*                    ATPCCamera;                                                 // 0x0808   (0x0008)  
	USceneComponent*                                   CameraSceneSocket;                                          // 0x0810   (0x0008)  
	UWidgetComponent*                                  SquadMemberWidget;                                          // 0x0818   (0x0008)  
	UBPC_WeaponAttachments_C*                          BPC_WeaponAttachmentsSystem;                                // 0x0820   (0x0008)  
	USceneComponent*                                   PointToInteract;                                            // 0x0828   (0x0008)  
	UCameraComponent*                                  Camera;                                                     // 0x0830   (0x0008)  
	UStaticMeshComponent*                              Sphere;                                                     // 0x0838   (0x0008)  
	USceneComponent*                                   CompasSocket;                                               // 0x0840   (0x0008)  
	USkeletalMeshComponent*                            beard;                                                      // 0x0848   (0x0008)  
	UChildActorComponent*                              PistolWP;                                                   // 0x0850   (0x0008)  
	UBPC_SharpSync_C*                                  SharpSync;                                                  // 0x0858   (0x0008)  
	UChildActorComponent*                              FP_WP;                                                      // 0x0860   (0x0008)  
	UBP_WeaponWithOwnFOV_C*                            FPMeshNew;                                                  // 0x0868   (0x0008)  
	UPostProcessComponent*                             PostProcess;                                                // 0x0870   (0x0008)  
	UChildActorComponent*                              SecondaryWP;                                                // 0x0878   (0x0008)  
	UChildActorComponent*                              PrimaryWP;                                                  // 0x0880   (0x0008)  
	UStaticMeshComponent*                              Sphere1;                                                    // 0x0888   (0x0008)  
	USceneComponent*                                   FPSocket;                                                   // 0x0890   (0x0008)  
	UBPC_PlayerStatsComponent_C*                       BPC_PlayerStatsComponent;                                   // 0x0898   (0x0008)  
	UBPC_PerkSystem_C*                                 BPC_PerkSystem;                                             // 0x08A0   (0x0008)  
	UVoipAudioComponent*                               RadioVOIP;                                                  // 0x08A8   (0x0008)  
	UVoipAudioComponent*                               TeamVOIP;                                                   // 0x08B0   (0x0008)  
	UVoipManagerComponent*                             VoipManager;                                                // 0x08B8   (0x0008)  
	UBP_QuestComponent_C*                              QuestComponentV4;                                           // 0x08C0   (0x0008)  
	UQuestSystemComp_C*                                QuestSystemComp;                                            // 0x08C8   (0x0008)  
	UADSDialoguePartecipantComponent*                  ADSDialoguePartecipant;                                     // 0x08D0   (0x0008)  
	UBPC_TAAManager_C*                                 BPC_TAAManager;                                             // 0x08D8   (0x0008)  
	USGInventoryWorker_C*                              SGInventoryWorker;                                          // 0x08E0   (0x0008)  
	UFMODAudioComponent*                               _breath_stealth_aim_idle;                                   // 0x08E8   (0x0008)  
	UFMODAudioComponent*                               _breath_idle;                                               // 0x08F0   (0x0008)  
	USpringArmComponent*                               FlashlightArm;                                              // 0x08F8   (0x0008)  
	UBPC_AlarmSystem_C*                                BPC_AlarmSystem;                                            // 0x0900   (0x0008)  
	UChildActorComponent*                              NeckPercept;                                                // 0x0908   (0x0008)  
	UFootprintComponent_C*                             FootprintComponent;                                         // 0x0910   (0x0008)  
	ULocalPhycisContraint_C*                           LocalPhycisContraint;                                       // 0x0918   (0x0008)  
	UStaticMeshComponent*                              SecondarySM;                                                // 0x0920   (0x0008)  
	UStaticMeshComponent*                              PrimarySM;                                                  // 0x0928   (0x0008)  
	UStaticMeshComponent*                              SecondaryPhysicsSM;                                         // 0x0930   (0x0008)  
	UStaticMeshComponent*                              PrimaryPhysicsSM;                                           // 0x0938   (0x0008)  
	UPhysicsConstraintComponent*                       UpperBack1PC;                                               // 0x0940   (0x0008)  
	UPhysicsConstraintComponent*                       UpperBack2PC;                                               // 0x0948   (0x0008)  
	UStaticMeshComponent*                              UpperBack2Root;                                             // 0x0950   (0x0008)  
	UStaticMeshComponent*                              UpperBack1Root;                                             // 0x0958   (0x0008)  
	UStaticMeshComponent*                              WeaponSlots;                                                // 0x0960   (0x0008)  
	UStaticMeshComponent*                              Pistol;                                                     // 0x0968   (0x0008)  
	UBP_CampClient_C*                                  BP_CampClient;                                              // 0x0970   (0x0008)  
	UWoundComponent_C*                                 WoundComponentPants;                                        // 0x0978   (0x0008)  
	UWoundComponent_C*                                 WoundComponentArmor;                                        // 0x0980   (0x0008)  
	UWoundComponent_C*                                 WoundComponentOuterwear;                                    // 0x0988   (0x0008)  
	UWoundComponent_C*                                 WoundComponentHelmet;                                       // 0x0990   (0x0008)  
	UWoundComponent_C*                                 WoundComponentHair;                                         // 0x0998   (0x0008)  
	UWoundComponent_C*                                 WoundComponentHead;                                         // 0x09A0   (0x0008)  
	USkeletalMeshComponent*                            BackpackSlot;                                               // 0x09A8   (0x0008)  
	USpawnManagerChild_C*                              SpawnManagerChild;                                          // 0x09B0   (0x0008)  
	UParticleSystemComponent*                          ParticleSystem;                                             // 0x09B8   (0x0008)  
	UAIPerceptionStimuliSourceComponent*               AIPerceptionStimuliSource;                                  // 0x09C0   (0x0008)  
	USpotLightComponent*                               flashlight;                                                 // 0x09C8   (0x0008)  
	USceneComponent*                                   FlashlightHolder;                                           // 0x09D0   (0x0008)  
	UBP_TrailComponent_C*                              PerceptActor;                                               // 0x09D8   (0x0008)  
	USkeletalMeshComponent*                            Hair2;                                                      // 0x09E0   (0x0008)  
	USkeletalMeshComponent*                            Hair1;                                                      // 0x09E8   (0x0008)  
	USkeletalMeshComponent*                            OuterwearSlot;                                              // 0x09F0   (0x0008)  
	USkeletalMeshComponent*                            PantsSlot;                                                  // 0x09F8   (0x0008)  
	USkeletalMeshComponent*                            HelmetSlot;                                                 // 0x0A00   (0x0008)  
	USkeletalMeshComponent*                            ArmorSlot;                                                  // 0x0A08   (0x0008)  
	UBPC_Equipment_C*                                  BPC_Equipment;                                              // 0x0A10   (0x0008)  
	float                                              InventoryOpenTimeline_Alpha_0D552CD3483F465436E2D395614F6698; // 0x0A18   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    InventoryOpenTimeline__Direction_0D552CD3483F465436E2D395614F6698; // 0x0A1C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0A1D   (0x0003)  MISSED
	UTimelineComponent*                                InventoryOpenTimeline;                                      // 0x0A20   (0x0008)  
	float                                              ZoomGpsOffset_NewTrack_0_F16046D9475E3F9E4D62E0B91BFB8F76;  // 0x0A28   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    ZoomGpsOffset__Direction_F16046D9475E3F9E4D62E0B91BFB8F76;  // 0x0A2C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0A2D   (0x0003)  MISSED
	UTimelineComponent*                                ZoomGpsOffset;                                              // 0x0A30   (0x0008)  
	float                                              ZoomGpsTL_NewTrack_0_76930A324240D4BB48A1EC939B450BFD;      // 0x0A38   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    ZoomGpsTL__Direction_76930A324240D4BB48A1EC939B450BFD;      // 0x0A3C   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0A3D   (0x0003)  MISSED
	UTimelineComponent*                                ZoomGpsTL;                                                  // 0x0A40   (0x0008)  
	FVector                                            CrouchingWeaponOffsetTimeline_TPP_8596FEEC4522E8EF541DEBB9F5364653; // 0x0A48   (0x0018)  
	FVector                                            CrouchingWeaponOffsetTimeline_FPP_8596FEEC4522E8EF541DEBB9F5364653; // 0x0A60   (0x0018)  
	TEnumAsByte<ETimelineDirection>                    CrouchingWeaponOffsetTimeline__Direction_8596FEEC4522E8EF541DEBB9F5364653; // 0x0A78   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x0A79   (0x0007)  MISSED
	UTimelineComponent*                                CrouchingWeaponOffsetTimeline;                              // 0x0A80   (0x0008)  
	float                                              Timeline_5_MinusStep_AB5EDB5449E8A99969AB0D98804B65D2;      // 0x0A88   (0x0004)  
	float                                              Timeline_5_PlusStep_AB5EDB5449E8A99969AB0D98804B65D2;       // 0x0A8C   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_5__Direction_AB5EDB5449E8A99969AB0D98804B65D2;     // 0x0A90   (0x0001)  
	unsigned char                                      UnknownData04_5[0x7];                                       // 0x0A91   (0x0007)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x0A98   (0x0008)  
	float                                              Timeline_4_MinusStep_AF9523B64D162AD9062C1088AD0A0F37;      // 0x0AA0   (0x0004)  
	float                                              Timeline_4_PlusStep_AF9523B64D162AD9062C1088AD0A0F37;       // 0x0AA4   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_4__Direction_AF9523B64D162AD9062C1088AD0A0F37;     // 0x0AA8   (0x0001)  
	unsigned char                                      UnknownData05_5[0x7];                                       // 0x0AA9   (0x0007)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x0AB0   (0x0008)  
	float                                              Timeline_3_MinusStep_FF79EBD5449BBDFB00C2E09DBB8C4A99;      // 0x0AB8   (0x0004)  
	float                                              Timeline_3_PlusStep_FF79EBD5449BBDFB00C2E09DBB8C4A99;       // 0x0ABC   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_3__Direction_FF79EBD5449BBDFB00C2E09DBB8C4A99;     // 0x0AC0   (0x0001)  
	unsigned char                                      UnknownData06_5[0x7];                                       // 0x0AC1   (0x0007)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x0AC8   (0x0008)  
	float                                              Timeline_MinusStep_ADE4E7A14E7F37E8EB76518D4ACB3E27;        // 0x0AD0   (0x0004)  
	float                                              Timeline_PlusStep_ADE4E7A14E7F37E8EB76518D4ACB3E27;         // 0x0AD4   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline__Direction_ADE4E7A14E7F37E8EB76518D4ACB3E27;       // 0x0AD8   (0x0001)  
	unsigned char                                      UnknownData07_5[0x7];                                       // 0x0AD9   (0x0007)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x0AE0   (0x0008)  
	float                                              StepZoom_MinusStep_22D1EB3A47026D398A712F97C3B4CD1C;        // 0x0AE8   (0x0004)  
	float                                              StepZoom_PlusStep_22D1EB3A47026D398A712F97C3B4CD1C;         // 0x0AEC   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    StepZoom__Direction_22D1EB3A47026D398A712F97C3B4CD1C;       // 0x0AF0   (0x0001)  
	unsigned char                                      UnknownData08_5[0x7];                                       // 0x0AF1   (0x0007)  MISSED
	UTimelineComponent*                                StepZoom;                                                   // 0x0AF8   (0x0008)  
	FVector                                            FPPAimingTimeline_PosOffset_598E03BA48E7AA7161D8DF82FCE7AA94; // 0x0B00   (0x0018)  
	TEnumAsByte<ETimelineDirection>                    FPPAimingTimeline__Direction_598E03BA48E7AA7161D8DF82FCE7AA94; // 0x0B18   (0x0001)  
	unsigned char                                      UnknownData09_5[0x7];                                       // 0x0B19   (0x0007)  MISSED
	UTimelineComponent*                                FPPAimingTimeline;                                          // 0x0B20   (0x0008)  
	float                                              TimelineRoundProgressBar_Value_104D1EB246CFE05F6BC415A3852AB95F; // 0x0B28   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    TimelineRoundProgressBar__Direction_104D1EB246CFE05F6BC415A3852AB95F; // 0x0B2C   (0x0001)  
	unsigned char                                      UnknownData10_5[0x3];                                       // 0x0B2D   (0x0003)  MISSED
	UTimelineComponent*                                TimelineRoundProgressBar;                                   // 0x0B30   (0x0008)  
	float                                              Timeline_2_Alpha_605DDD0B45EAF290B8305B8955E406E5;          // 0x0B38   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_2__Direction_605DDD0B45EAF290B8305B8955E406E5;     // 0x0B3C   (0x0001)  
	unsigned char                                      UnknownData11_5[0x3];                                       // 0x0B3D   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x0B40   (0x0008)  
	float                                              StandingPitchOffsetIfAim_Alpha_AAA5D8FD41D97A76DB7660BF124ADECE; // 0x0B48   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    StandingPitchOffsetIfAim__Direction_AAA5D8FD41D97A76DB7660BF124ADECE; // 0x0B4C   (0x0001)  
	unsigned char                                      UnknownData12_5[0x3];                                       // 0x0B4D   (0x0003)  MISSED
	UTimelineComponent*                                StandingPitchOffsetIfAim;                                   // 0x0B50   (0x0008)  
	float                                              ReverseCtiticalDamage_Alpha_B1C0DBCF4A2A6CB7DED66BA0F8E8B840; // 0x0B58   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    ReverseCtiticalDamage__Direction_B1C0DBCF4A2A6CB7DED66BA0F8E8B840; // 0x0B5C   (0x0001)  
	unsigned char                                      UnknownData13_5[0x3];                                       // 0x0B5D   (0x0003)  MISSED
	UTimelineComponent*                                ReverseCtiticalDamage;                                      // 0x0B60   (0x0008)  
	float                                              ApplyCriticalHealthEffect_Alpha_248CC6F74F49976102E37D8E3465ECFE; // 0x0B68   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    ApplyCriticalHealthEffect__Direction_248CC6F74F49976102E37D8E3465ECFE; // 0x0B6C   (0x0001)  
	unsigned char                                      UnknownData14_5[0x3];                                       // 0x0B6D   (0x0003)  MISSED
	UTimelineComponent*                                ApplyCriticalHealthEffect;                                  // 0x0B70   (0x0008)  
	float                                              Food_Water_Timeline_Lerp_BDE0461C49A0C1ABE61BF092C7BE3949;  // 0x0B78   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Food_Water_Timeline__Direction_BDE0461C49A0C1ABE61BF092C7BE3949; // 0x0B7C   (0x0001)  
	unsigned char                                      UnknownData15_5[0x3];                                       // 0x0B7D   (0x0003)  MISSED
	UTimelineComponent*                                Food_Water_Timeline;                                        // 0x0B80   (0x0008)  
	float                                              Timeline_0_Alpha_FD98DB784BA58F75186AD4A5AE18FD83;          // 0x0B88   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_0__Direction_FD98DB784BA58F75186AD4A5AE18FD83;     // 0x0B8C   (0x0001)  
	unsigned char                                      UnknownData16_5[0x3];                                       // 0x0B8D   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x0B90   (0x0008)  
	float                                              CrouchPitchOffsetIfAim_Alpha_309DEB5540B9A8CB2AF1198AFAB6F9A4; // 0x0B98   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    CrouchPitchOffsetIfAim__Direction_309DEB5540B9A8CB2AF1198AFAB6F9A4; // 0x0B9C   (0x0001)  
	unsigned char                                      UnknownData17_5[0x3];                                       // 0x0B9D   (0x0003)  MISSED
	UTimelineComponent*                                CrouchPitchOffsetIfAim;                                     // 0x0BA0   (0x0008)  
	float                                              WeaponLerpToCamera_Alpha_9FB5FA2E4DAC3AD991EB8BB4E2FCFBDC;  // 0x0BA8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    WeaponLerpToCamera__Direction_9FB5FA2E4DAC3AD991EB8BB4E2FCFBDC; // 0x0BAC   (0x0001)  
	unsigned char                                      UnknownData18_5[0x3];                                       // 0x0BAD   (0x0003)  MISSED
	UTimelineComponent*                                WeaponLerpToCamera;                                         // 0x0BB0   (0x0008)  
	float                                              DrunkLerpTimeline_Lerp_E2ABB22B478363CAD9F965A492C4228C;    // 0x0BB8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    DrunkLerpTimeline__Direction_E2ABB22B478363CAD9F965A492C4228C; // 0x0BBC   (0x0001)  
	unsigned char                                      UnknownData19_5[0x3];                                       // 0x0BBD   (0x0003)  MISSED
	UTimelineComponent*                                DrunkLerpTimeline;                                          // 0x0BC0   (0x0008)  
	float                                              subSpecular_Specular_492A2C9041B4BE2B1F9600997169C5D3;      // 0x0BC8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    subSpecular__Direction_492A2C9041B4BE2B1F9600997169C5D3;    // 0x0BCC   (0x0001)  
	unsigned char                                      UnknownData20_5[0x3];                                       // 0x0BCD   (0x0003)  MISSED
	UTimelineComponent*                                subSpecular;                                                // 0x0BD0   (0x0008)  
	float                                              addSpecular_Specular_C281FEFD490A8C0C078B3B9F5199D966;      // 0x0BD8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    addSpecular__Direction_C281FEFD490A8C0C078B3B9F5199D966;    // 0x0BDC   (0x0001)  
	unsigned char                                      UnknownData21_5[0x3];                                       // 0x0BDD   (0x0003)  MISSED
	UTimelineComponent*                                addSpecular;                                                // 0x0BE0   (0x0008)  
	float                                              Timeline_1_NewTrack_0_5F3164A24415440657770EA588273E3D;     // 0x0BE8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_1__Direction_5F3164A24415440657770EA588273E3D;     // 0x0BEC   (0x0001)  
	unsigned char                                      UnknownData22_5[0x3];                                       // 0x0BED   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x0BF0   (0x0008)  
	float                                              HealPPEffectTimeline_Value_348BF1474C2A25BCE6CD1F9848BEFE41; // 0x0BF8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    HealPPEffectTimeline__Direction_348BF1474C2A25BCE6CD1F9848BEFE41; // 0x0BFC   (0x0001)  
	unsigned char                                      UnknownData23_5[0x3];                                       // 0x0BFD   (0x0003)  MISSED
	UTimelineComponent*                                HealPPEffectTimeline;                                       // 0x0C00   (0x0008)  
	float                                              KillPPEffectTimeline_Value_337A9F5C4A0B548F36628AA137A19FA1; // 0x0C08   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    KillPPEffectTimeline__Direction_337A9F5C4A0B548F36628AA137A19FA1; // 0x0C0C   (0x0001)  
	unsigned char                                      UnknownData24_5[0x3];                                       // 0x0C0D   (0x0003)  MISSED
	UTimelineComponent*                                KillPPEffectTimeline;                                       // 0x0C10   (0x0008)  
	float                                              DamageCameraEffects_Timer_2ACA4AC949FC90C95D646C9371AFBB35; // 0x0C18   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    DamageCameraEffects__Direction_2ACA4AC949FC90C95D646C9371AFBB35; // 0x0C1C   (0x0001)  
	unsigned char                                      UnknownData25_5[0x3];                                       // 0x0C1D   (0x0003)  MISSED
	UTimelineComponent*                                DamageCameraEffects;                                        // 0x0C20   (0x0008)  
	float                                              SprintAccelTimeline_NewTrack_0_7DAFCF24433D791EF122378A18118860; // 0x0C28   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    SprintAccelTimeline__Direction_7DAFCF24433D791EF122378A18118860; // 0x0C2C   (0x0001)  
	unsigned char                                      UnknownData26_5[0x3];                                       // 0x0C2D   (0x0003)  MISSED
	UTimelineComponent*                                SprintAccelTimeline;                                        // 0x0C30   (0x0008)  
	float                                              CameraLerpSpring_CameraAlpha_AC22FE9D45845585B98DF79542149C69; // 0x0C38   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    CameraLerpSpring__Direction_AC22FE9D45845585B98DF79542149C69; // 0x0C3C   (0x0001)  
	unsigned char                                      UnknownData27_5[0x3];                                       // 0x0C3D   (0x0003)  MISSED
	UTimelineComponent*                                CameraLerpSpring;                                           // 0x0C40   (0x0008)  
	UAnimInstance*                                     Animator;                                                   // 0x0C48   (0x0008)  
	bool                                               IsAiming;                                                   // 0x0C50   (0x0001)  
	bool                                               IsGrounded;                                                 // 0x0C51   (0x0001)  
	unsigned char                                      UnknownData28_5[0x6];                                       // 0x0C52   (0x0006)  MISSED
	FVector2D                                          RotationInput;                                              // 0x0C58   (0x0010)  
	FRotator                                           TargetRotation;                                             // 0x0C68   (0x0018)  
	TEnumAsByte<MovementType>                          PreviousMoveType;                                           // 0x0C80   (0x0001)  
	TEnumAsByte<MovementType>                          MovementType;                                               // 0x0C81   (0x0001)  
	unsigned char                                      UnknownData29_5[0x6];                                       // 0x0C82   (0x0006)  MISSED
	double                                             WalkFSpeed;                                                 // 0x0C88   (0x0008)  
	double                                             WalkFRLSpeed;                                               // 0x0C90   (0x0008)  
	double                                             WalkBRLSpeed;                                               // 0x0C98   (0x0008)  
	double                                             WalkBSpeed;                                                 // 0x0CA0   (0x0008)  
	double                                             JogFSpeed;                                                  // 0x0CA8   (0x0008)  
	double                                             JogBSpeed;                                                  // 0x0CB0   (0x0008)  
	double                                             JogFRLSpeed;                                                // 0x0CB8   (0x0008)  
	double                                             JogBRLSpeed;                                                // 0x0CC0   (0x0008)  
	double                                             CrouchSpeed;                                                // 0x0CC8   (0x0008)  
	double                                             RunSpeed;                                                   // 0x0CD0   (0x0008)  
	TEnumAsByte<StanceState>                           StanceType;                                                 // 0x0CD8   (0x0001)  
	unsigned char                                      UnknownData30_5[0x7];                                       // 0x0CD9   (0x0007)  MISSED
	double                                             TimeDilation;                                               // 0x0CE0   (0x0008)  
	double                                             JogAccel;                                                   // 0x0CE8   (0x0008)  
	double                                             JogDecel;                                                   // 0x0CF0   (0x0008)  
	double                                             WalkAccel;                                                  // 0x0CF8   (0x0008)  
	double                                             WalkDecel;                                                  // 0x0D00   (0x0008)  
	double                                             RunAccel;                                                   // 0x0D08   (0x0008)  
	double                                             RunDecel;                                                   // 0x0D10   (0x0008)  
	TEnumAsByte<BPE_Weapon_Type>                       WeaponType;                                                 // 0x0D18   (0x0001)  
	unsigned char                                      UnknownData31_5[0x7];                                       // 0x0D19   (0x0007)  MISSED
	double                                             DefaultSpringLength;                                        // 0x0D20   (0x0008)  
	double                                             AimSpringLength;                                            // 0x0D28   (0x0008)  
	UCurveFloat*                                       AimCameraLerpCurve;                                         // 0x0D30   (0x0008)  
	UCurveFloat*                                       SprintCameraLerpCurve;                                      // 0x0D38   (0x0008)  
	FCameraSettings                                    CurrentCameraSettings;                                      // 0x0D40   (0x0028)  
	FCameraSettings                                    SprintCameraSettings;                                       // 0x0D68   (0x0028)  
	FCameraSettings                                    AimCameraSettings;                                          // 0x0D90   (0x0028)  
	FCameraSettings                                    DefaultCameraSettings;                                      // 0x0DB8   (0x0028)  
	UCurveFloat*                                       CurrentCurve;                                               // 0x0DE0   (0x0008)  
	double                                             MoveInput_VelocityDiff;                                     // 0x0DE8   (0x0008)  
	TArray<FSBP_ItemsData>                             Inventory;                                                  // 0x0DF0   (0x0010)  
	bool                                               InCar;                                                      // 0x0E00   (0x0001)  
	TEnumAsByte<CardinalDirections>                    CardinalDirection;                                          // 0x0E01   (0x0001)  
	unsigned char                                      UnknownData32_5[0x6];                                       // 0x0E02   (0x0006)  MISSED
	double                                             RotationOffset;                                             // 0x0E08   (0x0008)  
	UCurveVector*                                      RotationLerpCurve;                                          // 0x0E10   (0x0008)  
	FCameraSettings                                    CrouchCameraSettings;                                       // 0x0E18   (0x0028)  
	FCameraSettings                                    AimCrouchCameraSettings;                                    // 0x0E40   (0x0028)  
	FCameraSettings                                    AimCrouchCameraSettings;                                    // 0x0E68   (0x0028)  
	FCharSpeedSettings                                 CharSpeedSettings;                                          // 0x0E90   (0x00B8)  
	bool                                               SprintPressed;                                              // 0x0F48   (0x0001)  
	unsigned char                                      UnknownData33_5[0x7];                                       // 0x0F49   (0x0007)  MISSED
	FMulticastInlineDelegate                           AmmoChangedEvent;                                           // 0x0F50   (0x0010)  
	FMulticastInlineDelegate                           AimStateEvent;                                              // 0x0F60   (0x0010)  
	FMulticastInlineDelegate                           ShootEvent;                                                 // 0x0F70   (0x0010)  
	FMulticastInlineDelegate                           ShootHitEvent;                                              // 0x0F80   (0x0010)  
	FMulticastInlineDelegate                           ReloadEvent;                                                // 0x0F90   (0x0010)  
	FMulticastInlineDelegate                           InCarEvent;                                                 // 0x0FA0   (0x0010)  
	bool                                               AimPressed;                                                 // 0x0FB0   (0x0001)  
	bool                                               isShooting;                                                 // 0x0FB1   (0x0001)  
	bool                                               IsReloading;                                                // 0x0FB2   (0x0001)  
	unsigned char                                      UnknownData34_5[0x5];                                       // 0x0FB3   (0x0005)  MISSED
	FVector                                            NormalDirection;                                            // 0x0FB8   (0x0018)  
	bool                                               CanSprint;                                                  // 0x0FD0   (0x0001)  
	unsigned char                                      UnknownData35_5[0x7];                                       // 0x0FD1   (0x0007)  MISSED
	FRotator                                           SyncedRotation;                                             // 0x0FD8   (0x0018)  
	bool                                               InventoryOpened;                                            // 0x0FF0   (0x0001)  
	bool                                               IsPassenger;                                                // 0x0FF1   (0x0001)  
	unsigned char                                      UnknownData36_5[0x6];                                       // 0x0FF2   (0x0006)  MISSED
	UUIW_PlayerMain_C*                                 PlayerGUI;                                                  // 0x0FF8   (0x0008)  
	FTimerHandle                                       PressInteractTimerHandle;                                   // 0x1000   (0x0008)  
	bool                                               CanInteract;                                                // 0x1008   (0x0001)  
	unsigned char                                      UnknownData37_5[0x7];                                       // 0x1009   (0x0007)  MISSED
	double                                             LateTime;                                                   // 0x1010   (0x0008)  
	TEnumAsByte<E_InteractType>                        InteractType;                                               // 0x1018   (0x0001)  
	unsigned char                                      UnknownData38_5[0x7];                                       // 0x1019   (0x0007)  MISSED
	FMulticastInlineDelegate                           LateInteractStart;                                          // 0x1020   (0x0010)  
	FMulticastInlineDelegate                           LateInteractFinish;                                         // 0x1030   (0x0010)  
	FMulticastInlineDelegate                           LateInteractCancel;                                         // 0x1040   (0x0010)  
	double                                             ViewPitchMin;                                               // 0x1050   (0x0008)  
	double                                             ViewPitchMax;                                               // 0x1058   (0x0008)  
	FName                                              PelvisBone;                                                 // 0x1060   (0x0008)  
	bool                                               LootPointOpened;                                            // 0x1068   (0x0001)  
	bool                                               PrepareAim;                                                 // 0x1069   (0x0001)  
	unsigned char                                      UnknownData39_5[0x6];                                       // 0x106A   (0x0006)  MISSED
	FTimerHandle                                       PressDurabilityButtonTimerHandle;                           // 0x1070   (0x0008)  
	FMulticastInlineDelegate                           DurabilityButtonStart;                                      // 0x1078   (0x0010)  
	FMulticastInlineDelegate                           DurabilityButtonFinish;                                     // 0x1088   (0x0010)  
	FMulticastInlineDelegate                           DurabilityButtonCancel;                                     // 0x1098   (0x0010)  
	USoundCue*                                         StepSounds;                                                 // 0x10A8   (0x0008)  
	ABP_Canister_C*                                    AttachedCanister;                                           // 0x10B0   (0x0008)  
	FTimerHandle                                       PressFuelButtonTimerHandle;                                 // 0x10B8   (0x0008)  
	FMulticastInlineDelegate                           FuelButtonStart;                                            // 0x10C0   (0x0010)  
	FMulticastInlineDelegate                           FuelButtonFinish;                                           // 0x10D0   (0x0010)  
	FMulticastInlineDelegate                           FuelButtonCancel;                                           // 0x10E0   (0x0010)  
	bool                                               BattleMode;                                                 // 0x10F0   (0x0001)  
	unsigned char                                      UnknownData40_5[0x7];                                       // 0x10F1   (0x0007)  MISSED
	UMPInGameInventory_C*                              InventoryRef;                                               // 0x10F8   (0x0008)  
	UJSIContainer_C*                                   BackpackContainer;                                          // 0x1100   (0x0008)  
	UJSIContainer_C*                                   SkillContainer;                                             // 0x1108   (0x0008)  
	UJSIContainer_C*                                   ArmorContainer;                                             // 0x1110   (0x0008)  
	UJSIContainer_C*                                   OutfitContainer;                                            // 0x1118   (0x0008)  
	UJSIContainer_C*                                   PantsContainer;                                             // 0x1120   (0x0008)  
	AStatM_MainPickupClass_C*                          InteractingItem;                                            // 0x1128   (0x0008)  
	FEquipmentStatus                                   EquipmentStatus;                                            // 0x1130   (0x000B)  
	TEnumAsByte<PlayerSlots>                           CurrentActiveSlot;                                          // 0x113B   (0x0001)  
	unsigned char                                      UnknownData41_5[0x4];                                       // 0x113C   (0x0004)  MISSED
	UJSI_Slot_C*                                       JSISlotPrimaryWeapon;                                       // 0x1140   (0x0008)  
	UJSI_Slot_C*                                       MeleeWeaponSlot;                                            // 0x1148   (0x0008)  
	UJSI_Slot_C*                                       JSISlotSecondaryWeapon;                                     // 0x1150   (0x0008)  
	UJSI_Slot_C*                                       JSISlotPistolWeapon;                                        // 0x1158   (0x0008)  
	TArray<FContainerPickupsInfo>                      ContainersData;                                             // 0x1160   (0x0010)  
	TArray<FContainerPickupsInfo>                      ContainerItems;                                             // 0x1170   (0x0010)  
	TArray<UJSIContainer_C*>                           DynamicContainers;                                          // 0x1180   (0x0010)  
	AMPMainContainerBox_C*                             CurrentFocusedContainer;                                    // 0x1190   (0x0008)  
	UJSIContainer_C*                                   MPContainerWidget;                                          // 0x1198   (0x0008)  
	AA_Item_C*                                         CurrentFocusedItem;                                         // 0x11A0   (0x0008)  
	FTimerHandle                                       WaitToUIDHandle;                                            // 0x11A8   (0x0008)  
	bool                                               IsDriver;                                                   // 0x11B0   (0x0001)  
	unsigned char                                      UnknownData42_5[0x7];                                       // 0x11B1   (0x0007)  MISSED
	double                                             CameraCurrentFOV;                                           // 0x11B8   (0x0008)  
	double                                             MoveRightAxis;                                              // 0x11C0   (0x0008)  
	double                                             MoveForwardAxis;                                            // 0x11C8   (0x0008)  
	double                                             CurrentCameraLagMaxDistance;                                // 0x11D0   (0x0008)  
	TArray<AHouseBox_C*>                               HouseBoxes;                                                 // 0x11D8   (0x0010)  
	ALevelStreamer_C*                                  LevelStreamer;                                              // 0x11E8   (0x0008)  
	bool                                               TakingDamage;                                               // 0x11F0   (0x0001)  
	unsigned char                                      UnknownData43_5[0x7];                                       // 0x11F1   (0x0007)  MISSED
	FVector                                            LastHitLocation;                                            // 0x11F8   (0x0018)  
	UAnimMontage*                                      LastPlayingPainMontage;                                     // 0x1210   (0x0008)  
	FVector                                            EntrancePoint;                                              // 0x1218   (0x0018)  
	bool                                               InBunker;                                                   // 0x1230   (0x0001)  
	unsigned char                                      UnknownData44_5[0x7];                                       // 0x1231   (0x0007)  MISSED
	FTimerHandle                                       BunkerEntranceHandle;                                       // 0x1238   (0x0008)  
	UJSI_Slot_C*                                       JSISlotHelmet;                                              // 0x1240   (0x0008)  
	UJSI_Slot_C*                                       JSISlotArmor;                                               // 0x1248   (0x0008)  
	UObject*                                           BigMapWidget;                                               // 0x1250   (0x0008)  
	APawn*                                             Vehicle;                                                    // 0x1258   (0x0008)  
	FVector                                            MeleeSwingBegin;                                            // 0x1260   (0x0018)  
	FVector                                            MeleeSwingEnd;                                              // 0x1278   (0x0018)  
	TScriptInterface<BlueprintGeneratedClass>          QuestEventListener;                                         // 0x1290   (0x0010)  
	bool                                               RefillOil;                                                  // 0x12A0   (0x0001)  
	bool                                               AllowRefillOil;                                             // 0x12A1   (0x0001)  
	unsigned char                                      UnknownData45_5[0x6];                                       // 0x12A2   (0x0006)  MISSED
	USceneComponent*                                   GasolineSocket;                                             // 0x12A8   (0x0008)  
	bool                                               CanSkipDamageAnim;                                          // 0x12B0   (0x0001)  
	unsigned char                                      UnknownData46_5[0x7];                                       // 0x12B1   (0x0007)  MISSED
	TScriptInterface<BlueprintGeneratedClass>          PlayerListener;                                             // 0x12B8   (0x0010)  
	ASurvivalPlayer_C*                                 Qostuil;                                                    // 0x12C8   (0x0008)  
	TArray<FContainerPickupsInfo>                      RequestsForUID;                                             // 0x12D0   (0x0010)  
	bool                                               IsUsingItem;                                                // 0x12E0   (0x0001)  
	unsigned char                                      UnknownData47_5[0x7];                                       // 0x12E1   (0x0007)  MISSED
	TArray<UEffectMain_C*>                             Effects;                                                    // 0x12E8   (0x0010)  
	TArray<UJSI_Slot_C*>                               RequestsForUID_Slots;                                       // 0x12F8   (0x0010)  
	FCameraSettings                                    InHouseCameraSettings;                                      // 0x1308   (0x0028)  
	TArray<TScriptInterface>                           PlayerListeners;                                            // 0x1330   (0x0010)  
	FCameraSettings                                    InCarCameraSettings;                                        // 0x1340   (0x0028)  
	bool                                               LocalPlayer;                                                // 0x1368   (0x0001)  
	unsigned char                                      UnknownData48_5[0x7];                                       // 0x1369   (0x0007)  MISSED
	TArray<bool>                                       _;                                                          // 0x1370   (0x0010)  
	bool                                               InFirewatch;                                                // 0x1380   (0x0001)  
	unsigned char                                      UnknownData49_5[0x7];                                       // 0x1381   (0x0007)  MISSED
	UJSIContainer_C*                                   PocketContainer;                                            // 0x1388   (0x0008)  
	UClass*                                            CurrentCameraShake;                                         // 0x1390   (0x0008)  
	UCameraShakeBase*                                  LastCameraShake;                                            // 0x1398   (0x0008)  
	TMap<USkeletalMeshComponent*, FMaterialArray>      EquipmentMaterials;                                         // 0x13A0   (0x0050)  
	FName                                              ArmorName;                                                  // 0x13F0   (0x0008)  
	FName                                              OuterwearName;                                              // 0x13F8   (0x0008)  
	FName                                              BackpackName;                                               // 0x1400   (0x0008)  
	FName                                              HelmetName;                                                 // 0x1408   (0x0008)  
	ABP_FogController_C*                               FogController;                                              // 0x1410   (0x0008)  
	int32_t                                            PlayerIndex;                                                // 0x1418   (0x0004)  
	bool                                               IsDamageable;                                               // 0x141C   (0x0001)  
	unsigned char                                      UnknownData50_5[0x3];                                       // 0x141D   (0x0003)  MISSED
	FCameraSettings                                    NightSceneCameraSettings;                                   // 0x1420   (0x0028)  
	bool                                               InCutscene;                                                 // 0x1448   (0x0001)  
	unsigned char                                      UnknownData51_5[0x3];                                       // 0x1449   (0x0003)  MISSED
	int32_t                                            ToSlotIndex;                                                // 0x144C   (0x0004)  
	FMulticastInlineDelegate                           DeathEvent;                                                 // 0x1450   (0x0010)  
	TArray<FName>                                      JacketsToWearForTrailer;                                    // 0x1460   (0x0010)  
	TArray<int32_t>                                    ToWearIncrement;                                            // 0x1470   (0x0010)  
	TArray<FName>                                      HelmetsToWearForTrailer;                                    // 0x1480   (0x0010)  
	TArray<FName>                                      PantsToWearForTrailer;                                      // 0x1490   (0x0010)  
	TArray<FName>                                      StartItems;                                                 // 0x14A0   (0x0010)  
	double                                             MouseSense;                                                 // 0x14B0   (0x0008)  
	bool                                               DropItemsWhenDie;                                           // 0x14B8   (0x0001)  
	bool                                               IsEnabledInventorySync;                                     // 0x14B9   (0x0001)  
	unsigned char                                      UnknownData52_5[0x6];                                       // 0x14BA   (0x0006)  MISSED
	double                                             SpeedScale;                                                 // 0x14C0   (0x0008)  
	int64_t                                            CountFrags;                                                 // 0x14C8   (0x0008)  
	int32_t                                            CountDeaths;                                                // 0x14D0   (0x0004)  
	int32_t                                            HitCounter;                                                 // 0x14D4   (0x0004)  
	bool                                               ClimbPrepare;                                               // 0x14D8   (0x0001)  
	bool                                               Ragdoll;                                                    // 0x14D9   (0x0001)  
	unsigned char                                      UnknownData53_5[0x2];                                       // 0x14DA   (0x0002)  MISSED
	FName                                              PantsName;                                                  // 0x14DC   (0x0008)  
	FName                                              WeaponName;                                                 // 0x14E4   (0x0008)  
	bool                                               InventoryInited;                                            // 0x14EC   (0x0001)  
	unsigned char                                      UnknownData54_5[0x3];                                       // 0x14ED   (0x0003)  MISSED
	TArray<FName>                                      OnRessurectItems;                                           // 0x14F0   (0x0010)  
	AActor*                                            HighlightedActor;                                           // 0x1500   (0x0008)  
	UPDA_ChanceModifier_C*                             LootChanceModAsset;                                         // 0x1508   (0x0008)  
	TMap<TEnumAsByte, TEnumAsByte>                     DefaultCollisionResponse;                                   // 0x1510   (0x0050)  
	TArray<AA_Item_C*>                                 ItemsOnGround;                                              // 0x1560   (0x0010)  
	FMulticastInlineDelegate                           HouseEnterEvent;                                            // 0x1570   (0x0010)  
	FMulticastInlineDelegate                           HouseLeaveEvent;                                            // 0x1580   (0x0010)  
	int32_t                                            OnGroundSlotIndex;                                          // 0x1590   (0x0004)  
	unsigned char                                      UnknownData55_5[0x4];                                       // 0x1594   (0x0004)  MISSED
	FContainerPickupsInfo                              ItemInfo;                                                   // 0x1598   (0x0068)  
	AZombieTriggerSpawner_C*                           TriggerSpawner;                                             // 0x1600   (0x0008)  
	TEnumAsByte<EFootprintStyle>                       CurrentFootwear;                                            // 0x1608   (0x0001)  
	unsigned char                                      UnknownData56_5[0x3];                                       // 0x1609   (0x0003)  MISSED
	int32_t                                            SitIndex;                                                   // 0x160C   (0x0004)  
	double                                             UrovenShuma;                                                // 0x1610   (0x0008)  
	FTimerHandle                                       UrovenShumaTimer;                                           // 0x1618   (0x0008)  
	double                                             LootingHeight;                                              // 0x1620   (0x0008)  
	UJSIContainer_C*                                   OneContainerToRule;                                         // 0x1628   (0x0008)  
	int32_t                                            SitIndexTemp;                                               // 0x1630   (0x0004)  
	bool                                               InClimb;                                                    // 0x1634   (0x0001)  
	bool                                               IsInteracting;                                              // 0x1635   (0x0001)  
	unsigned char                                      UnknownData57_5[0x2];                                       // 0x1636   (0x0002)  MISSED
	TArray<FContainerPickupsInfo>                      ItemsToDelete;                                              // 0x1638   (0x0010)  
	TEnumAsByte<CraftState>                            CraftState;                                                 // 0x1648   (0x0001)  
	bool                                               InWater;                                                    // 0x1649   (0x0001)  
	unsigned char                                      UnknownData58_5[0x6];                                       // 0x164A   (0x0006)  MISSED
	double                                             FallingDamage;                                              // 0x1650   (0x0008)  
	bool                                               AimOnHold;                                                  // 0x1658   (0x0001)  
	unsigned char                                      UnknownData59_5[0x7];                                       // 0x1659   (0x0007)  MISSED
	UObject*                                           ShopWidget;                                                 // 0x1660   (0x0008)  
	int32_t                                            CashMoney;                                                  // 0x1668   (0x0004)  
	unsigned char                                      UnknownData60_5[0x4];                                       // 0x166C   (0x0004)  MISSED
	TArray<UJSI_Slot_C*>                               ItemsToTrade;                                               // 0x1670   (0x0010)  
	bool                                               UseRadio;                                                   // 0x1680   (0x0001)  
	bool                                               AllowVoice;                                                 // 0x1681   (0x0001)  
	unsigned char                                      UnknownData61_5[0x6];                                       // 0x1682   (0x0006)  MISSED
	UJSI_Slot_C*                                       JSISlotBackpack;                                            // 0x1688   (0x0008)  
	UJSI_Slot_C*                                       JSISlotOutfit;                                              // 0x1690   (0x0008)  
	UJSI_Slot_C*                                       JSISlotPants;                                               // 0x1698   (0x0008)  
	UJSI_Slot_C*                                       JSISlotPocket;                                              // 0x16A0   (0x0008)  
	bool                                               Sneaky;                                                     // 0x16A8   (0x0001)  
	bool                                               CanHoldWeapon;                                              // 0x16A9   (0x0001)  
	unsigned char                                      UnknownData62_5[0x6];                                       // 0x16AA   (0x0006)  MISSED
	ALootPoint_C*                                      LootPoint;                                                  // 0x16B0   (0x0008)  
	bool                                               NearlyLanded;                                               // 0x16B8   (0x0001)  
	unsigned char                                      UnknownData63_5[0x7];                                       // 0x16B9   (0x0007)  MISSED
	double                                             InteractDistance;                                           // 0x16C0   (0x0008)  
	bool                                               JumpAllowed;                                                // 0x16C8   (0x0001)  
	unsigned char                                      UnknownData64_5[0x7];                                       // 0x16C9   (0x0007)  MISSED
	AWalkableArea_C*                                   NewVar;                                                     // 0x16D0   (0x0008)  
	bool                                               CrouchAllowed;                                              // 0x16D8   (0x0001)  
	bool                                               PlayerHided;                                                // 0x16D9   (0x0001)  
	TEnumAsByte<E_QuestBackpackState>                  QuestBkPkState;                                             // 0x16DA   (0x0001)  
	TEnumAsByte<BinocularState>                        BinocularState;                                             // 0x16DB   (0x0001)  
	unsigned char                                      UnknownData65_5[0x4];                                       // 0x16DC   (0x0004)  MISSED
	TArray<FString>                                    CustomInputBlockers;                                        // 0x16E0   (0x0010)  
	bool                                               HighlightActors;                                            // 0x16F0   (0x0001)  
	unsigned char                                      UnknownData66_5[0x7];                                       // 0x16F1   (0x0007)  MISSED
	ASurvPC_C*                                         SurvPC;                                                     // 0x16F8   (0x0008)  
	AHouseBox_C*                                       BunkerHouseBox;                                             // 0x1700   (0x0008)  
	TArray<UW_Mark_C*>                                 HiddenQuestMarks;                                           // 0x1708   (0x0010)  
	bool                                               SurvPlayerBeginPlayFinished;                                // 0x1718   (0x0001)  
	unsigned char                                      UnknownData67_5[0x7];                                       // 0x1719   (0x0007)  MISSED
	UW_Mark_C*                                         TerminalMark;                                               // 0x1720   (0x0008)  
	UW_Mark_C*                                         BunkerEntryMark;                                            // 0x1728   (0x0008)  
	TArray<FVector>                                    BunkerMarksLocations;                                       // 0x1730   (0x0010)  
	TArray<UW_Mark_C*>                                 BunkerMarks;                                                // 0x1740   (0x0010)  
	FTimerHandle                                       BunkerCheckTimer;                                           // 0x1750   (0x0008)  
	bool                                               MarkInBunker;                                               // 0x1758   (0x0001)  
	unsigned char                                      UnknownData68_5[0x7];                                       // 0x1759   (0x0007)  MISSED
	TMap<TEnumAsByte, TEnumAsByte>                     DefaultCollisionResponse_Capsule;                           // 0x1760   (0x0050)  
	FFMODEventInstance                                 Reverb;                                                     // 0x17B0   (0x0008)  
	bool                                               IsPaused;                                                   // 0x17B8   (0x0001)  
	bool                                               ClientLeftGame_;                                            // 0x17B9   (0x0001)  
	unsigned char                                      UnknownData69_5[0x6];                                       // 0x17BA   (0x0006)  MISSED
	TArray<FDropItemEntry>                             ClientLeftLoot;                                             // 0x17C0   (0x0010)  
	double                                             TimeForAutoDestroy;                                         // 0x17D0   (0x0008)  
	FTimerHandle                                       DummyCharacterDestructionTimer;                             // 0x17D8   (0x0008)  
	TWeakObjectPtr<UFMODEvent*>                        BlizzardWarningSound;                                       // 0x17E0   (0x0030)  
	FVector                                            InputRightVector;                                           // 0x1810   (0x0018)  
	FVector                                            InputForwardVector;                                         // 0x1828   (0x0018)  
	double                                             Delta_Seconds;                                              // 0x1840   (0x0008)  
	double                                             MicrophoneLevel;                                            // 0x1848   (0x0008)  
	double                                             RecievedAudioLevel;                                         // 0x1850   (0x0008)  
	double                                             VoiceVolumeMultiplier;                                      // 0x1858   (0x0008)  
	bool                                               Crawling;                                                   // 0x1860   (0x0001)  
	unsigned char                                      UnknownData70_5[0x7];                                       // 0x1861   (0x0007)  MISSED
	APS_TDB_C*                                         PS_TDB;                                                     // 0x1868   (0x0008)  
	bool                                               InitialInventoryInited;                                     // 0x1870   (0x0001)  
	unsigned char                                      UnknownData71_5[0x7];                                       // 0x1871   (0x0007)  MISSED
	TMap<EItemType, double>                            ItemTypePlayRate;                                           // 0x1878   (0x0050)  
	FPoseSnapshot                                      Snapshot;                                                   // 0x18C8   (0x0038)  
	FVector                                            BunkerPlayerStart;                                          // 0x1900   (0x0018)  
	double                                             LootTimeMultiplier;                                         // 0x1918   (0x0008)  
	FMulticastInlineDelegate                           OnSprint;                                                   // 0x1920   (0x0010)  
	double                                             SprintSpeedMultiplier;                                      // 0x1930   (0x0008)  
	double                                             SwimSpeedMultiplier;                                        // 0x1938   (0x0008)  
	double                                             CrouchSpeedMultiplier;                                      // 0x1940   (0x0008)  
	ASurvivalPlayer_V2_C*                              Inviter;                                                    // 0x1948   (0x0008)  
	FWeightedBlendable                                 AimPP;                                                      // 0x1950   (0x0010)  
	bool                                               IsReadyToTrade;                                             // 0x1960   (0x0001)  
	unsigned char                                      UnknownData72_5[0x7];                                       // 0x1961   (0x0007)  MISSED
	TArray<FFItemInfo>                                 TradeItems;                                                 // 0x1968   (0x0010)  
	ASurvivalPlayer_C*                                 Trader;                                                     // 0x1978   (0x0008)  
	TWeakObjectPtr<USkeletalMesh*>                     DefaultLegs;                                                // 0x1980   (0x0030)  
	bool                                               EnoughSpaceForTrade;                                        // 0x19B0   (0x0001)  
	bool                                               CheckedForSpace;                                            // 0x19B1   (0x0001)  
	bool                                               EnoughSpaceLocally;                                         // 0x19B2   (0x0001)  
	unsigned char                                      UnknownData73_5[0x5];                                       // 0x19B3   (0x0005)  MISSED
	TWeakObjectPtr<USkeletalMesh*>                     DefaultBody;                                                // 0x19B8   (0x0030)  
	bool                                               BlockChangingCamera;                                        // 0x19E8   (0x0001)  
	char                                               DLSSMode;                                                   // 0x19E9   (0x0001)  
	unsigned char                                      UnknownData74_5[0x6];                                       // 0x19EA   (0x0006)  MISSED
	FText                                              DLSSModeTxt;                                                // 0x19F0   (0x0018)  
	int32_t                                            DLSSNumber;                                                 // 0x1A08   (0x0004)  
	unsigned char                                      UnknownData75_5[0x4];                                       // 0x1A0C   (0x0004)  MISSED
	UMaterialInstanceDynamic*                          AimPPMAterial;                                              // 0x1A10   (0x0008)  
	unsigned char                                      UnknownData76_5[0x8];                                       // 0x1A18   (0x0008)  MISSED
	FPostProcessSettings                               InitialPostProcessSettings;                                 // 0x1A20   (0x06E0)  
	FMulticastInlineDelegate                           DLSSModeChanged;                                            // 0x2100   (0x0010)  
	UMaterialInstanceDynamic*                          Drunk_PP_Material;                                          // 0x2110   (0x0008)  
	double                                             TempVar_Blur;                                               // 0x2118   (0x0008)  
	double                                             TempVar_Saturation;                                         // 0x2120   (0x0008)  
	bool                                               SevereIntoxication;                                         // 0x2128   (0x0001)  
	unsigned char                                      UnknownData77_5[0x7];                                       // 0x2129   (0x0007)  MISSED
	double                                             TempVarDrunk_Enabled;                                       // 0x2130   (0x0008)  
	bool                                               LoadInventoryFailed;                                        // 0x2138   (0x0001)  
	unsigned char                                      UnknownData78_5[0x7];                                       // 0x2139   (0x0007)  MISSED
	FRotator                                           BunkerPlayerStartRot;                                       // 0x2140   (0x0018)  
	UMaterialInstanceDynamic*                          CollimatorPP;                                               // 0x2158   (0x0008)  
	int32_t                                            ArmorTier;                                                  // 0x2160   (0x0004)  
	int32_t                                            HelmetTier;                                                 // 0x2164   (0x0004)  
	FMulticastInlineDelegate                           UpdateKDCounter;                                            // 0x2168   (0x0010)  
	UCurveFloat*                                       SensCurve;                                                  // 0x2178   (0x0008)  
	double                                             FovSenseMultiplier;                                         // 0x2180   (0x0008)  
	bool                                               BlockAim;                                                   // 0x2188   (0x0001)  
	unsigned char                                      UnknownData79_5[0x7];                                       // 0x2189   (0x0007)  MISSED
	double                                             ChangeDirectionAngle;                                       // 0x2190   (0x0008)  
	bool                                               IsDirectionChanged;                                         // 0x2198   (0x0001)  
	unsigned char                                      UnknownData80_5[0x3];                                       // 0x2199   (0x0003)  MISSED
	int32_t                                            NewDirection;                                               // 0x219C   (0x0004)  
	TEnumAsByte<PlayerSlots>                           PreviousActiveSlot;                                         // 0x21A0   (0x0001)  
	unsigned char                                      UnknownData81_5[0x7];                                       // 0x21A1   (0x0007)  MISSED
	FVector2D                                          MoveInputLastSended;                                        // 0x21A8   (0x0010)  
	UJSIContainer_C*                                   From__ContainerToContainer__;                               // 0x21B8   (0x0008)  
	UJSIContainer_C*                                   To__ContainerToContainer___;                                // 0x21C0   (0x0008)  
	UJSI_Slot_C*                                       From_Slot_Ref__ContainerToContainer__;                      // 0x21C8   (0x0008)  
	UJSI_Slot_C*                                       To_Slot_Ref__ContainerToContainer__;                        // 0x21D0   (0x0008)  
	UJSIContainer_C*                                   Container__OnSlotDoubleClick__;                             // 0x21D8   (0x0008)  
	UJSI_Slot_C*                                       Slot_Ref__OnSlotDoubleClick__;                              // 0x21E0   (0x0008)  
	UJSI_Slot_C*                                       Slot_Receiver__ItemsCombined__;                             // 0x21E8   (0x0008)  
	UJSI_Slot_C*                                       Slot_Dropped__ItemsCombined__;                              // 0x21F0   (0x0008)  
	UJSIContainer_C*                                   Container__MouseClickInPlayerInventory__;                   // 0x21F8   (0x0008)  
	UJSI_Slot_C*                                       Slot_Ref__MouseClickInPlayerInventory__;                    // 0x2200   (0x0008)  
	FContainerPickupsInfo                              Pickups_Info__MouseClickInPlayerInventory__;                // 0x2208   (0x0068)  
	TArray<FContainerPickupsInfo>                      Added_Data__MouseClickInPlayerInventory__;                  // 0x2270   (0x0010)  
	TArray<FContainerPickupsInfo>                      Added_Items__MouseClickInPlayerInventory__;                 // 0x2280   (0x0010)  
	int32_t                                            Slot_Index__MouseClickInPlayerInventory__;                  // 0x2290   (0x0004)  
	unsigned char                                      UnknownData82_5[0x4];                                       // 0x2294   (0x0004)  MISSED
	double                                             BrokenArmorCoef;                                            // 0x2298   (0x0008)  
	TArray<ASkylightModifier_C*>                       SkyLightModifiers;                                          // 0x22A0   (0x0010)  
	AWeaponPlaceholder_C*                              WeaponPlaceholderPrimary;                                   // 0x22B0   (0x0008)  
	AWeaponPlaceholder_C*                              WeaponPlaceholderSecondary;                                 // 0x22B8   (0x0008)  
	bool                                               IsKnockedDown;                                              // 0x22C0   (0x0001)  
	bool                                               IsKilled;                                                   // 0x22C1   (0x0001)  
	unsigned char                                      UnknownData83_5[0x2];                                       // 0x22C2   (0x0002)  MISSED
	int32_t                                            KnockdownCounter;                                           // 0x22C4   (0x0004)  
	UFMODEvent*                                        Sound_Event_Radial_Damage;                                  // 0x22C8   (0x0008)  
	FFMODEventInstance                                 ContusionFmodSnapshot;                                      // 0x22D0   (0x0008)  
	bool                                               TimerGranadeActive;                                         // 0x22D8   (0x0001)  
	bool                                               AimGrenade;                                                 // 0x22D9   (0x0001)  
	unsigned char                                      UnknownData84_5[0x6];                                       // 0x22DA   (0x0006)  MISSED
	AActor*                                            DeadBody;                                                   // 0x22E0   (0x0008)  
	bool                                               GrenadeSelected;                                            // 0x22E8   (0x0001)  
	unsigned char                                      UnknownData85_5[0x7];                                       // 0x22E9   (0x0007)  MISSED
	TArray<FFItemInfo>                                 DeadBodyItems;                                              // 0x22F0   (0x0010)  
	FFMODEventInstance                                 F_Contusion_Fmod;                                           // 0x2300   (0x0008)  
	bool                                               IsFireDamage;                                               // 0x2308   (0x0001)  
	bool                                               IsRadialDamage;                                             // 0x2309   (0x0001)  
	unsigned char                                      UnknownData86_5[0x6];                                       // 0x230A   (0x0006)  MISSED
	AWeaponPlaceholder_C*                              InitedWeaponPlaceholder;                                    // 0x2310   (0x0008)  
	FString                                            GrenadeWeaponNameEquip;                                     // 0x2318   (0x0010)  
	AFake_Grenade_C*                                   SpawningGrenade;                                            // 0x2328   (0x0008)  
	bool                                               IsDamageMolotov;                                            // 0x2330   (0x0001)  
	bool                                               ThrowGrenade;                                               // 0x2331   (0x0001)  
	unsigned char                                      UnknownData87_5[0x6];                                       // 0x2332   (0x0006)  MISSED
	UFMODEvent*                                        Sound_Event_Fire_Damage;                                    // 0x2338   (0x0008)  
	FFMODEventInstance                                 Contusion_F;                                                // 0x2340   (0x0008)  
	FWeaponUniqueInfo                                  CurrentWeaponItemInfo;                                      // 0x2348   (0x0028)  
	TEnumAsByte<Enum_PlayerState>                      PlayerStateBreathing;                                       // 0x2370   (0x0001)  
	unsigned char                                      UnknownData88_5[0x7];                                       // 0x2371   (0x0007)  MISSED
	AWeaponPlaceholder_C*                              TempWP;                                                     // 0x2378   (0x0008)  
	UFMODAudioComponent*                               FMODBreathingDefault;                                       // 0x2380   (0x0008)  
	UFMODEvent*                                        FModEventBreathingDefault;                                  // 0x2388   (0x0008)  
	UUIW_FlashGrenade_C*                               FlashWidjet;                                                // 0x2390   (0x0008)  
	bool                                               Contusion_;                                                 // 0x2398   (0x0001)  
	bool                                               ExplosionGrenadeInHand;                                     // 0x2399   (0x0001)  
	bool                                               BoomGrenadeInHand;                                          // 0x239A   (0x0001)  
	unsigned char                                      UnknownData89_5[0x5];                                       // 0x239B   (0x0005)  MISSED
	UMPInGameInventory_C*                              Inventory_Ref;                                              // 0x23A0   (0x0008)  
	FVector                                            CameraLocation;                                             // 0x23A8   (0x0018)  
	double                                             FrameWeight;                                                // 0x23C0   (0x0008)  
	double                                             Sharpen;                                                    // 0x23C8   (0x0008)  
	FTimerHandle                                       TimerStopFlashEffect;                                       // 0x23D0   (0x0008)  
	UMaterialInstanceDynamic*                          FlashMaterial;                                              // 0x23D8   (0x0008)  
	TArray<FString>                                    Familiarity;                                                // 0x23E0   (0x0010)  
	bool                                               FPSMode;                                                    // 0x23F0   (0x0001)  
	unsigned char                                      UnknownData90_5[0x7];                                       // 0x23F1   (0x0007)  MISSED
	double                                             DistanceToExplosion;                                        // 0x23F8   (0x0008)  
	UClass*                                            ShakeGrenadeMiddle;                                         // 0x2400   (0x0008)  
	UClass*                                            ShakeGrenadeF1;                                             // 0x2408   (0x0008)  
	double                                             DistanceNearShake;                                          // 0x2410   (0x0008)  
	UGrenadeF1ShakeDefault_C*                          GrenadeF1CameraShakeRef;                                    // 0x2418   (0x0008)  
	UClass*                                            ShakeGrenade333;                                            // 0x2420   (0x0008)  
	double                                             DistanceToExplosionLong;                                    // 0x2428   (0x0008)  
	double                                             DistanceToExplosionMiddle;                                  // 0x2430   (0x0008)  
	UClass*                                            ShakeGrenadeNear;                                           // 0x2438   (0x0008)  
	UClass*                                            CurrentGrenade;                                             // 0x2440   (0x0008)  
	ALootPoint_C*                                      DropBoxRef;                                                 // 0x2448   (0x0008)  
	TArray<UJSIContainer_C*>                           EquipContainers;                                            // 0x2450   (0x0010)  
	FMulticastInlineDelegate                           OnKnockdownStart;                                           // 0x2460   (0x0010)  
	bool                                               WeaponAimAnimFinished;                                      // 0x2470   (0x0001)  
	bool                                               IsDeathAnimEnded;                                           // 0x2471   (0x0001)  
	unsigned char                                      UnknownData91_5[0x6];                                       // 0x2472   (0x0006)  MISSED
	AWeaponPlaceholder_C*                              WeaponPlaceholderShadow;                                    // 0x2478   (0x0008)  
	bool                                               InCraftstation;                                             // 0x2480   (0x0001)  
	unsigned char                                      UnknownData92_5[0x7];                                       // 0x2481   (0x0007)  MISSED
	double                                             ResRadius;                                                  // 0x2488   (0x0008)  
	TEnumAsByte<EMovementMode>                         LastMovementMode;                                           // 0x2490   (0x0001)  
	unsigned char                                      UnknownData93_5[0x7];                                       // 0x2491   (0x0007)  MISSED
	AActor*                                            DeadCamera;                                                 // 0x2498   (0x0008)  
	FName                                              LastHittBoneName;                                           // 0x24A0   (0x0008)  
	double                                             LastHitAngle;                                               // 0x24A8   (0x0008)  
	FVector                                            LastHitDirection;                                           // 0x24B0   (0x0018)  
	bool                                               IsGrenadeDamage;                                            // 0x24C8   (0x0001)  
	bool                                               TabIsOpened;                                                // 0x24C9   (0x0001)  
	unsigned char                                      UnknownData94_5[0x6];                                       // 0x24CA   (0x0006)  MISSED
	AActor*                                            Highlighted_Actor;                                          // 0x24D0   (0x0008)  
	double                                             FullFlashDuration;                                          // 0x24D8   (0x0008)  
	double                                             FadeInterval;                                               // 0x24E0   (0x0008)  
	double                                             FlashIntensity;                                             // 0x24E8   (0x0008)  
	double                                             FlashFadeSpeed;                                             // 0x24F0   (0x0008)  
	double                                             AfterimageIntensity;                                        // 0x24F8   (0x0008)  
	double                                             RingingVolume;                                              // 0x2500   (0x0008)  
	double                                             RingingFadeSpeed;                                           // 0x2508   (0x0008)  
	UAudioComponent*                                   Ringing;                                                    // 0x2510   (0x0008)  
	UMaterialInstanceDynamic*                          PP_Flashbang_Dynamic;                                       // 0x2518   (0x0008)  
	bool                                               bFadingFlashEffect;                                         // 0x2520   (0x0001)  
	unsigned char                                      UnknownData95_5[0x7];                                       // 0x2521   (0x0007)  MISSED
	UTextureRenderTarget2D*                            RenderTexture;                                              // 0x2528   (0x0008)  
	USceneCaptureComponent2D*                          SceneCaptureComponent2D;                                    // 0x2530   (0x0008)  
	bool                                               IsSprinting;                                                // 0x2538   (0x0001)  
	bool                                               ToSync;                                                     // 0x2539   (0x0001)  
	unsigned char                                      UnknownData96_5[0x2];                                       // 0x253A   (0x0002)  MISSED
	FName                                              Primary_Weapon_Slot;                                        // 0x253C   (0x0008)  
	FName                                              Secondary_Weapon_Slot;                                      // 0x2544   (0x0008)  
	bool                                               ShowUI;                                                     // 0x254C   (0x0001)  
	unsigned char                                      UnknownData97_5[0x3];                                       // 0x254D   (0x0003)  MISSED
	AWeaponPlaceholder_C*                              ActiveWeaponPlaceholder;                                    // 0x2550   (0x0008)  
	bool                                               ShopInteract;                                               // 0x2558   (0x0001)  
	unsigned char                                      UnknownData98_5[0x7];                                       // 0x2559   (0x0007)  MISSED
	TArray<ASurvivalPlayer_C*>                         ShopActors;                                                 // 0x2560   (0x0010)  
	FMulticastInlineDelegate                           ShopStart;                                                  // 0x2570   (0x0010)  
	FMulticastInlineDelegate                           ShopEnd;                                                    // 0x2580   (0x0010)  
	bool                                               Has_Reset_Timer;                                            // 0x2590   (0x0001)  
	unsigned char                                      UnknownData99_5[0x7];                                       // 0x2591   (0x0007)  MISSED
	FTimerHandle                                       Timer_by_reset;                                             // 0x2598   (0x0008)  
	float                                              Food_desaturation;                                          // 0x25A0   (0x0004)  
	float                                              Water_blur;                                                 // 0x25A4   (0x0004)  
	float                                              Water_Blur_Radius;                                          // 0x25A8   (0x0004)  
	float                                              Water_Density;                                              // 0x25AC   (0x0004)  
	UMaterialInstanceDynamic*                          Food_PP;                                                    // 0x25B0   (0x0008)  
	bool                                               Shop;                                                       // 0x25B8   (0x0001)  
	unsigned char                                      UnknownData100_5[0x3];                                      // 0x25B9   (0x0003)  MISSED
	float                                              FoodWaterPP_Destruaction;                                   // 0x25BC   (0x0004)  
	float                                              WaterPP_blur_alpha;                                         // 0x25C0   (0x0004)  
	float                                              HitPP_Alpha;                                                // 0x25C4   (0x0004)  
	float                                              FoodWaterPP_Water_Blur_Radius;                              // 0x25C8   (0x0004)  
	unsigned char                                      UnknownData101_5[0x4];                                      // 0x25CC   (0x0004)  MISSED
	UMaterialInstanceDynamic*                          Water_PP;                                                   // 0x25D0   (0x0008)  
	UCameraShakeBase*                                  CurrentShopShake;                                           // 0x25D8   (0x0008)  
	FRotator                                           FlashlighRotation;                                          // 0x25E0   (0x0018)  
	UMaterialInstanceDynamic*                          Blood_PP;                                                   // 0x25F8   (0x0008)  
	UMaterialInstanceDynamic*                          Hit_PP;                                                     // 0x2600   (0x0008)  
	float                                              Blood_PP_lerp;                                              // 0x2608   (0x0004)  
	unsigned char                                      UnknownData102_5[0x4];                                      // 0x260C   (0x0004)  MISSED
	double                                             Blood_PP_random_value;                                      // 0x2610   (0x0008)  
	double                                             BloodPP_midle_value;                                        // 0x2618   (0x0008)  
	double                                             BloodPPMinValue;                                            // 0x2620   (0x0008)  
	FMulticastInlineDelegate                           ReloadEventLocaly;                                          // 0x2628   (0x0010)  
	FMulticastInlineDelegate                           PressReloadWeapon;                                          // 0x2638   (0x0010)  
	FMulticastInlineDelegate                           ChangeWeaponActiveSlot;                                     // 0x2648   (0x0010)  
	FTimerHandle                                       HandlerBloodEffect;                                         // 0x2658   (0x0008)  
	FFMODEventInstance                                 House_Ambient_Off;                                          // 0x2660   (0x0008)  
	UMaterialInstanceDynamic*                          M_HitBlurPP;                                                // 0x2668   (0x0008)  
	float                                              HitBlurPPLerp;                                              // 0x2670   (0x0004)  
	bool                                               SprintByToggle;                                             // 0x2674   (0x0001)  
	unsigned char                                      UnknownData103_5[0x3];                                      // 0x2675   (0x0003)  MISSED
	UGameSettings_C*                                   GameSettings;                                               // 0x2678   (0x0008)  
	APP_Effects_C*                                     PP_Effects;                                                 // 0x2680   (0x0008)  
	int32_t                                            PrimaryPointId;                                             // 0x2688   (0x0004)  
	int32_t                                            SecondaryPointId;                                           // 0x268C   (0x0004)  
	bool                                               AddBunkerMarks;                                             // 0x2690   (0x0001)  
	unsigned char                                      UnknownData104_5[0x7];                                      // 0x2691   (0x0007)  MISSED
	AActor*                                            DeadBodyV2;                                                 // 0x2698   (0x0008)  
	bool                                               forceHidden;                                                // 0x26A0   (0x0001)  
	bool                                               CrouchScopeAnimInProcess;                                   // 0x26A1   (0x0001)  
	unsigned char                                      UnknownData105_5[0x6];                                      // 0x26A2   (0x0006)  MISSED
	AWeaponPlaceholder_C*                              WeaponPlaceholderPistol;                                    // 0x26A8   (0x0008)  
	FName                                              PistolWeaponSlotName;                                       // 0x26B0   (0x0008)  
	bool                                               Self_healing;                                               // 0x26B8   (0x0001)  
	unsigned char                                      UnknownData106_5[0x7];                                      // 0x26B9   (0x0007)  MISSED
	FTimerHandle                                       Self_healingTimerHandle;                                    // 0x26C0   (0x0008)  
	UCameraShakeBase*                                  TpsToFpsCameraShake;                                        // 0x26C8   (0x0008)  
	FFMODEventInstance                                 RoomTone;                                                   // 0x26D0   (0x0008)  
	FFMODEventInstance                                 RoomReverb;                                                 // 0x26D8   (0x0008)  
	bool                                               LoadingActor;                                               // 0x26E0   (0x0001)  
	bool                                               CanMoveWhileUsingItem;                                      // 0x26E1   (0x0001)  
	unsigned char                                      UnknownData107_5[0x6];                                      // 0x26E2   (0x0006)  MISSED
	TArray<FFItemInfo>                                 ItemsCache;                                                 // 0x26E8   (0x0010)  
	bool                                               Eating;                                                     // 0x26F8   (0x0001)  
	unsigned char                                      UnknownData108_5[0x7];                                      // 0x26F9   (0x0007)  MISSED
	UFMODAudioComponent*                               FMODAudioContusion;                                         // 0x2700   (0x0008)  
	bool                                               FreeLook_Active;                                            // 0x2708   (0x0001)  
	unsigned char                                      UnknownData109_5[0x7];                                      // 0x2709   (0x0007)  MISSED
	FRotator                                           NeedToDelete_SavedFinalRotation_FreeLook;                   // 0x2710   (0x0018)  
	FRotator                                           NeedToDelete_SavedStarterRotation_FreeLook;                 // 0x2728   (0x0018)  
	bool                                               GrenadeOpened;                                              // 0x2740   (0x0001)  
	unsigned char                                      UnknownData110_5[0x7];                                      // 0x2741   (0x0007)  MISSED
	FRotator                                           RememberOldRotation;                                        // 0x2748   (0x0018)  
	bool                                               Scope_WallOffset_Check;                                     // 0x2760   (0x0001)  
	unsigned char                                      UnknownData111_5[0x7];                                      // 0x2761   (0x0007)  MISSED
	FMulticastInlineDelegate                           OnDeath;                                                    // 0x2768   (0x0010)  
	double                                             TargetInteractDistance;                                     // 0x2778   (0x0008)  
	AActorRecording_C*                                 3DCharacter;                                                // 0x2780   (0x0008)  
	double                                             DistanceToInteractable;                                     // 0x2788   (0x0008)  
	bool                                               RoomBuilding;                                               // 0x2790   (0x0001)  
	unsigned char                                      UnknownData112_5[0x7];                                      // 0x2791   (0x0007)  MISSED
	FS_SaveStructure                                   GI_Character_Save_Ref;                                      // 0x2798   (0x01B0)  
	bool                                               InteractiveActorInFocus;                                    // 0x2948   (0x0001)  
	bool                                               IsInHouseBool;                                              // 0x2949   (0x0001)  
	unsigned char                                      UnknownData113_5[0x6];                                      // 0x294A   (0x0006)  MISSED
	FString                                            MainLightSource;                                            // 0x2950   (0x0010)  
	UMaterialInstanceDynamic*                          ChooseCharacterDynMat;                                      // 0x2960   (0x0008)  
	bool                                               IsFemale;                                                   // 0x2968   (0x0001)  
	unsigned char                                      UnknownData114_5[0x7];                                      // 0x2969   (0x0007)  MISSED
	UJSI_Slot_C*                                       NewVar_JSI_Sl;                                              // 0x2970   (0x0008)  
	UJSIContainer_C*                                   NewVar_Cont;                                                // 0x2978   (0x0008)  
	bool                                               BlockVoiceChat;                                             // 0x2980   (0x0001)  
	unsigned char                                      UnknownData115_5[0x7];                                      // 0x2981   (0x0007)  MISSED
	UJSIContainer_C*                                   HelmetContainer;                                            // 0x2988   (0x0008)  
	bool                                               bCompasEquip;                                               // 0x2990   (0x0001)  
	unsigned char                                      UnknownData116_5[0x7];                                      // 0x2991   (0x0007)  MISSED
	FVector                                            OnDeathVelocity;                                            // 0x2998   (0x0018)  
	ABP_Compass_C*                                     CompasRef;                                                  // 0x29B0   (0x0008)  
	bool                                               IsInSauna;                                                  // 0x29B8   (0x0001)  
	bool                                               bStartProgressBar;                                          // 0x29B9   (0x0001)  
	bool                                               bItemLifeTime6sec;                                          // 0x29BA   (0x0001)  
	unsigned char                                      UnknownData117_5[0x5];                                      // 0x29BB   (0x0005)  MISSED
	UWBP_AttachmentCell_C*                             SavedCell;                                                  // 0x29C0   (0x0008)  
	bool                                               CompasState;                                                // 0x29C8   (0x0001)  
	bool                                               StopHiddingMe;                                              // 0x29C9   (0x0001)  
	bool                                               StopUsingItem;                                              // 0x29CA   (0x0001)  
	bool                                               LootDelayBlock;                                             // 0x29CB   (0x0001)  
	unsigned char                                      UnknownData118_5[0x4];                                      // 0x29CC   (0x0004)  MISSED
	FTimerHandle                                       LootDelayBlockTimer;                                        // 0x29D0   (0x0008)  
	double                                             LootDelayBlockFloat;                                        // 0x29D8   (0x0008)  
	TArray<UJSI_Slot_C*>                               SelectedSlot;                                               // 0x29E0   (0x0010)  
	bool                                               Delay;                                                      // 0x29F0   (0x0001)  
	unsigned char                                      UnknownData119_5[0x7];                                      // 0x29F1   (0x0007)  MISSED
	UMaterialInstanceDynamic*                          DM_BodyMan;                                                 // 0x29F8   (0x0008)  
	UMaterialInstanceDynamic*                          DM_LegsMan;                                                 // 0x2A00   (0x0008)  
	UMaterialInstanceDynamic*                          DM_LegsGirl;                                                // 0x2A08   (0x0008)  
	UMaterialInstanceDynamic*                          DW_BodyGirl;                                                // 0x2A10   (0x0008)  
	UMaterialInstanceDynamic*                          FemaleFPHands;                                              // 0x2A18   (0x0008)  
	UMaterialInstanceDynamic*                          MaleLHand;                                                  // 0x2A20   (0x0008)  
	UMaterialInstanceDynamic*                          MaleRHand;                                                  // 0x2A28   (0x0008)  
	float                                              Time;                                                       // 0x2A30   (0x0004)  
	unsigned char                                      UnknownData120_5[0x4];                                      // 0x2A34   (0x0004)  MISSED
	FTimerHandle                                       FinishRoundProgressBarTimerHandle;                          // 0x2A38   (0x0008)  
	bool                                               BlockUsingItemCanceling;                                    // 0x2A40   (0x0001)  
	bool                                               StartTimelineRoundBar;                                      // 0x2A41   (0x0001)  
	bool                                               MoveInput3Frames;                                           // 0x2A42   (0x0001)  
	unsigned char                                      UnknownData121_5[0x5];                                      // 0x2A43   (0x0005)  MISSED
	UJSI_Slot_C*                                       Slot_Ref__For_Using_Item_;                                  // 0x2A48   (0x0008)  
	bool                                               BlockCompas;                                                // 0x2A50   (0x0001)  
	unsigned char                                      UnknownData122_5[0x7];                                      // 0x2A51   (0x0007)  MISSED
	UJSIContainer_C*                                   ProtectiveCaseContainer;                                    // 0x2A58   (0x0008)  
	FName                                              KnockedTag;                                                 // 0x2A60   (0x0008)  
	UWBP_Surrender_C*                                  WBP_Surrender;                                              // 0x2A68   (0x0008)  
	bool                                               ReviveAnim;                                                 // 0x2A70   (0x0001)  
	unsigned char                                      UnknownData123_5[0x3];                                      // 0x2A71   (0x0003)  MISSED
	FName                                              In_Bone_Name;                                               // 0x2A74   (0x0008)  
	unsigned char                                      UnknownData124_5[0x4];                                      // 0x2A7C   (0x0004)  MISSED
	FVector                                            Linear_Velocity;                                            // 0x2A80   (0x0018)  
	bool                                               Ragdolling;                                                 // 0x2A98   (0x0001)  
	unsigned char                                      UnknownData125_5[0x7];                                      // 0x2A99   (0x0007)  MISSED
	FVector                                            CapsuleLocation;                                            // 0x2AA0   (0x0018)  
	FVector                                            PlayerMeshOffset;                                           // 0x2AB8   (0x0018)  
	bool                                               IsOnBack;                                                   // 0x2AD0   (0x0001)  
	unsigned char                                      UnknownData126_5[0x3];                                      // 0x2AD1   (0x0003)  MISSED
	float                                              SurrenderTime;                                              // 0x2AD4   (0x0004)  
	FTimerHandle                                       SurrenderTimer;                                             // 0x2AD8   (0x0008)  
	FTimerHandle                                       KnockdownTimer;                                             // 0x2AE0   (0x0008)  
	double                                             ReviveTime;                                                 // 0x2AE8   (0x0008)  
	FTimerHandle                                       UpdateCapsuleTimer;                                         // 0x2AF0   (0x0008)  
	ASurvivalPlayer_C*                                 Reviver;                                                    // 0x2AF8   (0x0008)  
	FVector                                            cameraLoc;                                                  // 0x2B00   (0x0018)  
	UCurveVector*                                      PosOffsetCurve;                                             // 0x2B18   (0x0008)  
	UCurveFloat*                                       EventMeshCurve;                                             // 0x2B20   (0x0008)  
	bool                                               Drop_Item_when_Die;                                         // 0x2B28   (0x0001)  
	unsigned char                                      UnknownData127_5[0x7];                                      // 0x2B29   (0x0007)  MISSED
	TArray<FDropItemEntry>                             Drop;                                                       // 0x2B30   (0x0010)  
	bool                                               Is_Radial_Damage;                                           // 0x2B40   (0x0001)  
	unsigned char                                      UnknownData128_5[0x7];                                      // 0x2B41   (0x0007)  MISSED
	APawn*                                             Killer;                                                     // 0x2B48   (0x0008)  
	FName                                              Bone_Name;                                                  // 0x2B50   (0x0008)  
	FVector                                            Hit_location;                                               // 0x2B58   (0x0018)  
	double                                             Hit_Angle;                                                  // 0x2B70   (0x0008)  
	bool                                               GPSEquip;                                                   // 0x2B78   (0x0001)  
	bool                                               GPSState;                                                   // 0x2B79   (0x0001)  
	unsigned char                                      UnknownData129_5[0x6];                                      // 0x2B7A   (0x0006)  MISSED
	ABP_GPS_C*                                         GPSRef;                                                     // 0x2B80   (0x0008)  
	FFMODEventInstance                                 KnockedSnapShot;                                            // 0x2B88   (0x0008)  
	FVector                                            PlayerLocation;                                             // 0x2B90   (0x0018)  
	FTimerHandle                                       TravelTimer;                                                // 0x2BA8   (0x0008)  
	double                                             TravelDistance;                                             // 0x2BB0   (0x0008)  
	double                                             Dealt_Damage;                                               // 0x2BB8   (0x0008)  
	int32_t                                            Shot_Count;                                                 // 0x2BC0   (0x0004)  
	int32_t                                            RegisteredHit;                                              // 0x2BC4   (0x0004)  
	double                                             HitPercentage;                                              // 0x2BC8   (0x0008)  
	bool                                               BlockGPS;                                                   // 0x2BD0   (0x0001)  
	unsigned char                                      UnknownData130_5[0x7];                                      // 0x2BD1   (0x0007)  MISSED
	UCurveVector*                                      PosReverseOffsetCurve;                                      // 0x2BD8   (0x0008)  
	UCurveFloat*                                       EventReverseMeshCurve;                                      // 0x2BE0   (0x0008)  
	int64_t                                            StatFood;                                                   // 0x2BE8   (0x0008)  
	int64_t                                            StatDrink;                                                  // 0x2BF0   (0x0008)  
	int64_t                                            StatAid;                                                    // 0x2BF8   (0x0008)  
	int64_t                                            StatZombieKilled;                                           // 0x2C00   (0x0008)  
	int64_t                                            Seconds;                                                    // 0x2C08   (0x0008)  
	int64_t                                            Minutes;                                                    // 0x2C10   (0x0008)  
	int32_t                                            Hours;                                                      // 0x2C18   (0x0004)  
	unsigned char                                      UnknownData131_5[0x4];                                      // 0x2C1C   (0x0004)  MISSED
	double                                             StatHeadShotDistance;                                       // 0x2C20   (0x0008)  
	double                                             StatTookDmg;                                                // 0x2C28   (0x0008)  
	UWDG_Map_C*                                        GPSWidgetMapRef;                                            // 0x2C30   (0x0008)  
	float                                              InclineAxisValue;                                           // 0x2C38   (0x0004)  
	unsigned char                                      UnknownData132_5[0x4];                                      // 0x2C3C   (0x0004)  MISSED
	FVector                                            Pos;                                                        // 0x2C40   (0x0018)  
	FRotator                                           rot;                                                        // 0x2C58   (0x0018)  
	UJSI_Slot_C*                                       Source_Slot_Ref;                                            // 0x2C70   (0x0008)  
	int32_t                                            CountSlideGPS;                                              // 0x2C78   (0x0004)  
	unsigned char                                      UnknownData133_5[0x4];                                      // 0x2C7C   (0x0004)  MISSED
	TArray<FString>                                    CarsNames;                                                  // 0x2C80   (0x0010)  
	TArray<FString>                                    StatSave;                                                   // 0x2C90   (0x0010)  
	FTimerHandle                                       LoopSaveStatTimer;                                          // 0x2CA0   (0x0008)  
	FMulticastInlineDelegate                           OnSaveStats;                                                // 0x2CA8   (0x0010)  
	FMulticastInlineDelegate                           OnLoadStats;                                                // 0x2CB8   (0x0010)  
	bool                                               InHub;                                                      // 0x2CC8   (0x0001)  
	unsigned char                                      UnknownData134_5[0x7];                                      // 0x2CC9   (0x0007)  MISSED
	TArray<int64_t>                                    TempStatSaveArray;                                          // 0x2CD0   (0x0010)  
	FMulticastInlineDelegate                           OnAiming;                                                   // 0x2CE0   (0x0010)  
	int32_t                                            EquipmentTier;                                              // 0x2CF0   (0x0004)  
	unsigned char                                      UnknownData135_5[0x4];                                      // 0x2CF4   (0x0004)  MISSED
	FMulticastInlineDelegate                           OnSetCarCount;                                              // 0x2CF8   (0x0010)  
	FString                                            HouseName;                                                  // 0x2D08   (0x0010)  
	FMulticastInlineDelegate                           OnSaveHouse;                                                // 0x2D18   (0x0010)  
	FMulticastInlineDelegate                           OnLoadHouse;                                                // 0x2D28   (0x0010)  
	FTimerHandle                                       InputReloadTimer;                                           // 0x2D38   (0x0008)  
	UCurveVector*                                      FPPCrouchingWepOffsetCurve;                                 // 0x2D40   (0x0008)  
	UCurveVector*                                      TPPCrouchingWepOffsetCurve;                                 // 0x2D48   (0x0008)  
	UCurveVector*                                      FPPStandingWepOffsetCurve;                                  // 0x2D50   (0x0008)  
	UCurveVector*                                      TPPStandingWepOffsetCurve;                                  // 0x2D58   (0x0008)  
	bool                                               InTrainGym;                                                 // 0x2D60   (0x0001)  
	bool                                               Sit;                                                        // 0x2D61   (0x0001)  
	unsigned char                                      UnknownData136_5[0x6];                                      // 0x2D62   (0x0006)  MISSED
	FString                                            HomeNameArray;                                              // 0x2D68   (0x0010)  
	FMulticastInlineDelegate                           OnSetHomeCount;                                             // 0x2D78   (0x0010)  
	FMulticastInlineDelegate                           OnCarSold;                                                  // 0x2D88   (0x0010)  
	FMulticastInlineDelegate                           OnHomeSold;                                                 // 0x2D98   (0x0010)  
	TEnumAsByte<BPE_AmmoClass>                         DamagedAmmoClass;                                           // 0x2DA8   (0x0001)  
	unsigned char                                      UnknownData137_5[0x3];                                      // 0x2DA9   (0x0003)  MISSED
	int32_t                                            RPoints;                                                    // 0x2DAC   (0x0004)  
	FMulticastInlineDelegate                           SetRPointsCount;                                            // 0x2DB0   (0x0010)  
	bool                                               UsingVending;                                               // 0x2DC0   (0x0001)  
	unsigned char                                      UnknownData138_5[0x7];                                      // 0x2DC1   (0x0007)  MISSED
	FMulticastInlineDelegate                           CarsStats;                                                  // 0x2DC8   (0x0010)  
	TArray<FString>                                    CarsStat;                                                   // 0x2DD8   (0x0010)  
	bool                                               SitTrain_;                                                  // 0x2DE8   (0x0001)  
	unsigned char                                      UnknownData139_5[0x3];                                      // 0x2DE9   (0x0003)  MISSED
	int32_t                                            MySquadIndex;                                               // 0x2DEC   (0x0004)  
	FTimerHandle                                       Gymhandle;                                                  // 0x2DF0   (0x0008)  
	AActor*                                            HightlightChair;                                            // 0x2DF8   (0x0008)  
	double                                             SprintDistanceTraveled;                                     // 0x2E00   (0x0008)  
	double                                             SprintDistanceNeedToTrain;                                  // 0x2E08   (0x0008)  
	double                                             TravelDistanceWeighted;                                     // 0x2E10   (0x0008)  
	int32_t                                            GetHitedCount;                                              // 0x2E18   (0x0004)  
	int32_t                                            RevivingCount;                                              // 0x2E1C   (0x0004)  
	int32_t                                            MoneyCycleCount;                                            // 0x2E20   (0x0004)  
	bool                                               bIsBinocularsEquip;                                         // 0x2E24   (0x0001)  
	unsigned char                                      UnknownData140_5[0x3];                                      // 0x2E25   (0x0003)  MISSED
	int32_t                                            ShotCountPistol;                                            // 0x2E28   (0x0004)  
	int32_t                                            CarStealNumber;                                             // 0x2E2C   (0x0004)  
	int32_t                                            CarRepairCount;                                             // 0x2E30   (0x0004)  
	int32_t                                            RefuelCount;                                                // 0x2E34   (0x0004)  
	bool                                               PlayerSit;                                                  // 0x2E38   (0x0001)  
	bool                                               BlockedCompassInTutorial;                                   // 0x2E39   (0x0001)  
	bool                                               BlockedGPSInTutorial;                                       // 0x2E3A   (0x0001)  
	bool                                               SitOnBar;                                                   // 0x2E3B   (0x0001)  
	unsigned char                                      UnknownData141_5[0x4];                                      // 0x2E3C   (0x0004)  MISSED
	AActor*                                            HightlightBar;                                              // 0x2E40   (0x0008)  
	ABarParent_C*                                      BarParentCall;                                              // 0x2E48   (0x0008)  
	bool                                               SitChair;                                                   // 0x2E50   (0x0001)  
	unsigned char                                      UnknownData142_5[0x7];                                      // 0x2E51   (0x0007)  MISSED
	AA_Food_C*                                         FoodRef;                                                    // 0x2E58   (0x0008)  
	bool                                               bMuteMicrophone;                                            // 0x2E60   (0x0001)  
	unsigned char                                      UnknownData143_5[0x3];                                      // 0x2E61   (0x0003)  MISSED
	int32_t                                            ReloadCountPistol;                                          // 0x2E64   (0x0004)  
	bool                                               TranzitIsOpened;                                            // 0x2E68   (0x0001)  
	unsigned char                                      UnknownData144_5[0x7];                                      // 0x2E69   (0x0007)  MISSED
	FMulticastInlineDelegate                           OnInCarChanged;                                             // 0x2E70   (0x0010)  
	bool                                               Burnt;                                                      // 0x2E80   (0x0001)  
	bool                                               InBase;                                                     // 0x2E81   (0x0001)  
	bool                                               BlockedInputInTutorial;                                     // 0x2E82   (0x0001)  
	bool                                               BlockLeftHandEffector;                                      // 0x2E83   (0x0001)  
	unsigned char                                      UnknownData145_5[0x4];                                      // 0x2E84   (0x0004)  MISSED
	TArray<ABP_QuestAreaIcon_C*>                       QuestArea;                                                  // 0x2E88   (0x0010)  
	TArray<FName>                                      Selected_Traits;                                            // 0x2E98   (0x0010)  
	UCharacterCreateSave_C*                            GI_Character_Save_Ref_0bject;                               // 0x2EA8   (0x0008)  
	TArray<FString>                                    Quest_Items;                                                // 0x2EB0   (0x0010)  
	TArray<int32_t>                                    Quest_Items_Counts;                                         // 0x2EC0   (0x0010)  
	UWBP_FurnitureShopButtons_C*                       FurnitureCatalog;                                           // 0x2ED0   (0x0008)  
	APlayerRoomBP_C*                                   RoomReference;                                              // 0x2ED8   (0x0008)  
	FMulticastInlineDelegate                           OnGPSStateChanged;                                          // 0x2EE0   (0x0010)  
	FMulticastInlineDelegate                           OnCompassStateChanged;                                      // 0x2EF0   (0x0010)  
	AActor*                                            CurrentTable;                                               // 0x2F00   (0x0008)  
	ASurvivalPlayer_C*                                 Player;                                                     // 0x2F08   (0x0008)  
	UWBP_MenuBarShop_C*                                WidgetRef;                                                  // 0x2F10   (0x0008)  
	AA_Knife_C*                                        KnifeRef;                                                   // 0x2F18   (0x0008)  
	AA_Fork_C*                                         ForkRef;                                                    // 0x2F20   (0x0008)  
	AActor*                                            ActiveTable;                                                // 0x2F28   (0x0008)  
	ASurvivalPlayer_C*                                 Player_Bar;                                                 // 0x2F30   (0x0008)  
	USceneComponent*                                   OutputPlaceFood;                                            // 0x2F38   (0x0008)  
	int32_t                                            OutputPlaceFoodIndex;                                       // 0x2F40   (0x0004)  
	unsigned char                                      UnknownData146_5[0x4];                                      // 0x2F44   (0x0004)  MISSED
	FMulticastInlineDelegate                           OnExitBar;                                                  // 0x2F48   (0x0010)  
	FMulticastInlineDelegate                           OnFinishFood;                                               // 0x2F58   (0x0010)  
	FMulticastInlineDelegate                           EnterToBase;                                                // 0x2F68   (0x0010)  
	UJSI_Slot_C*                                       UsedJSISlot;                                                // 0x2F78   (0x0008)  
	FTransform                                         ResHouseLoc;                                                // 0x2F80   (0x0060)  
	bool                                               ZanyatoChair;                                               // 0x2FE0   (0x0001)  
	unsigned char                                      UnknownData147_5[0x7];                                      // 0x2FE1   (0x0007)  MISSED
	AActor*                                            ActiveChair;                                                // 0x2FE8   (0x0008)  
	FMulticastInlineDelegate                           OnDiscountUpdated;                                          // 0x2FF0   (0x0010)  
	AA_Alhocol_C*                                      BottleRef;                                                  // 0x3000   (0x0008)  
	int32_t                                            PaidLoan;                                                   // 0x3008   (0x0004)  
	unsigned char                                      UnknownData148_5[0x4];                                      // 0x300C   (0x0004)  MISSED
	FMulticastInlineDelegate                           OnLoanPaid;                                                 // 0x3010   (0x0010)  
	AA_Menu_C*                                         MenuRef;                                                    // 0x3020   (0x0008)  
	bool                                               BlockMenu;                                                  // 0x3028   (0x0001)  
	bool                                               InventoryOpenAnim;                                          // 0x3029   (0x0001)  
	unsigned char                                      UnknownData149_5[0x6];                                      // 0x302A   (0x0006)  MISSED
	FMulticastInlineDelegate                           OnBlockOpenMenu;                                            // 0x3030   (0x0010)  
	FMulticastInlineDelegate                           OnGymExit;                                                  // 0x3040   (0x0010)  
	bool                                               BlockInputAnim;                                             // 0x3050   (0x0001)  
	bool                                               bIsInElevator;                                              // 0x3051   (0x0001)  
	bool                                               InventoryCameraBlock;                                       // 0x3052   (0x0001)  
	bool                                               Recover;                                                    // 0x3053   (0x0001)  
	unsigned char                                      UnknownData150_5[0x4];                                      // 0x3054   (0x0004)  MISSED
	TArray<FString>                                    Aliases;                                                    // 0x3058   (0x0010)  
	FMulticastInlineDelegate                           OnSetAliases;                                               // 0x3068   (0x0010)  
	FMulticastInlineDelegate                           OnPocketChanged;                                            // 0x3078   (0x0010)  
	float                                              New_Rotation_X__Roll_;                                      // 0x3088   (0x0004)  
	float                                              InventoryOpenAnimAlpha;                                     // 0x308C   (0x0004)  
	bool                                               JumpBlock;                                                  // 0x3090   (0x0001)  
	unsigned char                                      UnknownData151_5[0x7];                                      // 0x3091   (0x0007)  MISSED
	FMulticastInlineDelegate                           RoomInsidesSave;                                            // 0x3098   (0x0010)  
	TArray<FString>                                    RoomInsideSave;                                             // 0x30A8   (0x0010)  
	TArray<FString>                                    ServerStruct;                                               // 0x30B8   (0x0010)  
	FRotator                                           GpsRotation;                                                // 0x30C8   (0x0018)  
	FMulticastInlineDelegate                           OnBackPackChanged;                                          // 0x30E0   (0x0010)  
	FMulticastInlineDelegate                           OnChangeAmmoClass;                                          // 0x30F0   (0x0010)  
	float                                              ChangeAmmoTypeTime;                                         // 0x3100   (0x0004)  
	unsigned char                                      UnknownData152_5[0x4];                                      // 0x3104   (0x0004)  MISSED
	FFMODEventInstance                                 KnockedSnapShot3d;                                          // 0x3108   (0x0008)  
	UFMODAudioComponent*                               LastReplicatedSound;                                        // 0x3110   (0x0008)  
	UFMODAudioComponent*                               SupportSound;                                               // 0x3118   (0x0008)  
	UFMODAudioComponent*                               KnockedSnap3d;                                              // 0x3120   (0x0008)  
	bool                                               BlockCallMenu;                                              // 0x3128   (0x0001)  
	unsigned char                                      UnknownData153_5[0x7];                                      // 0x3129   (0x0007)  MISSED
	FMulticastInlineDelegate                           OnMeetNPC;                                                  // 0x3130   (0x0010)  
	bool                                               MenuOpen_;                                                  // 0x3140   (0x0001)  
	unsigned char                                      UnknownData154_5[0x7];                                      // 0x3141   (0x0007)  MISSED
	AA_Menu_C*                                         MenuRef;                                                    // 0x3148   (0x0008)  
	int32_t                                            GPSPage;                                                    // 0x3150   (0x0004)  
	unsigned char                                      UnknownData155_5[0x4];                                      // 0x3154   (0x0004)  MISSED
	ABP_GPS_FP_C*                                      GPSRef_FP;                                                  // 0x3158   (0x0008)  
	TMap<FString, TEnumAsByte>                         CarSaveMap;                                                 // 0x3160   (0x0050)  
	bool                                               BlockFIK;                                                   // 0x31B0   (0x0001)  
	bool                                               bMouseInverse;                                              // 0x31B1   (0x0001)  
	unsigned char                                      UnknownData156_5[0x6];                                      // 0x31B2   (0x0006)  MISSED
	UQuest*                                            TrackedQuest;                                               // 0x31B8   (0x0008)  
	FRotator                                           SyncedLookRotatation;                                       // 0x31C0   (0x0018)  
	bool                                               BlockedBinocularsInTutorial;                                // 0x31D8   (0x0001)  
	unsigned char                                      UnknownData157_5[0x7];                                      // 0x31D9   (0x0007)  MISSED
	ABP_TrainingApp_C*                                 As_BP_Training_App;                                         // 0x31E0   (0x0008)  
	TEnumAsByte<WE_NewDeathScreenState>                Ressurect_Place;                                            // 0x31E8   (0x0001)  
	bool                                               DeviceSwitcherBlock;                                        // 0x31E9   (0x0001)  
	bool                                               Teleping;                                                   // 0x31EA   (0x0001)  
	unsigned char                                      UnknownData158_5[0x1];                                      // 0x31EB   (0x0001)  MISSED
	int32_t                                            Received_Reputation_Points;                                 // 0x31EC   (0x0004)  
	bool                                               bShowInteractDebugTrace;                                    // 0x31F0   (0x0001)  
	bool                                               BarEating;                                                  // 0x31F1   (0x0001)  
	unsigned char                                      UnknownData159_5[0x6];                                      // 0x31F2   (0x0006)  MISSED
	FTimerHandle                                       DoOnce;                                                     // 0x31F8   (0x0008)  
	TMap<TEnumAsByte, TEnumAsByte>                     DefaultCollisionResponse_New;                               // 0x3200   (0x0050)  
	FText                                              CurrentCarName;                                             // 0x3250   (0x0018)  
	FVector                                            PrevTickLocation;                                           // 0x3268   (0x0018)  
	bool                                               GrenadeBlock;                                               // 0x3280   (0x0001)  
	bool                                               MeleeAnim;                                                  // 0x3281   (0x0001)  
	bool                                               EasyTrainEnable;                                            // 0x3282   (0x0001)  
	bool                                               SwitchAnim;                                                 // 0x3283   (0x0001)  
	TEnumAsByte<CarTipe>                               CarTipe;                                                    // 0x3284   (0x0001)  
	unsigned char                                      UnknownData160_5[0x3];                                      // 0x3285   (0x0003)  MISSED
	int32_t                                            ReloadCountAssault;                                         // 0x3288   (0x0004)  
	int32_t                                            ReloadCountShotgun;                                         // 0x328C   (0x0004)  
	int32_t                                            ReloadCountCarbine;                                         // 0x3290   (0x0004)  
	int32_t                                            ShotCountAssault;                                           // 0x3294   (0x0004)  
	int32_t                                            ShotCountShotgun;                                           // 0x3298   (0x0004)  
	int32_t                                            ShotCountCarbine;                                           // 0x329C   (0x0004)  
	TArray<FString>                                    Missing_Car_Names;                                          // 0x32A0   (0x0010)  
	FMulticastInlineDelegate                           MissingCarSave;                                             // 0x32B0   (0x0010)  
	bool                                               Is_Beginner;                                                // 0x32C0   (0x0001)  
	bool                                               ExitGPSBlock;                                               // 0x32C1   (0x0001)  
	bool                                               ShopNow;                                                    // 0x32C2   (0x0001)  
	unsigned char                                      UnknownData161_5[0x5];                                      // 0x32C3   (0x0005)  MISSED
	TArray<TEnumAsByte>                                TrainCD;                                                    // 0x32C8   (0x0010)  
	bool                                               HungerDamage;                                               // 0x32D8   (0x0001)  
	unsigned char                                      UnknownData162_5[0x7];                                      // 0x32D9   (0x0007)  MISSED
	FFItemInfo                                         receiverInfo;                                               // 0x32E0   (0x0220)  
	FFItemInfo                                         DroppedInfo;                                                // 0x3500   (0x0220)  
	bool                                               FPPWeapon;                                                  // 0x3720   (0x0001)  
	bool                                               NewVar;                                                     // 0x3721   (0x0001)  
	unsigned char                                      UnknownData163_5[0x2];                                      // 0x3722   (0x0002)  MISSED
	int32_t                                            TrainCost;                                                  // 0x3724   (0x0004)  
	bool                                               CtrlHolded;                                                 // 0x3728   (0x0001)  
	bool                                               ShiftHolded;                                                // 0x3729   (0x0001)  
	bool                                               FreeLookPressed;                                            // 0x372A   (0x0001)  
	unsigned char                                      UnknownData164_5[0x1];                                      // 0x372B   (0x0001)  MISSED
	int32_t                                            BackpackChangeCount;                                        // 0x372C   (0x0004)  
	UObject*                                           ShopWidget;                                                 // 0x3730   (0x0008)  
	bool                                               bBlockingAfterRessurect;                                    // 0x3738   (0x0001)  


	/// Functions
	// Function /Game/SurvivalPlayer.SurvivalPlayer_C.IsLocked?
	void IsLocked?(bool& Result);                                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvivalPlayer.SurvivalPlayer_C.GetActorType
	void GetActorType(TEnumAsByte<E_ActorType>& ActorType);                                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvivalPlayer.SurvivalPlayer_C.OnFocused
	void OnFocused(APawn* Player, AActor* HighlightActor, UActorComponent* HighlightActorComponent, TEnumAsByte<E_InteractType>& InteractType, double& LateTime); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
