
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package SurvivalPlayer_V2.

/// Class /Game/SurvivalPlayer_V2.SurvivalPlayer_V2_C
/// Size: 0x07C1 (0x004610 - 0x004DD1)
class ASurvivalPlayer_V2_C : public ASurvivalPlayer_Test_C : ASurvivalPlayer_Test_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x4610   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC;                                           // 0x4618   (0x0008)  
	UBPC_Taunt_C*                                      BPC_Taunt;                                                  // 0x4620   (0x0008)  
	UNiagaraComponent*                                 NS_CH_Ambient;                                              // 0x4628   (0x0008)  
	UNiagaraComponent*                                 NS_CH_Garbage;                                              // 0x4630   (0x0008)  
	UNiagaraComponent*                                 NS_CH_Leaves;                                               // 0x4638   (0x0008)  
	UIconComponent_C*                                  IconComponent;                                              // 0x4640   (0x0008)  
	UAnimationURO*                                     AnimationURO;                                               // 0x4648   (0x0008)  
	UBPC_TickIntervalController_C*                     BPC_TickIntervalController;                                 // 0x4650   (0x0008)  
	UChildActorComponent*                              MotionBlur;                                                 // 0x4658   (0x0008)  
	UPlayerCutsceneComponent_C*                        PlayerCutsceneComponent;                                    // 0x4660   (0x0008)  
	USceneComponent*                                   WP_Check_Source;                                            // 0x4668   (0x0008)  
	USphereComponent*                                  SphereProjectileNear;                                       // 0x4670   (0x0008)  
	float                                              MB_AimTimeline_Strength_9F3BD84C47A467CB33BF269C179C850E;   // 0x4678   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    MB_AimTimeline__Direction_9F3BD84C47A467CB33BF269C179C850E; // 0x467C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x467D   (0x0003)  MISSED
	UTimelineComponent*                                MB_AimTimeline;                                             // 0x4680   (0x0008)  
	float                                              PhysicBlendIdle_NewTrack_0_76D8F57447EA41D946F93F9F627BA0A0; // 0x4688   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    PhysicBlendIdle__Direction_76D8F57447EA41D946F93F9F627BA0A0; // 0x468C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x468D   (0x0003)  MISSED
	UTimelineComponent*                                PhysicBlendIdle;                                            // 0x4690   (0x0008)  
	double                                             Strength_Multiplyer;                                        // 0x4698   (0x0008)  
	bool                                               LocalHas_Movement_Input;                                    // 0x46A0   (0x0001)  
	TEnumAsByte<MovementType>                          lOCALmOVEMENTtYPE;                                          // 0x46A1   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x46A2   (0x0006)  MISSED
	ABP_TrajectorySpline_C*                            Trajectory;                                                 // 0x46A8   (0x0008)  
	UMaterialInterface*                                Skin_Material;                                              // 0x46B0   (0x0008)  
	TWeakObjectPtr<UClass*>                            Throw_Weapon;                                               // 0x46B8   (0x0030)  
	FString                                            Throw_weapon_name;                                          // 0x46E8   (0x0010)  
	bool                                               BreathHolded;                                               // 0x46F8   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x46F9   (0x0007)  MISSED
	double                                             BreathHoldValue;                                            // 0x4700   (0x0008)  
	FTimerHandle                                       BreathActiveTimer;                                          // 0x4708   (0x0008)  
	UMaterialInterface*                                LastHairMaterial;                                           // 0x4710   (0x0008)  
	FFMODEventInstance                                 NewVar_City_Ambient;                                        // 0x4718   (0x0008)  
	FFMODEventInstance                                 City_Reverb;                                                // 0x4720   (0x0008)  
	UClass*                                            ExplosiveItem;                                              // 0x4728   (0x0008)  
	bool                                               GrenadeRSpawn;                                              // 0x4730   (0x0001)  
	unsigned char                                      UnknownData04_5[0x7];                                       // 0x4731   (0x0007)  MISSED
	FTimerHandle                                       TimeGrenadeInHand;                                          // 0x4738   (0x0008)  
	ESpawnActorCollisionHandlingMethod                 Collision_Handling_Override;                                // 0x4740   (0x0001)  
	unsigned char                                      UnknownData05_5[0x7];                                       // 0x4741   (0x0007)  MISSED
	FTimerHandle                                       TimeHandleDrawTrajectory;                                   // 0x4748   (0x0008)  
	bool                                               ActivateGrenadeWithTrajectory;                              // 0x4750   (0x0001)  
	unsigned char                                      UnknownData06_5[0x7];                                       // 0x4751   (0x0007)  MISSED
	UAnimMontage*                                      Montage_to_Play;                                            // 0x4758   (0x0008)  
	double                                             TimePressedLeftMouse;                                       // 0x4760   (0x0008)  
	bool                                               TimePressed;                                                // 0x4768   (0x0001)  
	bool                                               DelayThrow;                                                 // 0x4769   (0x0001)  
	unsigned char                                      UnknownData07_5[0x6];                                       // 0x476A   (0x0006)  MISSED
	double                                             DelayGrenade;                                               // 0x4770   (0x0008)  
	bool                                               InterruptedThrowAnim;                                       // 0x4778   (0x0001)  
	bool                                               GrenadeKeyDown;                                             // 0x4779   (0x0001)  
	bool                                               FastThrowGrenade;                                           // 0x477A   (0x0001)  
	unsigned char                                      UnknownData08_5[0x5];                                       // 0x477B   (0x0005)  MISSED
	UClass*                                            FakeGrenade;                                                // 0x4780   (0x0008)  
	FFGrenadeInfo                                      ThrowableInfo;                                              // 0x4788   (0x0348)  
	TEnumAsByte<Enum_PlayerState>                      CurrentState;                                               // 0x4AD0   (0x0001)  
	TEnumAsByte<Enum_PlayerState>                      Initial_Player_State;                                       // 0x4AD1   (0x0001)  
	unsigned char                                      UnknownData09_5[0x6];                                       // 0x4AD2   (0x0006)  MISSED
	USurviveAnimator1_Sound_C*                         Anim_Ref;                                                   // 0x4AD8   (0x0008)  
	bool                                               Do_Debug_;                                                  // 0x4AE0   (0x0001)  
	unsigned char                                      UnknownData10_5[0x7];                                       // 0x4AE1   (0x0007)  MISSED
	double                                             Player_Elevation;                                           // 0x4AE8   (0x0008)  
	double                                             MinVertigoElevation;                                        // 0x4AF0   (0x0008)  
	bool                                               IsVertigo_;                                                 // 0x4AF8   (0x0001)  
	bool                                               ExperementingVertigo;                                       // 0x4AF9   (0x0001)  
	unsigned char                                      UnknownData11_5[0x6];                                       // 0x4AFA   (0x0006)  MISSED
	FVector                                            VertigoEndTrace_Z_only_;                                    // 0x4B00   (0x0018)  
	TEnumAsByte<EDrawDebugTrace>                       VertigoLineTrace_Debug_;                                    // 0x4B18   (0x0001)  
	bool                                               EdgeFrontForward;                                           // 0x4B19   (0x0001)  
	bool                                               EdgeLeft;                                                   // 0x4B1A   (0x0001)  
	bool                                               EdgeBack;                                                   // 0x4B1B   (0x0001)  
	bool                                               EdgeRight;                                                  // 0x4B1C   (0x0001)  
	unsigned char                                      UnknownData12_5[0x3];                                       // 0x4B1D   (0x0003)  MISSED
	double                                             Player_Evalation;                                           // 0x4B20   (0x0008)  
	double                                             MinVertigoEvaltion;                                         // 0x4B28   (0x0008)  
	double                                             MaxVertigo;                                                 // 0x4B30   (0x0008)  
	UFMODAudioComponent*                               FMODBreathingDefault;                                       // 0x4B38   (0x0008)  
	UFMODAudioComponent*                               FMODHealthBreathing;                                        // 0x4B40   (0x0008)  
	UFMODAudioComponent*                               FMODStaminaLow;                                             // 0x4B48   (0x0008)  
	UFMODAudioComponent*                               FMODNearProjectile;                                         // 0x4B50   (0x0008)  
	UFMODAudioComponent*                               FMODVertigo;                                                // 0x4B58   (0x0008)  
	UFMODAudioComponent*                               FMODBreathingCrouch;                                        // 0x4B60   (0x0008)  
	UFMODEvent*                                        FModEventBreathingCrouch;                                   // 0x4B68   (0x0008)  
	UFMODEvent*                                        FModEventBreathingStamina;                                  // 0x4B70   (0x0008)  
	UFMODEvent*                                        FModEventBreathingHealth;                                   // 0x4B78   (0x0008)  
	UFMODEvent*                                        FModEventDefaultBreathing;                                  // 0x4B80   (0x0008)  
	UFMODEvent*                                        FModEventNearProjectile;                                    // 0x4B88   (0x0008)  
	UFMODAudioComponent*                               FMODBreathingAim;                                           // 0x4B90   (0x0008)  
	UFMODEvent*                                        FModEventBreathingAim;                                      // 0x4B98   (0x0008)  
	UFMODEvent*                                        FModEventBreathingVertigo;                                  // 0x4BA0   (0x0008)  
	double                                             CurrentPlayerFOV;                                           // 0x4BA8   (0x0008)  
	double                                             FOVAimGrenade;                                              // 0x4BB0   (0x0008)  
	bool                                               LeverDestroy;                                               // 0x4BB8   (0x0001)  
	unsigned char                                      UnknownData13_5[0x7];                                       // 0x4BB9   (0x0007)  MISSED
	UClass*                                            Explosion;                                                  // 0x4BC0   (0x0008)  
	AExplosive_Item_C*                                 As_Explosive_Item;                                          // 0x4BC8   (0x0008)  
	double                                             WeaponAngleToWall;                                          // 0x4BD0   (0x0008)  
	bool                                               BlockingHit;                                                // 0x4BD8   (0x0001)  
	unsigned char                                      UnknownData14_5[0x7];                                       // 0x4BD9   (0x0007)  MISSED
	FFMODEventInstance                                 Ambient_Hub;                                                // 0x4BE0   (0x0008)  
	bool                                               SpawnInHub;                                                 // 0x4BE8   (0x0001)  
	unsigned char                                      UnknownData15_5[0x7];                                       // 0x4BE9   (0x0007)  MISSED
	ABP_LinearMotionBlurCage_C*                        BP_LinearMotionBlurCage;                                    // 0x4BF0   (0x0008)  
	bool                                               AimGrenadePressed;                                          // 0x4BF8   (0x0001)  
	unsigned char                                      UnknownData16_5[0x3];                                       // 0x4BF9   (0x0003)  MISSED
	FGameplayTag                                       RememberStandingCameraMode;                                 // 0x4BFC   (0x0008)  
	unsigned char                                      UnknownData17_5[0x4];                                       // 0x4C04   (0x0004)  MISSED
	ABP_ScopeBase_C*                                   RememberScope;                                              // 0x4C08   (0x0008)  
	bool                                               NeedToDelete_RememberScoping;                               // 0x4C10   (0x0001)  
	unsigned char                                      UnknownData18_5[0x7];                                       // 0x4C11   (0x0007)  MISSED
	FFMODEventInstance                                 City_Abandoned;                                             // 0x4C18   (0x0008)  
	float                                              Gravity_Scale_Default;                                      // 0x4C20   (0x0004)  
	bool                                               GrenadeLMB;                                                 // 0x4C24   (0x0001)  
	bool                                               GrenadeRMB;                                                 // 0x4C25   (0x0001)  
	bool                                               BlockGrenade;                                               // 0x4C26   (0x0001)  
	unsigned char                                      UnknownData19_5[0x1];                                       // 0x4C27   (0x0001)  MISSED
	int32_t                                            PowerThrowGrenade;                                          // 0x4C28   (0x0004)  
	unsigned char                                      UnknownData20_5[0x4];                                       // 0x4C2C   (0x0004)  MISSED
	double                                             TimePressedRightMouse;                                      // 0x4C30   (0x0008)  
	FMulticastInlineDelegate                           OnInputActionWeaponSlot5;                                   // 0x4C38   (0x0010)  
	FTimerHandle                                       TimerExplosive;                                             // 0x4C48   (0x0008)  
	bool                                               RingOut;                                                    // 0x4C50   (0x0001)  
	bool                                               isLeftTilt;                                                 // 0x4C51   (0x0001)  
	unsigned char                                      UnknownData21_5[0x6];                                       // 0x4C52   (0x0006)  MISSED
	FVector                                            DefaultLeftTilt;                                            // 0x4C58   (0x0018)  
	FVector                                            LeftTilt;                                                   // 0x4C70   (0x0018)  
	FVector                                            RightTilt;                                                  // 0x4C88   (0x0018)  
	UATPCCameraLocationObjectV2_C*                     ATPCLocObject;                                              // 0x4CA0   (0x0008)  
	bool                                               PlayerInCutscene;                                           // 0x4CA8   (0x0001)  
	unsigned char                                      UnknownData22_5[0x7];                                       // 0x4CA9   (0x0007)  MISSED
	double                                             HipFireAlpha;                                               // 0x4CB0   (0x0008)  
	bool                                               InHipFire;                                                  // 0x4CB8   (0x0001)  
	unsigned char                                      UnknownData23_5[0x7];                                       // 0x4CB9   (0x0007)  MISSED
	FRotator                                           RotOnHipFire;                                               // 0x4CC0   (0x0018)  
	FVector                                            TargetTilt;                                                 // 0x4CD8   (0x0018)  
	double                                             TiltInterpSpeed;                                            // 0x4CF0   (0x0008)  
	FVector                                            CurrentTilt;                                                // 0x4CF8   (0x0018)  
	FRotator                                           GPSOrigRot;                                                 // 0x4D10   (0x0018)  
	FVector                                            GPSLocOffset;                                               // 0x4D28   (0x0018)  
	bool                                               InitialCutscene;                                            // 0x4D40   (0x0001)  
	unsigned char                                      UnknownData24_5[0x7];                                       // 0x4D41   (0x0007)  MISSED
	double                                             Char_Yaw;                                                   // 0x4D48   (0x0008)  
	FVector                                            PrevLocation;                                               // 0x4D50   (0x0018)  
	TSet<FString>                                      Komnata_Stages;                                             // 0x4D68   (0x0050)  
	FTimerHandle                                       MeleeTimer;                                                 // 0x4DB8   (0x0008)  
	float                                              MeleeCooldown;                                              // 0x4DC0   (0x0004)  
	unsigned char                                      UnknownData25_5[0x4];                                       // 0x4DC4   (0x0004)  MISSED
	AChairParent_C*                                    As_Chair_Parent;                                            // 0x4DC8   (0x0008)  
	bool                                               IsInCraftStation;                                           // 0x4DD0   (0x0001)  


	/// Functions
	// Function /Game/SurvivalPlayer_V2.SurvivalPlayer_V2_C.GetMapIconData
	void GetMapIconData(FVector& Location, UTexture2D*& Icon, FVector2D& IconSize, double& RotationYaw, AActor*& WorldActor, FText& Name, FText& Description); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvivalPlayer_V2.SurvivalPlayer_V2_C.Update Overlapping House Box
	bool Update Overlapping House Box();                                                                                     // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvivalPlayer_V2.SurvivalPlayer_V2_C.OnRep_As Chair Parent
	void OnRep_As Chair Parent();                                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
