
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package SurvivalPlayer_Test.

/// Class /Game/SurvivalPlayer_Test.SurvivalPlayer_Test_C
/// Size: 0x0ED7 (0x003739 - 0x004610)
class ASurvivalPlayer_Test_C : public ASurvivalPlayer_C : ASurvivalPlayer_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x3739   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x3740   (0x0008)  
	USphereComponent*                                  PlayerNameSphereCollision;                                  // 0x3748   (0x0008)  
	UWorldPartitionStreamingSourceComponent*           WorldPartitionStreamingSource;                              // 0x3750   (0x0008)  
	UWidgetComponent*                                  Widget;                                                     // 0x3758   (0x0008)  
	URectLightComponent*                               RectLight1;                                                 // 0x3760   (0x0008)  
	URectLightComponent*                               RectLight;                                                  // 0x3768   (0x0008)  
	UPhysicalAnimationComponent*                       PhysicalAnimation;                                          // 0x3770   (0x0008)  
	float                                              DashTimeline_1_FE9E97E949BE73FA711B769C9DF5A2C8;            // 0x3778   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    DashTimeline__Direction_FE9E97E949BE73FA711B769C9DF5A2C8;   // 0x377C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x377D   (0x0003)  MISSED
	UTimelineComponent*                                DashTimeline;                                               // 0x3780   (0x0008)  
	float                                              ClimbWindowTimeline_BlendIn_4C2FA5F54A06EDE9B9DA88937C86BEEB; // 0x3788   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    ClimbWindowTimeline__Direction_4C2FA5F54A06EDE9B9DA88937C86BEEB; // 0x378C   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x378D   (0x0003)  MISSED
	UTimelineComponent*                                ClimbWindowTimeline;                                        // 0x3790   (0x0008)  
	TEnumAsByte<ETimelineDirection>                    AfterClimbInputCheck__Direction_C14A8A8E4E36D6E64552009468A3566B; // 0x3798   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x3799   (0x0007)  MISSED
	UTimelineComponent*                                AfterClimbInputCheck;                                       // 0x37A0   (0x0008)  
	float                                              ClimbTimeline_BlendIn_5030B9EB4532DAF17BB4EDA84CE3E866;     // 0x37A8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    ClimbTimeline__Direction_5030B9EB4532DAF17BB4EDA84CE3E866;  // 0x37AC   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x37AD   (0x0003)  MISSED
	UTimelineComponent*                                ClimbTimeline;                                              // 0x37B0   (0x0008)  
	bool                                               BlockDetectFence;                                           // 0x37B8   (0x0001)  
	unsigned char                                      UnknownData05_5[0x7];                                       // 0x37B9   (0x0007)  MISSED
	FClimbParams                                       ClimbParams;                                                // 0x37C0   (0x00A8)  
	unsigned char                                      UnknownData06_5[0x8];                                       // 0x3868   (0x0008)  MISSED
	FComponentAndTransform                             ClimbLedgeLS;                                               // 0x3870   (0x00C0)  
	FTransform                                         ClimbTarget;                                                // 0x3930   (0x0060)  
	FTransform                                         ClimbActualStartOffset;                                     // 0x3990   (0x0060)  
	FTransform                                         ClimbAnimatedStartOffset;                                   // 0x39F0   (0x0060)  
	FTransform                                         MantleActualStartOffset;                                    // 0x3A50   (0x0060)  
	bool                                               Climbing;                                                   // 0x3AB0   (0x0001)  
	unsigned char                                      UnknownData07_5[0x3];                                       // 0x3AB1   (0x0003)  MISSED
	int32_t                                            NewVar_0;                                                   // 0x3AB4   (0x0004)  
	unsigned char                                      UnknownData08_5[0x8];                                       // 0x3AB8   (0x0008)  MISSED
	FTransform                                         ClimbStartTransform;                                        // 0x3AC0   (0x0060)  
	bool                                               ClimbIn;                                                    // 0x3B20   (0x0001)  
	bool                                               ClimbingWindow;                                             // 0x3B21   (0x0001)  
	unsigned char                                      UnknownData09_5[0x6];                                       // 0x3B22   (0x0006)  MISSED
	FVector                                            WindowLoc;                                                  // 0x3B28   (0x0018)  
	double                                             WindowHeight;                                               // 0x3B40   (0x0008)  
	double                                             DistanceToWindow;                                           // 0x3B48   (0x0008)  
	FRotator                                           WindowRot;                                                  // 0x3B50   (0x0018)  
	FVector                                            WindowClimbAdditionalOffset;                                // 0x3B68   (0x0018)  
	FS_WindowClimb                                     WindowClimbAssset;                                          // 0x3B80   (0x0038)  
	bool                                               FirstStart;                                                 // 0x3BB8   (0x0001)  
	unsigned char                                      UnknownData10_5[0x7];                                       // 0x3BB9   (0x0007)  MISSED
	ALP_ForTestsWeapons_C*                             CheatLP;                                                    // 0x3BC0   (0x0008)  
	FEquipmentData                                     PantsInfo;                                                  // 0x3BC8   (0x0180)  
	FEquipmentData                                     HelmetInfo;                                                 // 0x3D48   (0x0180)  
	FEquipmentData                                     BackpackInfo;                                               // 0x3EC8   (0x0180)  
	FEquipmentData                                     ArmorInfo;                                                  // 0x4048   (0x0180)  
	FEquipmentData                                     JacketInfo;                                                 // 0x41C8   (0x0180)  
	bool                                               LetSnow;                                                    // 0x4348   (0x0001)  
	unsigned char                                      UnknownData11_5[0x7];                                       // 0x4349   (0x0007)  MISSED
	FTimerHandle                                       DashCancelTimer;                                            // 0x4350   (0x0008)  
	double                                             In_Strength_Multiplyer;                                     // 0x4358   (0x0008)  
	UW_PerksForTest_C*                                 PerkWindow;                                                 // 0x4360   (0x0008)  
	FFMODEventInstance                                 GrassSound;                                                 // 0x4368   (0x0008)  
	bool                                               LootPointInFocus;                                           // 0x4370   (0x0001)  
	unsigned char                                      UnknownData12_5[0x7];                                       // 0x4371   (0x0007)  MISSED
	FString                                            InsideCustomRoomId;                                         // 0x4378   (0x0010)  
	FString                                            Phase;                                                      // 0x4388   (0x0010)  
	FString                                            PlayerID;                                                   // 0x4398   (0x0010)  
	TArray<APS_TDB_C*>                                 Prev_Squad;                                                 // 0x43A8   (0x0010)  
	FVector                                            DEBUGTeleportLocation;                                      // 0x43B8   (0x0018)  
	FVector                                            ServerPosition;                                             // 0x43D0   (0x0018)  
	AActor*                                            CheatCars;                                                  // 0x43E8   (0x0008)  
	double                                             2stTierCap;                                                 // 0x43F0   (0x0008)  
	double                                             1stTierCap;                                                 // 0x43F8   (0x0008)  
	int32_t                                            LootCount;                                                  // 0x4400   (0x0004)  
	bool                                               InPlayerHouse;                                              // 0x4404   (0x0001)  
	unsigned char                                      UnknownData13_5[0x3];                                       // 0x4405   (0x0003)  MISSED
	TArray<APlayerRoomBP_C*>                           MyPlayerRoomArray;                                          // 0x4408   (0x0010)  
	AAVS_VehicleMaster_C*                              Car_Ref;                                                    // 0x4418   (0x0008)  
	TArray<ABP_PlayerSpawnPoint_C*>                    Regions;                                                    // 0x4420   (0x0010)  
	FTimerHandle                                       TelepTimer;                                                 // 0x4430   (0x0008)  
	bool                                               Enter;                                                      // 0x4438   (0x0001)  
	unsigned char                                      UnknownData14_5[0x7];                                       // 0x4439   (0x0007)  MISSED
	ASurvivalPlayer_V2_C*                              Char;                                                       // 0x4440   (0x0008)  
	ASurvivalPlayer_V2_C*                              SurvivalPlayer;                                             // 0x4448   (0x0008)  
	ASurvivalPlayer_V2_C*                              RoomOwner;                                                  // 0x4450   (0x0008)  
	bool                                               As_Guest;                                                   // 0x4458   (0x0001)  
	unsigned char                                      UnknownData15_5[0x7];                                       // 0x4459   (0x0007)  MISSED
	APlayerRoomBP_C*                                   Room_Ref;                                                   // 0x4460   (0x0008)  
	bool                                               IsLoading;                                                  // 0x4468   (0x0001)  
	unsigned char                                      UnknownData16_5[0x7];                                       // 0x4469   (0x0007)  MISSED
	FString                                            Last_House_Name;                                            // 0x4470   (0x0010)  
	FMulticastInlineDelegate                           ChatPreviewBeginOverlap;                                    // 0x4480   (0x0010)  
	FMulticastInlineDelegate                           ChatPreviewEndOverlap;                                      // 0x4490   (0x0010)  
	AActor*                                            TelepCarRef;                                                // 0x44A0   (0x0008)  
	ASurvPC_C*                                         Interacting_PC;                                             // 0x44A8   (0x0008)  
	FMulticastInlineDelegate                           OnRoomEnteredDisp;                                          // 0x44B0   (0x0010)  
	ATDB_GameMode_C*                                   As_TDB_Game_Mode;                                           // 0x44C0   (0x0008)  
	TArray<ABP_PlayerSpawnPoint_C*>                    SPTier1;                                                    // 0x44C8   (0x0010)  
	TArray<ABP_PlayerSpawnPoint_C*>                    SPTier2;                                                    // 0x44D8   (0x0010)  
	TArray<ABP_PlayerSpawnPoint_C*>                    SPTier3;                                                    // 0x44E8   (0x0010)  
	TArray<ABP_PlayerSpawnPoint_C*>                    SPTier4;                                                    // 0x44F8   (0x0010)  
	TMap<ABP_PlayerSpawnPoint_C*, int32_t>             SPPlayer;                                                   // 0x4508   (0x0050)  
	TArray<ABP_PlayerSpawnPoint_C*>                    RandomRegions;                                              // 0x4558   (0x0010)  
	bool                                               ToHub_;                                                     // 0x4568   (0x0001)  
	bool                                               PartyTeleport;                                              // 0x4569   (0x0001)  
	unsigned char                                      UnknownData17_5[0x6];                                       // 0x456A   (0x0006)  MISSED
	ABP_PlayerSpawnPoint_C*                            PickedSpawnPoint;                                           // 0x4570   (0x0008)  
	FString                                            CurrentAliases;                                             // 0x4578   (0x0010)  
	FFMODEventInstance                                 EscapeSound;                                                // 0x4588   (0x0008)  
	FString                                            DebugFGearString;                                           // 0x4590   (0x0010)  
	bool                                               EnablePhasePrint;                                           // 0x45A0   (0x0001)  
	bool                                               With_Car;                                                   // 0x45A1   (0x0001)  
	unsigned char                                      UnknownData18_5[0x6];                                       // 0x45A2   (0x0006)  MISSED
	UWidgetComponent*                                  PlayerNameWidgetComponent;                                  // 0x45A8   (0x0008)  
	UWBP_PlayerName3DWidget_C*                         PlayerNameWidget;                                           // 0x45B0   (0x0008)  
	FString                                            PhaseZapas;                                                 // 0x45B8   (0x0010)  
	bool                                               FullyLoaded;                                                // 0x45C8   (0x0001)  
	bool                                               No_Backpack_Teleporter;                                     // 0x45C9   (0x0001)  
	bool                                               Is_Without_Backpack;                                        // 0x45CA   (0x0001)  
	bool                                               ExitGPS;                                                    // 0x45CB   (0x0001)  
	unsigned char                                      UnknownData19_5[0x4];                                       // 0x45CC   (0x0004)  MISSED
	APlayerRoomBP_C*                                   PlayerRoomRef;                                              // 0x45D0   (0x0008)  
	TArray<ASurvivalPlayer_V2_C*>                      NameShowPlayers;                                            // 0x45D8   (0x0010)  
	bool                                               PlayerNameInBunker;                                         // 0x45E8   (0x0001)  
	unsigned char                                      UnknownData20_5[0x7];                                       // 0x45E9   (0x0007)  MISSED
	double                                             PlayerNameBunkerRadius;                                     // 0x45F0   (0x0008)  
	double                                             PlayerNameCityRadius;                                       // 0x45F8   (0x0008)  
	FMulticastInlineDelegate                           OnEvaquated;                                                // 0x4600   (0x0010)  


	/// Functions
	// Function /Game/SurvivalPlayer_Test.SurvivalPlayer_Test_C.AnotherPlayerLeaveSquad
	void AnotherPlayerLeaveSquad(APS_TDB_C* LeavePS);                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvivalPlayer_Test.SurvivalPlayer_Test_C.CheckNamesTickAlternative
	void CheckNamesTickAlternative();                                                                                        // [0x2407bf0] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/SurvivalPlayer_Test.SurvivalPlayer_Test_C.SquadIdChanges
	void SquadIdChanges();                                                                                                   // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
