
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package ThirdPersonBP.

/// Class /Game/ThirdPersonBP/Blueprints/BPI_GameMode.BPI_GameMode_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBPI_GameMode_C : public UInterface : UInterface
{ 
public:
};

/// Class /Game/ThirdPersonBP/Blueprints/TDB_GameMode.TDB_GameMode_C
/// Size: 0x0524 (0x0003E0 - 0x000904)
class ATDB_GameMode_C : public ASurvivalGameMode : ASurvivalGameMode
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x03E0   (0x0008)  
	UAgonesComponent*                                  Agones;                                                     // 0x03E8   (0x0008)  
	UPlayerSceneLoader_C*                              PlayerSceneLoader;                                          // 0x03F0   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x03F8   (0x0008)  
	int32_t                                            UniqueId;                                                   // 0x0400   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0404   (0x0004)  MISSED
	FMulticastInlineDelegate                           OnLevelLoaded;                                              // 0x0408   (0x0010)  
	TArray<AActor*>                                    SpawnedPlayers;                                             // 0x0418   (0x0010)  
	TArray<ABP_RB_Vehicle_C*>                          SpawnedVehicles;                                            // 0x0428   (0x0010)  
	int32_t                                            NewPlayerIndex;                                             // 0x0438   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x043C   (0x0004)  MISSED
	AAISpawnManager_C*                                 AISpawnManager;                                             // 0x0440   (0x0008)  
	int32_t                                            PlayersCount;                                               // 0x0448   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x044C   (0x0004)  MISSED
	FTimerHandle                                       ShutdownServerHandle;                                       // 0x0450   (0x0008)  
	double                                             ShutdownTimer;                                              // 0x0458   (0x0008)  
	UObject*                                           UpdatePlayerJSONRequest;                                    // 0x0460   (0x0008)  
	bool                                               SyncPlayerPosition;                                         // 0x0468   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x0469   (0x0007)  MISSED
	TMap<FString, ASurvPC_C*>                          PlayfabPlayers;                                             // 0x0470   (0x0050)  
	TArray<bool>                                       CheckRenderedPawns;                                         // 0x04C0   (0x0010)  
	FString                                            Key_Playfab;                                                // 0x04D0   (0x0010)  
	TMap<FString, ASurvivalPlayer_C*>                  LeftCharacters;                                             // 0x04E0   (0x0050)  
	TArray<APlayerDeadBodyRepl_C*>                     SpawnedDeadBodies;                                          // 0x0530   (0x0010)  
	int32_t                                            DeadBodyLimit;                                              // 0x0540   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x0544   (0x0004)  MISSED
	TArray<ASurvPC_C*>                                 PlayerControllers;                                          // 0x0548   (0x0010)  
	TMap<int32_t, FPlayerStatesArray>                  Squads;                                                     // 0x0558   (0x0050)  
	int32_t                                            LastSquadIndex;                                             // 0x05A8   (0x0004)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x05AC   (0x0004)  MISSED
	TArray<FName>                                      ItemsFoodAll;                                               // 0x05B0   (0x0010)  
	TArray<FName>                                      ItemsAid;                                                   // 0x05C0   (0x0010)  
	TArray<FName>                                      ItemsWeapon;                                                // 0x05D0   (0x0010)  
	TArray<FName>                                      ItemsAmmo;                                                  // 0x05E0   (0x0010)  
	TArray<FName>                                      ItemsArmor;                                                 // 0x05F0   (0x0010)  
	TArray<FName>                                      ItemsClothes;                                               // 0x0600   (0x0010)  
	TArray<FName>                                      ItemsTradeCraft;                                            // 0x0610   (0x0010)  
	TArray<FName>                                      ItemsBackpack;                                              // 0x0620   (0x0010)  
	TArray<FName>                                      ItemsOther;                                                 // 0x0630   (0x0010)  
	TArray<FName>                                      ItemsAttachments;                                           // 0x0640   (0x0010)  
	AZombieManager_C*                                  ZombieManager;                                              // 0x0650   (0x0008)  
	ADeerManager_C*                                    DeerManager;                                                // 0x0658   (0x0008)  
	FTimerHandle                                       ZombieManagerTimer;                                         // 0x0660   (0x0008)  
	FTimerHandle                                       DeerManagerTimer;                                           // 0x0668   (0x0008)  
	float                                              ZombieManagerCheckFrequency;                                // 0x0670   (0x0004)  
	float                                              DeerManagerCheckFrequency;                                  // 0x0674   (0x0004)  
	ASkyCreatorController_C*                           SkyCreatorController;                                       // 0x0678   (0x0008)  
	float                                              SkyCreatorControllerCheckFrequency;                         // 0x0680   (0x0004)  
	unsigned char                                      UnknownData06_5[0x4];                                       // 0x0684   (0x0004)  MISSED
	FTimerHandle                                       SkyCreatorControllerTimer;                                  // 0x0688   (0x0008)  
	TMap<FString, FTransform>                          PlayerPosition;                                             // 0x0690   (0x0050)  
	FMulticastInlineDelegate                           SavePlayerPosition;                                         // 0x06E0   (0x0010)  
	TArray<FString>                                    SavePlayerLocation;                                         // 0x06F0   (0x0010)  
	bool                                               ServerIsAllocated;                                          // 0x0700   (0x0001)  
	unsigned char                                      UnknownData07_5[0x3];                                       // 0x0701   (0x0003)  MISSED
	int32_t                                            WaitingForPlayers;                                          // 0x0704   (0x0004)  
	int32_t                                            ServerRuntime;                                              // 0x0708   (0x0004)  
	unsigned char                                      UnknownData08_5[0x4];                                       // 0x070C   (0x0004)  MISSED
	UDatabaseReference*                                ServerInfoRef;                                              // 0x0710   (0x0008)  
	FString                                            SeverUniqueID;                                              // 0x0718   (0x0010)  
	bool                                               InitInfo;                                                   // 0x0728   (0x0001)  
	unsigned char                                      UnknownData09_5[0x7];                                       // 0x0729   (0x0007)  MISSED
	FGameServerResponse                                Response;                                                   // 0x0730   (0x0138)  
	FString                                            PrevTimeTag;                                                // 0x0868   (0x0010)  
	FString                                            Region;                                                     // 0x0878   (0x0010)  
	TArray<FString>                                    ServerNames;                                                // 0x0888   (0x0010)  
	FMulticastInlineDelegate                           LogoutDis;                                                  // 0x0898   (0x0010)  
	FMulticastInlineDelegate                           SuvivalPlayerOnLogOut;                                      // 0x08A8   (0x0010)  
	bool                                               NotReady;                                                   // 0x08B8   (0x0001)  
	unsigned char                                      UnknownData10_5[0x3];                                       // 0x08B9   (0x0003)  MISSED
	int32_t                                            OldServerIndex;                                             // 0x08BC   (0x0004)  
	FString                                            Game_Version;                                               // 0x08C0   (0x0010)  
	bool                                               ServerIsClosing;                                            // 0x08D0   (0x0001)  
	unsigned char                                      UnknownData11_5[0x3];                                       // 0x08D1   (0x0003)  MISSED
	int32_t                                            CurrentBuild;                                               // 0x08D4   (0x0004)  
	FMulticastInlineDelegate                           OnSurvCreated;                                              // 0x08D8   (0x0010)  
	TArray<int32_t>                                    StagesTimeUntillServerShutdown;                             // 0x08E8   (0x0010)  
	int32_t                                            ServerLifeInMinutes;                                        // 0x08F8   (0x0004)  
	bool                                               SetForUpdate;                                               // 0x08FC   (0x0001)  
	unsigned char                                      UnknownData12_5[0x3];                                       // 0x08FD   (0x0003)  MISSED
	int32_t                                            SetForUpdateTimer;                                          // 0x0900   (0x0004)  


	/// Functions
	// Function /Game/ThirdPersonBP/Blueprints/TDB_GameMode.TDB_GameMode_C.GetPlayerStartForEnterBunker
	void GetPlayerStartForEnterBunker(AActor*& Start);                                                                       // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/ThirdPersonBP/Blueprints/TDB_GameMode.TDB_GameMode_C.GetPlayerStartsWithTag
	void GetPlayerStartsWithTag(FString Tag, TArray<AActor*>& Starts);                                                       // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/ThirdPersonBP/Blueprints/TDB_GameMode.TDB_GameMode_C.GetBunkerPlayerStart
