
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package TimeManagement.

/// Struct /Script/TimeManagement.TimedDataChannelSampleTime
/// Size: 0x0018 (0x000000 - 0x000018)
struct FTimedDataChannelSampleTime
{ 
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0000   (0x0018)  MISSED
};

/// Struct /Script/TimeManagement.TimedDataInputEvaluationData
/// Size: 0x0008 (0x000000 - 0x000008)
struct FTimedDataInputEvaluationData
{ 
	float                                              DistanceToNewestSampleSeconds;                              // 0x0000   (0x0004)  
	float                                              DistanceToOldestSampleSeconds;                              // 0x0004   (0x0004)  
};

/// Class /Script/TimeManagement.TimeSynchronizationSource
/// Size: 0x0008 (0x000028 - 0x000030)
class UTimeSynchronizationSource : public UObject : UObject
{ 
public:
	bool                                               bUseForSynchronization;                                     // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0029   (0x0003)  MISSED
	int32_t                                            FrameOffset;                                                // 0x002C   (0x0004)  
};

/// Class /Script/TimeManagement.FixedFrameRateCustomTimeStep
/// Size: 0x0000 (0x000028 - 0x000028)
class UFixedFrameRateCustomTimeStep : public UEngineCustomTimeStep : UEngineCustomTimeStep
{ 
public:
};

/// Class /Script/TimeManagement.GenlockedCustomTimeStep
/// Size: 0x0008 (0x000028 - 0x000030)
class UGenlockedCustomTimeStep : public UFixedFrameRateCustomTimeStep : UFixedFrameRateCustomTimeStep
{ 
public:
	bool                                               bAutoDetectFormat;                                          // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0029   (0x0007)  MISSED
};

/// Class /Script/TimeManagement.GenlockedFixedRateCustomTimeStep
/// Size: 0x0020 (0x000030 - 0x000050)
class UGenlockedFixedRateCustomTimeStep : public UGenlockedCustomTimeStep : UGenlockedCustomTimeStep
{ 
public:
	FFrameRate                                         FrameRate;                                                  // 0x0030   (0x0008)  
	bool                                               bShouldBlock;                                               // 0x0038   (0x0001)  
	bool                                               bForceSingleFrameDeltaTime;                                 // 0x0039   (0x0001)  
	unsigned char                                      UnknownData00_6[0x16];                                      // 0x003A   (0x0016)  MISSED
};

/// Class /Script/TimeManagement.GenlockedTimecodeProvider
/// Size: 0x0028 (0x000030 - 0x000058)
class UGenlockedTimecodeProvider : public UTimecodeProvider : UTimecodeProvider
{ 
public:
	bool                                               bUseGenlockToCount;                                         // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_6[0x27];                                      // 0x0031   (0x0027)  MISSED
};

/// Class /Script/TimeManagement.TimeManagementBlueprintLibrary
/// Size: 0x0000 (0x000028 - 0x000028)
class UTimeManagementBlueprintLibrary : public UBlueprintFunctionLibrary : UBlueprintFunctionLibrary
{ 
public:
};

/// Enum /Script/TimeManagement.EFrameNumberDisplayFormats
/// Size: 0x06
enum EFrameNumberDisplayFormats : uint8_t
{
	EFrameNumberDisplayFormats__NonDropFrameTimecode0                                = 0,
	EFrameNumberDisplayFormats__DropFrameTimecode1                                   = 1,
	EFrameNumberDisplayFormats__Seconds2                                             = 2,
	EFrameNumberDisplayFormats__Frames3                                              = 3,
	EFrameNumberDisplayFormats__MAX_Count4                                           = 4,
	EFrameNumberDisplayFormats__EFrameNumberDisplayFormats_MAX5                      = 5
};

/// Enum /Script/TimeManagement.ETimedDataInputEvaluationType
/// Size: 0x04
enum ETimedDataInputEvaluationType : uint8_t
{
	ETimedDataInputEvaluationType__None0                                             = 0,
	ETimedDataInputEvaluationType__Timecode1                                         = 1,
	ETimedDataInputEvaluationType__PlatformTime2                                     = 2,
	ETimedDataInputEvaluationType__ETimedDataInputEvaluationType_MAX3                = 3
};

/// Enum /Script/TimeManagement.ETimedDataInputState
/// Size: 0x04
enum ETimedDataInputState : uint8_t
{
	ETimedDataInputState__Connected0                                                 = 0,
	ETimedDataInputState__Unresponsive1                                              = 1,
	ETimedDataInputState__Disconnected2                                              = 2,
	ETimedDataInputState__ETimedDataInputState_MAX3                                  = 3
};

