
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package UI.

/// Struct /Game/UI/InGameShop/MenuBarShop/F_MenuBarShopItem.F_MenuBarShopItem
/// Size: 0x0041 (0x000000 - 0x000041)
struct FF_MenuBarShopItem
{ 
	UAnimMontage*                                      Montage_21_C775A8B84E91FEA98E8091A0A0C910B5;                // 0x0000   (0x0008)  
	UStaticMesh*                                       StaticMesh_22_D0D2FFA34001DD87918D7A97DE606110;             // 0x0008   (0x0008)  
	USkeleton*                                         Skeleton_23_2183105741A544DF272F97973C8C8702;               // 0x0010   (0x0008)  
	UPaperSprite*                                      Image_11_97D9D08A4230ABF92FAC33ABAB87728F;                  // 0x0018   (0x0008)  
	FText                                              Name_14_FF80EE80446B13E3BFEC64947BFB5385;                   // 0x0020   (0x0018)  
	double                                             BuyPrice_7_7E33B9544058634AC0FEB4A652524B9C;                // 0x0038   (0x0008)  
	TEnumAsByte<E_MenuBarShopCategory>                 Type_26_B1A5615B4D11BEF2DD6A80B01E876E98;                   // 0x0040   (0x0001)  
};

/// Struct /Game/UI/ContainerSystem/F_SlotSettings.F_SlotSettings
/// Size: 0x0020 (0x000000 - 0x000020)
struct FF_SlotSettings
{ 
	FVector2D                                          DefaultSlotSize_4_42EBBA1249E79C0A1B38DE9BD55145F2;         // 0x0000   (0x0010)  
	FMargin                                            Padding_8_5ADC36884E05731EDE709EB03E3D7094;                 // 0x0010   (0x0010)  
};

/// Struct /Game/UI/MainMenu/S_SettingControlDefault.S_SettingControlDefault
/// Size: 0x0020 (0x000000 - 0x000020)
struct FS_SettingControlDefault
{ 
	TArray<FInputAxisKeyMapping>                       AxisKey_13_6E94740E4840E0C658EA75A8254CC458;                // 0x0000   (0x0010)  
	TArray<FInputActionKeyMapping>                     ActionKey_14_8FFA0F234356A978BC417293D4384FD4;              // 0x0010   (0x0010)  
};

/// Struct /Game/UI/MainMenu/S_SettingDescriptionData.S_SettingDescriptionData
/// Size: 0x0048 (0x000000 - 0x000048)
struct FS_SettingDescriptionData
{ 
	FName                                              SettingName_2_C920880841904B828E97488FE683D5FD;             // 0x0000   (0x0008)  
	FText                                              SettingDisplayName_5_17860A094122B508B9963DB644E34A0F;      // 0x0008   (0x0018)  
	FText                                              SettingDescription_7_5085755D44BE4E5B89E9ADBB75C23578;      // 0x0020   (0x0018)  
	TArray<FText>                                      Values_11_E9C95DAF4A78DB97178E0DBEC1986667;                 // 0x0038   (0x0010)  
};

/// Struct /Game/UI/MainMenu/S_NameTextPair.S_NameTextPair
/// Size: 0x0018 (0x000000 - 0x000018)
struct FS_NameTextPair
{ 
	FText                                              DisplayName_3_64F7487D4C4AECB90E0127A6F8F30D08;             // 0x0000   (0x0018)  
};

/// Struct /Game/UI/Lockpicking/NewLocation/S_NewLocation.S_NewLocation
/// Size: 0x0150 (0x000000 - 0x000150)
struct FS_NewLocation
{ 
	FText                                              Location_2_80E0D6644E147B498B0733ABDA55A873;                // 0x0000   (0x0018)  
	FText                                              Title_4_1C132CC64536376305E6C88AA8109886;                   // 0x0018   (0x0018)  
	FF_DialogueNodeInfo                                Subtitles_11_180B29E3404CDEEBE7F96D97210ED5CC;              // 0x0030   (0x0108)  
	bool                                               isDanger_14_EBFAC91C40B26B278D1462AF49AD8461;               // 0x0138   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0139   (0x0007)  MISSED
	UMaterialInstance*                                 LocationMaterial_23_631272F84AAD49892DE7C4B16692F52B;       // 0x0140   (0x0008)  
	UMaterialInstance*                                 TitleMaterial_24_9AB9BB404975B9576D4E22920F8C91FB;          // 0x0148   (0x0008)  
};

/// Struct /Game/UI/MainMenu/Server/S_ServerInfo.S_ServerInfo
/// Size: 0x0040 (0x000000 - 0x000040)
struct FS_ServerInfo
{ 
	FText                                              DisplayName_3_A7B1600B4EB0819382739483BD1916BE;             // 0x0000   (0x0018)  
	TEnumAsByte<ENUM_ServerRegions>                    Region_6_5A4DCBBE4FD066D27456D281AE4692F9;                  // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0019   (0x0007)  MISSED
	FString                                            Adress_9_CB0ECC64442863D8B938F0A6A9E17316;                  // 0x0020   (0x0010)  
	FString                                            Port_12_EB6BBFA743A3767EB0099E981174A46D;                   // 0x0030   (0x0010)  
};

/// Struct /Game/UI/CharacterCreate/WS_BodyFeatures.WS_BodyFeatures
/// Size: 0x0085 (0x000000 - 0x000085)
struct FWS_BodyFeatures
{ 
	FString                                            RowName_40_4BCF9D2F4D0FB2708952F79402200ECB;                // 0x0000   (0x0010)  
	TEnumAsByte<WE_BodyTypes>                          BodyType_33_EAFCAA9C42636A7F48289AA83AD2458F;               // 0x0010   (0x0001)  
	TEnumAsByte<WE_BodyFeatures>                       BodyCategory_4_BFBC41AC4E2E6F89ABB314B2DE20294C;            // 0x0011   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0012   (0x0002)  MISSED
	FColor                                             Color_6_2E7C520B429F7BA48C741AAA01BE121C;                   // 0x0014   (0x0004)  
	TWeakObjectPtr<UPaperSprite*>                      Image_44_639D0EAF49654B38AB4B5EAEA4D4B7A4;                  // 0x0018   (0x0030)  
	TWeakObjectPtr<USkeletalMesh*>                     SkeletalMesh_43_A53BC5844A3E4875D499CEAA06E93EC5;           // 0x0048   (0x0030)  
	bool                                               isBlack__21_838F915E4C4792BC2CA6CBA143EA475A;               // 0x0078   (0x0001)  
	bool                                               IsBeard__23_00450E294BFB33191CD6B68AB11CC619;               // 0x0079   (0x0001)  
	bool                                               IsHair__25_2562448042BFB098705B85A988009FC5;                // 0x007A   (0x0001)  
	unsigned char                                      UnknownData01_5[0x1];                                       // 0x007B   (0x0001)  MISSED
	FColor                                             ColorTrue_28_FF2B92D6492F4A24D73941BDB774899E;              // 0x007C   (0x0004)  
	int32_t                                            ValueForSlider_37_2EDF788445E69562ACAA8FB46D2C779A;         // 0x0080   (0x0004)  
	bool                                               bNone_42_99A96E8D4DDD4D3EC0942F817F73D9E7;                  // 0x0084   (0x0001)  
};

/// Struct /Game/UI/CharacterCreate/S_CharacterClasses.S_CharacterClasses
/// Size: 0x0040 (0x000000 - 0x000040)
struct FS_CharacterClasses
{ 
	FText                                              DisplayName_2_5E5E96964C97C9E4549D6CB7DDC147DC;             // 0x0000   (0x0018)  
	FText                                              Description_4_E22D100347DBBDC13025A9B426AA329D;             // 0x0018   (0x0018)  
	TArray<FName>                                      Perks_8_13B810684F3EF44B89177C9B889113F5;                   // 0x0030   (0x0010)  
};

/// Struct /Game/UI/WorkbenchUI/S_WorkbenchCraftCategory.S_WorkbenchCraftCategory
/// Size: 0x0040 (0x000000 - 0x000040)
struct FS_WorkbenchCraftCategory
{ 
	FText                                              Name_2_10F5F97F49B6223B598F369BBB278D6B;                    // 0x0000   (0x0018)  
	UPaperSprite*                                      IconDefault_12_E4FCC44B4C41E12A5BB932989A2F9E37;            // 0x0018   (0x0008)  
	UPaperSprite*                                      IconSelected_15_719E51664025D66B752C588E18D51866;           // 0x0020   (0x0008)  
	TArray<TEnumAsByte>                                Categories_11_233BD62D431DE06F715608B96E29B5E3;             // 0x0028   (0x0010)  
	UPaperSprite*                                      IconCategory_18_1EFC6AC8491B688ABC72969861E7B663;           // 0x0038   (0x0008)  
};

/// Struct /Game/UI/Inventory/CharacterStats/S_StatInfo.S_StatInfo
/// Size: 0x003A (0x000000 - 0x00003A)
struct FS_StatInfo
{ 
	FText                                              Name_4_9CC169E343DDE43BB9FB188AF9834948;                    // 0x0000   (0x0018)  
	FText                                              Description_5_0AAF8C724BE0EEC15A7BF3B91CC45EF4;             // 0x0018   (0x0018)  
	UPaperSprite*                                      Icon_8_C287EA47447035B83A2F3FA9171082EE;                    // 0x0030   (0x0008)  
	TEnumAsByte<E_TrainStatType>                       Type_11_27E0B4C948D3E6CF7351F5B5A3CAD263;                   // 0x0038   (0x0001)  
	bool                                               ClassAbility_13_EFB72DB84D2CD7687A3553A1AB8E5F52;           // 0x0039   (0x0001)  
};

/// Struct /Game/UI/Inventory/CharacterEffects/S_EffectInfo.S_EffectInfo
/// Size: 0x0039 (0x000000 - 0x000039)
struct FS_EffectInfo
{ 
	FText                                              Name_3_9D9AAB1D4386CD9080C7F782190E097F;                    // 0x0000   (0x0018)  
	FText                                              Description_5_20712618428252FCDE5B99AF8C666297;             // 0x0018   (0x0018)  
	UPaperSprite*                                      Icon_10_C13BCEA944CA44F9774627B0BC4E7B4A;                   // 0x0030   (0x0008)  
	UNegativeEffectType                                UNegativeEffectType_16_DA6D28544A4934F66DE10DA062B024C3;    // 0x0038   (0x0001)  
};

/// Struct /Game/UI/InGameUI/F_LoadingScreenHints.F_LoadingScreenHints
/// Size: 0x0018 (0x000000 - 0x000018)
struct FF_LoadingScreenHints
{ 
	FText                                              Hint_2_32852CDA4C470A3C13311292D4A55C3A;                    // 0x0000   (0x0018)  
};

/// Struct /Game/UI/MainMenu/F_KeysInfo.F_KeysInfo
/// Size: 0x0050 (0x000000 - 0x000050)
struct FF_KeysInfo
{ 
	FKey                                               Key_11_BD9546B440B35D82986167871941D4E8;                    // 0x0000   (0x0018)  
	FText                                              Name_7_0944C0B748817F35C673DD95BFB5509F;                    // 0x0018   (0x0018)  
	UPaperSprite*                                      PositiveValueImage_12_E920B49F409E8E525140C396D30F2BBA;     // 0x0030   (0x0008)  
	UPaperSprite*                                      PositiveValueImage_Outline_19_E18289F84555EA4005595E933D76BCA4; // 0x0038   (0x0008)  
	UPaperSprite*                                      NegativeValueImage_15_6D5779E2499632A5CC74CDACBF201862;     // 0x0040   (0x0008)  
	UPaperSprite*                                      NegativeValueImage_Outline_21_6868A8774CE5FC14F8FAE282C07132BB; // 0x0048   (0x0008)  
};

/// Struct /Game/UI/InGameShop/CarShop/F_CarShopItem.F_CarShopItem
/// Size: 0x0058 (0x000000 - 0x000058)
struct FF_CarShopItem
{ 
	double                                             Price_26_92C399B34B885E92EA1DD49F55C24942;                  // 0x0000   (0x0008)  
	FText                                              DisplayName_27_404734664F7CAB0BA632A3AE4B0C6ABF;            // 0x0008   (0x0018)  
	TWeakObjectPtr<UPaperSprite*>                      Image_25_985767044BD752F2A5EC23B44711487D;                  // 0x0020   (0x0030)  
	FName                                              Name_24_384989A54A973F28F4D3359B3C0999A2;                   // 0x0050   (0x0008)  
};

/// Struct /Game/UI/Tutorial/S_TutorialSlides.S_TutorialSlides
/// Size: 0x0059 (0x000000 - 0x000059)
struct FS_TutorialSlides
{ 
	FText                                              Title_2_E30EDEFB4DAD14B0CB6B7689F4EA271B;                   // 0x0000   (0x0018)  
	FText                                              Description_4_6A38CF5D4B3E0344AE361BB4DB2EA0EF;             // 0x0018   (0x0018)  
	FText                                              HeaderText_10_0E86B4DA47BC5B04A8144F926327FBC7;             // 0x0030   (0x0018)  
	UTexture2D*                                        Image_12_25655E664F3B52F17A01E4AFF82233A1;                  // 0x0048   (0x0008)  
	FName                                              InputInfo_18_8E1ADDBA40833D879B118CA73270562A;              // 0x0050   (0x0008)  
	bool                                               bUseSpecialSound_20_FC68B7B947870C8BEB4AFF9CB4C8C505;       // 0x0058   (0x0001)  
};

/// Struct /Game/UI/Tutorial/S_InputHints.S_InputHints
/// Size: 0x0020 (0x000000 - 0x000020)
struct FS_InputHints
{ 
	TEnumAsByte<ENUM_ButtonHintType>                   Type_9_75928CBD43991B70866197B8740A171E;                    // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	FText                                              Text_10_DCFBB57F4CF0CDCC87E7AABC2280AF79;                   // 0x0008   (0x0018)  
};

/// Struct /Game/UI/InGameShop/CarShop/F_CarShop_DT.F_CarShop_DT
/// Size: 0x00A0 (0x000000 - 0x0000A0)
struct FF_CarShop_DT
{ 
	double                                             Price_16_AC1251B342952A66AB2ADC9F8D8CB8F5;                  // 0x0000   (0x0008)  
	FName                                              Name_8_D73A74C34A936A9BA5FD0AAD9B6A6FB8;                    // 0x0008   (0x0008)  
	FText                                              DisplayName_9_7290220C4FB79C941D8F6C929E823B29;             // 0x0010   (0x0018)  
	FText                                              Description_27_2D995E194D05531F7FF0379227084A4C;            // 0x0028   (0x0018)  
	TWeakObjectPtr<UPaperSprite*>                      Image_17_951F5D9F4B5581F2172144858E16654C;                  // 0x0040   (0x0030)  
	TWeakObjectPtr<UClass*>                            CarClass_24_83C05C274B6EF0D4DF526D83A0A1942E;               // 0x0070   (0x0030)  
};

/// Struct /Game/UI/InGameShop/FurnitureShop/F_FurnitureShopItem.F_FurnitureShopItem
/// Size: 0x0098 (0x000000 - 0x000098)
struct FF_FurnitureShopItem
{ 
	double                                             BuyPrice_2_92C399B34B885E92EA1DD49F55C24942;                // 0x0000   (0x0008)  
	double                                             SellPrice_6_7291F7B048E2736A21000E9643B3A04E;               // 0x0008   (0x0008)  
	FText                                              Name_8_404734664F7CAB0BA632A3AE4B0C6ABF;                    // 0x0010   (0x0018)  
	TWeakObjectPtr<UPaperSprite*>                      Image_21_985767044BD752F2A5EC23B44711487D;                  // 0x0028   (0x0030)  
	FName                                              RowName_13_FF1752864D200A933EEE62A2F3285B66;                // 0x0058   (0x0008)  
	TEnumAsByte<BuildingInfo_Categories_enum>          Category_16_0CD06F774594DCC80F6B3390622F5AA7;               // 0x0060   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0061   (0x0007)  MISSED
	TWeakObjectPtr<UClass*>                            Class_20_D580303C4391A407D8AE66A5425D9EA1;                  // 0x0068   (0x0030)  
};

/// Struct /Game/UI/Tutorial/S_PointerHintInfo.S_PointerHintInfo
/// Size: 0x0021 (0x000000 - 0x000021)
struct FS_PointerHintInfo
{ 
	FText                                              Text_2_7CD5D1574D6FD701D465DAA0D9D03128;                    // 0x0000   (0x0018)  
	UPaperSprite*                                      Image_5_C39020A5457A1FF4C1EEE7BF50B75843;                   // 0x0018   (0x0008)  
	TEnumAsByte<CardinalDirections>                    ArrowOrientation_23_0EB4DDE24C52F5A03D74D197FCB3E6BC;       // 0x0020   (0x0001)  
};

/// Struct /Game/UI/CharacterCreate/WS_CharaterPerks.WS_CharaterPerks
/// Size: 0x00B1 (0x000000 - 0x0000B1)
struct FWS_CharaterPerks
{ 
	TWeakObjectPtr<UClass*>                            PerkClass_53_A8B951444652D8867E5912941A6584AA;              // 0x0000   (0x0030)  
	FText                                              Name_6_7762619C4291BEF93ABC3688701EF003;                    // 0x0030   (0x0018)  
	FText                                              Description_8_B330672A4DBC9B13B9B02B8C198CDF06;             // 0x0048   (0x0018)  
	int32_t                                            Price_42_5F5D9C6C42923EC9C0FAE9954CA35A5C;                  // 0x0060   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0064   (0x0004)  MISSED
	UPaperSprite*                                      Icon_25_121F7276423E23FF48A82E8D9E94AE71;                   // 0x0068   (0x0008)  
	bool                                               PositivePerk__34_1D9374E0496B2B713524DCBC6ACD90C7;          // 0x0070   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0071   (0x0007)  MISSED
	FText                                              StatName_38_01C71C7840EE7F97C8AB298D00DD5EA3;               // 0x0078   (0x0018)  
	FText                                              PercentageChange_41_AECD18EF4C35A6CC4C0ED8A6C68102EE;       // 0x0090   (0x0018)  
	double                                             ChangeMultiplier_45_51EF840A444905A66B12C0A3BCADE062;       // 0x00A8   (0x0008)  
	TEnumAsByte<PerkStatEnum>                          StatType_56_FF8111984FDE0025462FBDA8FEE8EA1F;               // 0x00B0   (0x0001)  
};

/// Struct /Game/UI/InGameShop/FurnitureShop/F_FurnitureUpgradeHouseInfo.F_FurnitureUpgradeHouseInfo
/// Size: 0x005C (0x000000 - 0x00005C)
struct FF_FurnitureUpgradeHouseInfo
{ 
	FString                                            HouseName_3_56EA582C4B8CD5E9ABB40B8F578464C1;               // 0x0000   (0x0010)  
	double                                             BuyPrice_8_96E91C1141E7F2E1FCB73C88E7B9876F;                // 0x0010   (0x0008)  
	UPaperSprite*                                      Image_11_D8336C8F4386501AE895A7B1114EBFA6;                  // 0x0018   (0x0008)  
	int32_t                                            Storage_14_80DCDBB14AF9733CF2A36B88B5AFA4EE;                // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0024   (0x0004)  MISSED
	FText                                              DisplayName_17_E2D288674D6D1D6360D8348D658B5949;            // 0x0028   (0x0018)  
	FText                                              Description_19_FD99D32E47DC18FC934FA9A7CB74E440;            // 0x0040   (0x0018)  
	int32_t                                            HouseLevel_22_D454D4C74C8E768AAA997483DB04FDCD;             // 0x0058   (0x0004)  
};

/// Struct /Game/UI/BaseBuilding/BuildingInfo_Struct.BuildingInfo_Struct
/// Size: 0x00D8 (0x000000 - 0x0000D8)
struct FBuildingInfo_Struct
{ 
	TEnumAsByte<BuildingInfo_Categories_enum>          Category_4_E842BF264CB3F4994AE72281466A6DA7;                // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            Price_9_70936D33485A52D10F0D0BBD104C6F3F;                   // 0x0004   (0x0004)  
	TWeakObjectPtr<UPaperSprite*>                      Image_35_518DD8B246696E051DDD36ACABD3A693;                  // 0x0008   (0x0030)  
	FText                                              Description_18_514461444138246B3F11F283BAD8E469;            // 0x0038   (0x0018)  
	FText                                              Name_20_59407074479B87E1834CC29FE1B3A51F;                   // 0x0050   (0x0018)  
	TWeakObjectPtr<UClass*>                            Class_33_BA52E36B4802C632C928C7A2DC0B2F8D;                  // 0x0068   (0x0030)  
	FName                                              RowNames_26_67C6F472415CD4D0BE5B11BABB689DB3;               // 0x0098   (0x0008)  
	int32_t                                            Type_29_C1BA4C964D76BCD32A252E8A81F0DE54;                   // 0x00A0   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x00A4   (0x0004)  MISSED
	TWeakObjectPtr<UStaticMesh*>                       StaticMesh_34_48CB66E9486A33B6EB26ADA04745D21A;             // 0x00A8   (0x0030)  
};

/// Struct /Game/UI/Dialogue/F_DialoguePhrasesNodeInfo.F_DialoguePhrasesNodeInfo
/// Size: 0x0061 (0x000000 - 0x000061)
struct FF_DialoguePhrasesNodeInfo
{ 
	FText                                              Phrase_7_FB05CD0041EF9828022E31B3FD529074;                  // 0x0000   (0x0018)  
	UAnimMontage*                                      animation_36_5115CA9B467713A406941DA3CB25C1D2;              // 0x0018   (0x0008)  
	TWeakObjectPtr<UFMODEvent*>                        soundFMOD_51_19B9AB084A1BA6088F9D3EB534D2D2BE;              // 0x0020   (0x0030)  
	double                                             soundLength_34_79D2DA064FE9EFAABCA260946956D65B;            // 0x0050   (0x0008)  
	double                                             LongPhrases_54_9D5D1D044BA666DBCB4AF9B9A0CE2CB3;            // 0x0058   (0x0008)  
	bool                                               DeadEndPhrase_47_BC5FD26A41BE86F2A95D3890BD261654;          // 0x0060   (0x0001)  
};

/// Struct /Game/UI/Dialogue/F_DialogueNodeInfo.F_DialogueNodeInfo
/// Size: 0x0105 (0x000000 - 0x000105)
struct FF_DialogueNodeInfo
{ 
	TEnumAsByte<E_TalkingCharacter>                    TalkingCharacter_14_43F6C04E4832850D423C4CA139FDE0ED;       // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	FText                                              Phrase_7_FB05CD0041EF9828022E31B3FD529074;                  // 0x0008   (0x0018)  
	TArray<FF_DialoguePhrasesNodeInfo>                 Phrases_52_F6055E934B78F32661F5E9BBFB5BE21C;                // 0x0020   (0x0010)  
	bool                                               IsRandom_5_FE093403403032AF83331A941F29172C;                // 0x0030   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0031   (0x0007)  MISSED
	TArray<FText>                                      RandomPhraseArray_10_4F368F0742F2F22805936D9938DB79C8;      // 0x0038   (0x0010)  
	UAnimMontage*                                      animation_36_5115CA9B467713A406941DA3CB25C1D2;              // 0x0048   (0x0008)  
	TWeakObjectPtr<UFMODEvent*>                        soundFMOD_62_19B9AB084A1BA6088F9D3EB534D2D2BE;              // 0x0050   (0x0030)  
	double                                             soundLength_34_79D2DA064FE9EFAABCA260946956D65B;            // 0x0080   (0x0008)  
	double                                             LongPhrase_68_1DB27B78459D3FDA68BC599C08D45595;             // 0x0088   (0x0008)  
	TArray<TWeakObjectPtr>                             soundFMODRandomArray_63_38CFAE7E438910737B6F118FD4AE8B4A;   // 0x0090   (0x0010)  
	TArray<double>                                     soundLengthRandomArray_35_8CEF965943F22E39BF42CF8952650293; // 0x00A0   (0x0010)  
	TArray<double>                                     soundLongLengthRandomArray_74_35266D2F462187B37EDDBABA66CF916A; // 0x00B0   (0x0010)  
	TArray<UAnimMontage*>                              animationRandom_41_7BB991DD4D33BA96037FF191FEA192B7;        // 0x00C0   (0x0010)  
	TWeakObjectPtr<UPaperSprite*>                      PhraseIcon_64_AFDC9D454654C92F550D708C7DAF37DA;             // 0x00D0   (0x0030)  
	bool                                               DeadEndPhrase_47_BC5FD26A41BE86F2A95D3890BD261654;          // 0x0100   (0x0001)  
	bool                                               TakeItemtutorial_54_A60F8AC144D280F9051C5F8A7C83E552;       // 0x0101   (0x0001)  
	bool                                               NotRetain_58_675F0A3E494FD6240BD2CFAA574A3313;              // 0x0102   (0x0001)  
	bool                                               isFunctionButton_61_FDA82A614987B7601C3161884FD3A0DD;       // 0x0103   (0x0001)  
	bool                                               Exit_70_51D4126844194BC91CCB8686713DA1F0;                   // 0x0104   (0x0001)  
};

/// Class /Game/UI/W_Cursor.W_Cursor_C
/// Size: 0x0008 (0x000280 - 0x000288)
class UW_Cursor_C : public UUserWidget : UUserWidget
{ 
public:
	UImage*                                            Image_Cursor;                                               // 0x0280   (0x0008)  
};

/// Class /Game/UI/InGameShop/ShopWithRPoints/W_RPShopSlot.W_RPShopSlot_C
/// Size: 0x02E8 (0x000280 - 0x000568)
class UW_RPShopSlot_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Hovered;                                                    // 0x0288   (0x0008)  
	UButton*                                           Button;                                                     // 0x0290   (0x0008)  
	UImage*                                            Default;                                                    // 0x0298   (0x0008)  
	UImage*                                            Dollar;                                                     // 0x02A0   (0x0008)  
	UImage*                                            Empty;                                                      // 0x02A8   (0x0008)  
	UHorizontalBox*                                    HorizontalBox;                                              // 0x02B0   (0x0008)  
	UHorizontalBox*                                    HorizontalBox;                                              // 0x02B8   (0x0008)  
	UImage*                                            ItemImage;                                                  // 0x02C0   (0x0008)  
	UTextBlock*                                        ItemName;                                                   // 0x02C8   (0x0008)  
	UTextBlock*                                        Price;                                                      // 0x02D0   (0x0008)  
	UImage*                                            RPoints;                                                    // 0x02D8   (0x0008)  
	UTextBlock*                                        RPoints_Text;                                               // 0x02E0   (0x0008)  
	UImage*                                            Selected;                                                   // 0x02E8   (0x0008)  
	UTextBlock*                                        Text_PlayerName;                                            // 0x02F0   (0x0008)  
	UTextBlock*                                        Text_Status;                                                // 0x02F8   (0x0008)  
	FFItemInfo                                         ItemInfo;                                                   // 0x0300   (0x0220)  
	FMulticastInlineDelegate                           OnPressed_RPShopSlot_;                                      // 0x0520   (0x0010)  
	int32_t                                            RPoint;                                                     // 0x0530   (0x0004)  
	TEnumAsByte<E_ShopContainer>                       SetShopState;                                               // 0x0534   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0535   (0x0003)  MISSED
	FText                                              PlayerName;                                                 // 0x0538   (0x0018)  
	FText                                              PlayerStatus;                                               // 0x0550   (0x0018)  


	/// Functions
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShopSlot.W_RPShopSlot_C.SetPlayerStatus
	void SetPlayerStatus();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShopSlot.W_RPShopSlot_C.Init
	void Init();                                                                                                             // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShopSlot.W_RPShopSlot_C.Selected 
	void Selected (bool Selected);                                                                                           // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShopSlot.W_RPShopSlot_C.Hovered 
	void Hovered (bool With Anim, bool Hovered);                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShopSlot.W_RPShopSlot_C.BndEvt__W_RPShopSlot_Button_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
	void BndEvt__W_RPShopSlot_Button_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();                 // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShopSlot.W_RPShopSlot_C.BndEvt__W_RPShopSlot_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__W_RPShopSlot_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();                   // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShopSlot.W_RPShopSlot_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShopSlot.W_RPShopSlot_C.BndEvt__W_RPShopSlot_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__W_RPShopSlot_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();                   // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShopSlot.W_RPShopSlot_C.ExecuteUbergraph_W_RPShopSlot
	void ExecuteUbergraph_W_RPShopSlot(int32_t EntryPoint);                                                                  // [0x2407bf0] Final                
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShopSlot.W_RPShopSlot_C.OnPressed(RPShopSlot)__DelegateSignature
	void OnPressed(RPShopSlot)__DelegateSignature(UW_RPShopSlot_C* Ref);                                                     // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/InGameShop/HouseShop/W_EmptyShopCategory.W_EmptyShopCategory_C
/// Size: 0x0079 (0x000280 - 0x0002F9)
class UW_EmptyShopCategory_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Blick;                                                      // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Hovered;                                                    // 0x0290   (0x0008)  
	UButton*                                           Button_ItemCategory;                                        // 0x0298   (0x0008)  
	UImage*                                            Image_BG;                                                   // 0x02A0   (0x0008)  
	UImage*                                            Image_Hovered;                                              // 0x02A8   (0x0008)  
	UImage*                                            Image_Icon;                                                 // 0x02B0   (0x0008)  
	UImage*                                            Image_Selected;                                             // 0x02B8   (0x0008)  
	UTextBlock*                                        Text_Category;                                              // 0x02C0   (0x0008)  
	FText                                              Text;                                                       // 0x02C8   (0x0018)  
	UPaperSprite*                                      Sprite;                                                     // 0x02E0   (0x0008)  
	FMulticastInlineDelegate                           OnSelected;                                                 // 0x02E8   (0x0010)  
	TEnumAsByte<Enum_HouseShopCategory>                HouseCategory;                                              // 0x02F8   (0x0001)  


	/// Functions
	// Function /Game/UI/InGameShop/HouseShop/W_EmptyShopCategory.W_EmptyShopCategory_C.Hovered 
	void Hovered (bool With Anim, bool Hovered);                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/HouseShop/W_EmptyShopCategory.W_EmptyShopCategory_C.Selected
	void Selected(bool Selected);                                                                                            // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/HouseShop/W_EmptyShopCategory.W_EmptyShopCategory_C.Init
	void Init();                                                                                                             // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/HouseShop/W_EmptyShopCategory.W_EmptyShopCategory_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/HouseShop/W_EmptyShopCategory.W_EmptyShopCategory_C.BndEvt__W_EmptyShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
	void BndEvt__W_EmptyShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/HouseShop/W_EmptyShopCategory.W_EmptyShopCategory_C.BndEvt__W_EmptyShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__W_EmptyShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/HouseShop/W_EmptyShopCategory.W_EmptyShopCategory_C.BndEvt__W_EmptyShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__W_EmptyShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/HouseShop/W_EmptyShopCategory.W_EmptyShopCategory_C.ExecuteUbergraph_W_EmptyShopCategory
	void ExecuteUbergraph_W_EmptyShopCategory(int32_t EntryPoint);                                                           // [0x2407bf0] Final                
	// Function /Game/UI/InGameShop/HouseShop/W_EmptyShopCategory.W_EmptyShopCategory_C.OnSelected__DelegateSignature
	void OnSelected__DelegateSignature(UW_EmptyShopCategory_C* Ref);                                                         // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopCategory.WBP_MenuBarShopCategory_C
/// Size: 0x0078 (0x000280 - 0x0002F8)
class UWBP_MenuBarShopCategory_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Hover;                                                      // 0x0288   (0x0008)  
	UBorder*                                           Border_BG;                                                  // 0x0290   (0x0008)  
	UBorder*                                           Border_Selected;                                            // 0x0298   (0x0008)  
	UButton*                                           Button_CraftItem;                                           // 0x02A0   (0x0008)  
	UImage*                                            Image_BG;                                                   // 0x02A8   (0x0008)  
	UImage*                                            Image_Hovered;                                              // 0x02B0   (0x0008)  
	UImage*                                            Image_ItemIcon;                                             // 0x02B8   (0x0008)  
	UImage*                                            Image_Selected;                                             // 0x02C0   (0x0008)  
	UTextBlock*                                        Text_ItemName;                                              // 0x02C8   (0x0008)  
	TEnumAsByte<E_MenuBarShopCategory>                 Category;                                                   // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02D1   (0x0007)  MISSED
	UPaperSprite*                                      Image;                                                      // 0x02D8   (0x0008)  
	bool                                               bIsSelected;                                                // 0x02E0   (0x0001)  
	bool                                               bIsButtonEnabled;                                           // 0x02E1   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x02E2   (0x0006)  MISSED
	FMulticastInlineDelegate                           OnCategorySelected;                                         // 0x02E8   (0x0010)  


	/// Functions
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopCategory.WBP_MenuBarShopCategory_C.SetButtonEnabled
	void SetButtonEnabled(bool IsEnabled);                                                                                   // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopCategory.WBP_MenuBarShopCategory_C.SetButtonSelected
	void SetButtonSelected(bool bIsSelected);                                                                                // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopCategory.WBP_MenuBarShopCategory_C.ButtonHover
	void ButtonHover(bool bHovered, bool bWithAnim);                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopCategory.WBP_MenuBarShopCategory_C.BndEvt__WBP_MenuBarShopCategory_Button_CraftItem_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
	void BndEvt__WBP_MenuBarShopCategory_Button_CraftItem_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopCategory.WBP_MenuBarShopCategory_C.BndEvt__WBP_MenuBarShopCategory_Button_CraftItem_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_MenuBarShopCategory_Button_CraftItem_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopCategory.WBP_MenuBarShopCategory_C.OnAddedToFocusPath
	void OnAddedToFocusPath(FFocusEvent InFocusEvent);                                                                       // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopCategory.WBP_MenuBarShopCategory_C.BndEvt__WBP_MenuBarShopCategory_Button_CraftItem_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_MenuBarShopCategory_Button_CraftItem_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopCategory.WBP_MenuBarShopCategory_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopCategory.WBP_MenuBarShopCategory_C.ExecuteUbergraph_WBP_MenuBarShopCategory
	void ExecuteUbergraph_WBP_MenuBarShopCategory(int32_t EntryPoint);                                                       // [0x2407bf0] Final|HasDefaults    
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopCategory.WBP_MenuBarShopCategory_C.OnCategorySelected__DelegateSignature
	void OnCategorySelected__DelegateSignature(FText NewSelectedCategoryName, UWBP_MenuBarShopCategory_C* MenuBarShopCategory); // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C
/// Size: 0x0150 (0x000280 - 0x0003D0)
class UWBP_MenuBarShopSlot_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UBorder*                                           Border_Default;                                             // 0x0288   (0x0008)  
	UBorder*                                           Border_DefaultBottom;                                       // 0x0290   (0x0008)  
	UBorder*                                           Border_HoveredBottom;                                       // 0x0298   (0x0008)  
	UImage*                                            CarImage;                                                   // 0x02A0   (0x0008)  
	UTextBlock*                                        CarName;                                                    // 0x02A8   (0x0008)  
	UTextBlock*                                        CarName;                                                    // 0x02B0   (0x0008)  
	UTextBlock*                                        CarPrice_Default;                                           // 0x02B8   (0x0008)  
	UTextBlock*                                        CarPrice_Hovered;                                           // 0x02C0   (0x0008)  
	UImage*                                            Default;                                                    // 0x02C8   (0x0008)  
	UImage*                                            Empty;                                                      // 0x02D0   (0x0008)  
	UImage*                                            Image_Hovered;                                              // 0x02D8   (0x0008)  
	UImage*                                            Image_Status;                                               // 0x02E0   (0x0008)  
	UVerticalBox*                                      InfoVerticalBox;                                            // 0x02E8   (0x0008)  
	UImage*                                            Selected;                                                   // 0x02F0   (0x0008)  
	USizeBox*                                          SizeBox_DefaultPrice;                                       // 0x02F8   (0x0008)  
	USizeBox*                                          SizeBox_HoveredPrice;                                       // 0x0300   (0x0008)  
	UButton*                                           SlotButton;                                                 // 0x0308   (0x0008)  
	UTextBlock*                                        TextBlock;                                                  // 0x0310   (0x0008)  
	UTextBlock*                                        TextBlock;                                                  // 0x0318   (0x0008)  
	FF_MenuBarShopItem                                 InfoSlot;                                                   // 0x0320   (0x0048)  
	TEnumAsByte<E_MenuBarShopSlot>                     SlotStatus;                                                 // 0x0368   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0369   (0x0003)  MISSED
	FSlateColor                                        PriceColor;                                                 // 0x036C   (0x0014)  
	FSlateColor                                        BlackColor;                                                 // 0x0380   (0x0014)  
	FSlateColor                                        redColor;                                                   // 0x0394   (0x0014)  
	bool                                               bIsEnoughMoneyForBuy;                                       // 0x03A8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x03A9   (0x0007)  MISSED
	FMulticastInlineDelegate                           OnSelectedSlot;                                             // 0x03B0   (0x0010)  
	FMulticastInlineDelegate                           OnShowErrorMessage;                                         // 0x03C0   (0x0010)  


	/// Functions
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.ResetTextForDeutchLocalization
	void ResetTextForDeutchLocalization();                                                                                   // [0x2407bf0] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.SetSlotInfo
	void SetSlotInfo(FF_MenuBarShopItem InfoSlot);                                                                           // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.GetSlotInfo
	void GetSlotInfo(FF_MenuBarShopItem& InfoSlot);                                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.GetSlotStatus
	void GetSlotStatus(TEnumAsByte<E_MenuBarShopSlot>& SlotStatus);                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.SetSlotSelected
	void SetSlotSelected();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.SetSlotEmpty
	void SetSlotEmpty();                                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.SetSlotDefault
	void SetSlotDefault();                                                                                                   // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.BndEvt__WBP_MenuBarShopSlot_SlotButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_MenuBarShopSlot_SlotButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();        // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.BndEvt__WBP_MenuBarShopSlot_SlotButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_MenuBarShopSlot_SlotButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();        // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.BndEvt__WBP_MenuBarShopSlot_SlotButton_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature
	void BndEvt__WBP_MenuBarShopSlot_SlotButton_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();      // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.ExecuteUbergraph_WBP_MenuBarShopSlot
	void ExecuteUbergraph_WBP_MenuBarShopSlot(int32_t EntryPoint);                                                           // [0x2407bf0] Final|HasDefaults    
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.OnShowErrorMessage__DelegateSignature
	void OnShowErrorMessage__DelegateSignature(FText ErrorMessage);                                                          // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.OnSelectedSlot__DelegateSignature
	void OnSelectedSlot__DelegateSignature(UWBP_MenuBarShopSlot_C* PressedMenuBarSlot);                                      // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C
/// Size: 0x0158 (0x000280 - 0x0003D8)
class UWBP_MenuBarShop_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  ShowNotif;                                                  // 0x0288   (0x0008)  
	UWidgetAnimation*                                  NewOpem;                                                    // 0x0290   (0x0008)  
	UWidgetAnimation*                                  Close;                                                      // 0x0298   (0x0008)  
	UWidgetAnimation*                                  ShowErrorMessage;                                           // 0x02A0   (0x0008)  
	UWidgetAnimation*                                  SwipeCategory;                                              // 0x02A8   (0x0008)  
	UWidgetAnimation*                                  Open;                                                       // 0x02B0   (0x0008)  
	UButton*                                           Button;                                                     // 0x02B8   (0x0008)  
	UW_HintButtonNew_C*                                Button_Close;                                               // 0x02C0   (0x0008)  
	UW_HintButtonNew_C*                                Button_E;                                                   // 0x02C8   (0x0008)  
	UW_HintButtonNew_C*                                Button_Q;                                                   // 0x02D0   (0x0008)  
	UImage*                                            Image_ModalBG;                                              // 0x02D8   (0x0008)  
	UScrollBox*                                        ScrollBox_Content;                                          // 0x02E0   (0x0008)  
	USizeBox*                                          SizeBox_Content;                                            // 0x02E8   (0x0008)  
	UTextBlock*                                        TextBlock_WarningMessageText;                               // 0x02F0   (0x0008)  
	UUMG_LabelText_C*                                  UMG_LabelText;                                              // 0x02F8   (0x0008)  
	UUMG_LabelText_C*                                  UMG_LabelText;                                              // 0x0300   (0x0008)  
	UUniformGridPanel*                                 UniformGridPanel;                                           // 0x0308   (0x0008)  
	UVerticalBox*                                      VerticalBox_Content;                                        // 0x0310   (0x0008)  
	UWBP_MainCategorySelector_C*                       WBP_MainCategorySelector;                                   // 0x0318   (0x0008)  
	UWBP_MenuBarShopCategory_C*                        WBP_MenuBarShopCategory;                                    // 0x0320   (0x0008)  
	UWBP_MenuBarShopCategory_C*                        WBP_MenuBarShopCategory;                                    // 0x0328   (0x0008)  
	UWBP_MenuBarShopCategory_C*                        WBP_MenuBarShopCategory;                                    // 0x0330   (0x0008)  
	UWBP_ModalWindow_C*                                WBP_ModalWindow;                                            // 0x0338   (0x0008)  
	UWBP_PlayerTotalStats_C*                           WBP_PlayerTotalStats;                                       // 0x0340   (0x0008)  
	UWBP_Scroller_C*                                   WBP_Scroller;                                               // 0x0348   (0x0008)  
	ASurvPC_C*                                         CachedController;                                           // 0x0350   (0x0008)  
	UBPC_PlayerStatsComponent_C*                       PlayerStatsComponent_Ref;                                   // 0x0358   (0x0008)  
	FTimerHandle                                       UpdateStats_Timer;                                          // 0x0360   (0x0008)  
	UWBP_MenuBarShopCategory_C*                        SelectedCategory;                                           // 0x0368   (0x0008)  
	TArray<UWBP_MenuBarShopCategory_C*>                Categories;                                                 // 0x0370   (0x0010)  
	TArray<FF_MenuBarShopItem>                         AllMenuBar;                                                 // 0x0380   (0x0010)  
	int32_t                                            Row;                                                        // 0x0390   (0x0004)  
	int32_t                                            column;                                                     // 0x0394   (0x0004)  
	TArray<UWBP_MenuBarShopSlot_C*>                    MenuBarSlots;                                               // 0x0398   (0x0010)  
	bool                                               bIsSlotEmpty;                                               // 0x03A8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x03A9   (0x0007)  MISSED
	UWBP_MenuBarShopSlot_C*                            SelectedSlot;                                               // 0x03B0   (0x0008)  
	FMulticastInlineDelegate                           OnCloseShop;                                                // 0x03B8   (0x0010)  
	FMulticastInlineDelegate                           OnSelectedSlot;                                             // 0x03C8   (0x0010)  


	/// Functions
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.SortMenuBy
	void SortMenuBy(TEnumAsByte<E_MenuBarShopCategory> SortCategory);                                                        // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.ChangeSelectedButton
	void ChangeSelectedButton(FText NewCategoryText, UWBP_MenuBarShopCategory_C* NewSelectedCategory);                       // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.UpdateStats_Func
	void UpdateStats_Func();                                                                                                 // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.Finished_D0D28BE04B78FA29BBE7B79B7EA81DDF
	void Finished_D0D28BE04B78FA29BBE7B79B7EA81DDF();                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.Finished_B322082E4A71206831C60DAFDE4D1502
	void Finished_B322082E4A71206831C60DAFDE4D1502();                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.Finished_1164BAD94E5FDCC4A59CA6BA0A62389B
	void Finished_1164BAD94E5FDCC4A59CA6BA0A62389B();                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.OnChangeCategory
	void OnChangeCategory(FText NewSelectedCategoryName, UWBP_MenuBarShopCategory_C* MenuBarShopCategory);                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.CloseShop
	void CloseShop();                                                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.OnChangeSelectedSlot
	void OnChangeSelectedSlot(UWBP_MenuBarShopSlot_C* PressedMenuBarSlot);                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.BndEvt__WBP_MenuBarShop_Button_Close_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
	void BndEvt__WBP_MenuBarShop_Button_Close_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();                   // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.OnShowErrorMessage
	void OnShowErrorMessage(FText ErrorMessage);                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.CloseShopBind
	void CloseShopBind();                                                                                                    // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.BndEvt__WBP_MenuBarShop_WBP_ModalWindow_K2Node_ComponentBoundEvent_1_OnAccept__DelegateSignature
	void BndEvt__WBP_MenuBarShop_WBP_ModalWindow_K2Node_ComponentBoundEvent_1_OnAccept__DelegateSignature();                 // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.BndEvt__WBP_MenuBarShop_Button_124_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature
	void BndEvt__WBP_MenuBarShop_Button_124_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();          // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.OnConfirmNotEnoughMoneyNotif
	void OnConfirmNotEnoughMoneyNotif();                                                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.ExecuteUbergraph_WBP_MenuBarShop
	void ExecuteUbergraph_WBP_MenuBarShop(int32_t EntryPoint);                                                               // [0x2407bf0] Final|HasDefaults    
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.OnSelectedSlot__DelegateSignature
	void OnSelectedSlot__DelegateSignature(UWBP_MenuBarShopSlot_C* CurrentSelectedSlot);                                     // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/MenuBarShop/WBP_MenuBarShop.WBP_MenuBarShop_C.OnCloseShop__DelegateSignature
	void OnCloseShop__DelegateSignature();                                                                                   // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Tutorial/WBP_FlareSequenceTutorial.WBP_FlareSequenceTutorial_C
/// Size: 0x0029 (0x000280 - 0x0002A9)
class UWBP_FlareSequenceTutorial_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  ShowLogo_Anim;                                              // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Hide_Anim;                                                  // 0x0290   (0x0008)  
	UWidgetAnimation*                                  ShowFlare_Anim;                                             // 0x0298   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_Logo;                                        // 0x02A0   (0x0008)  
	bool                                               Showed;                                                     // 0x02A8   (0x0001)  


	/// Functions
	// Function /Game/UI/Tutorial/WBP_FlareSequenceTutorial.WBP_FlareSequenceTutorial_C.Finished_89CA5B88437C86A4C0E7C28DA037F846
	void Finished_89CA5B88437C86A4C0E7C28DA037F846();                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Tutorial/WBP_FlareSequenceTutorial.WBP_FlareSequenceTutorial_C.Show
	void Show(bool Show);                                                                                                    // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Tutorial/WBP_FlareSequenceTutorial.WBP_FlareSequenceTutorial_C.ShowLogo_MyTona
	void ShowLogo_MyTona(bool bShow);                                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Tutorial/WBP_FlareSequenceTutorial.WBP_FlareSequenceTutorial_C.ShowLogo_Fntastic
	void ShowLogo_Fntastic(bool bShow);                                                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Tutorial/WBP_FlareSequenceTutorial.WBP_FlareSequenceTutorial_C.ExecuteUbergraph_WBP_FlareSequenceTutorial
	void ExecuteUbergraph_WBP_FlareSequenceTutorial(int32_t EntryPoint);                                                     // [0x2407bf0] Final                
};

/// Class /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C
/// Size: 0x0230 (0x000280 - 0x0004B0)
class UW_RPShop_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  SwitchCategory;                                             // 0x0288   (0x0008)  
	UWidgetAnimation*                                  CloseDialogue;                                              // 0x0290   (0x0008)  
	UWidgetAnimation*                                  OpenDialogue;                                               // 0x0298   (0x0008)  
	UWidgetAnimation*                                  HideWaringMessageAnim;                                      // 0x02A0   (0x0008)  
	UWidgetAnimation*                                  ShowWarningMessageAnim;                                     // 0x02A8   (0x0008)  
	UWidgetAnimation*                                  Close;                                                      // 0x02B0   (0x0008)  
	UWidgetAnimation*                                  Open;                                                       // 0x02B8   (0x0008)  
	UW_HintButtonNew_C*                                Button_Close;                                               // 0x02C0   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_Buy;                                          // 0x02C8   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_Empty;                                        // 0x02D0   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_Pockets;                                      // 0x02D8   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_Sell;                                         // 0x02E0   (0x0008)  
	UOverlay*                                          Overlay;                                                    // 0x02E8   (0x0008)  
	UOverlay*                                          Overlay_TitleContainer;                                     // 0x02F0   (0x0008)  
	UScrollBox*                                        ScrollBox_Buy;                                              // 0x02F8   (0x0008)  
	UScrollBox*                                        ScrollBox_Items;                                            // 0x0300   (0x0008)  
	UScrollBox*                                        ScrollBox_Items_Shop;                                       // 0x0308   (0x0008)  
	USizeBox*                                          SizeBox_Emptylabel;                                         // 0x0310   (0x0008)  
	USpacer*                                           Spacer_Buyback;                                             // 0x0318   (0x0008)  
	UTextBlock*                                        TextBlock_EmptyPageLabel;                                   // 0x0320   (0x0008)  
	UTextBlock*                                        TextBlock_WarningMessageText;                               // 0x0328   (0x0008)  
	UTextBlock*                                        TextShop;                                                   // 0x0330   (0x0008)  
	UTextBlock*                                        TextShopRight;                                              // 0x0338   (0x0008)  
	UUMG_LabelText_C*                                  UMG_LabelText;                                              // 0x0340   (0x0008)  
	UUMG_LabelText_C*                                  UMG_LabelText_Backpack;                                     // 0x0348   (0x0008)  
	UUMG_LabelText_C*                                  UMG_LabelText_Sell;                                         // 0x0350   (0x0008)  
	UUniformGridPanel*                                 UniformGridPanel_Content;                                   // 0x0358   (0x0008)  
	UVerticalBox*                                      VerticalBox_Backpack;                                       // 0x0360   (0x0008)  
	UVerticalBox*                                      VerticalBox_Category;                                       // 0x0368   (0x0008)  
	UVerticalBox*                                      VerticalBox_ContentBuy;                                     // 0x0370   (0x0008)  
	UVerticalBox*                                      VerticalBox_NoItems;                                        // 0x0378   (0x0008)  
	UW_ShopCategoryContainer_C*                        W_ShopCategoryContainer;                                    // 0x0380   (0x0008)  
	UWBP_MainCategorySelector_C*                       WBP_MainCategorySelector;                                   // 0x0388   (0x0008)  
	UWBP_ScrollboxSlider_C*                            WBP_ScrollboxSlider;                                        // 0x0390   (0x0008)  
	UWBP_ScrollboxSlider_C*                            WBP_ScrollboxSlider_Backpack;                               // 0x0398   (0x0008)  
	UWBP_ScrollboxSlider_C*                            WBP_ScrollboxSlider_Shop;                                   // 0x03A0   (0x0008)  
	UWBP_ShopDialogue_C*                               WBP_ShopDialogue;                                           // 0x03A8   (0x0008)  
	UWBP_Stat_C*                                       WBP_Stat_HP;                                                // 0x03B0   (0x0008)  
	UWBP_Stat_C*                                       WBP_Stat_Hunger;                                            // 0x03B8   (0x0008)  
	UWBP_Stat_C*                                       WBP_Stat_Thirst;                                            // 0x03C0   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_LabelText;                                   // 0x03C8   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_Main;                                        // 0x03D0   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_NoItems;                                     // 0x03D8   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_TitleContainer;                              // 0x03E0   (0x0008)  
	ASurvPC_C*                                         CachedController;                                           // 0x03E8   (0x0008)  
	UBPC_PlayerStatsComponent_C*                       PlayerStatsComponent_Ref;                                   // 0x03F0   (0x0008)  
	FTimerHandle                                       UpdateStats_Timer;                                          // 0x03F8   (0x0008)  
	ABP_Shops_C*                                       CachedShop;                                                 // 0x0400   (0x0008)  
	FMulticastInlineDelegate                           OnClose_RPShop_;                                            // 0x0408   (0x0010)  
	TArray<FName>                                      CategoryArray;                                              // 0x0418   (0x0010)  
	UW_ShopCategory_C*                                 Category_Selected_;                                         // 0x0428   (0x0008)  
	UW_RPShopSlot_C*                                   SelectedSlot;                                               // 0x0430   (0x0008)  
	TArray<UW_RPShopSlot_C*>                           ItemsArray;                                                 // 0x0438   (0x0010)  
	TArray<UW_RPShopSlot_C*>                           ItemsArrayOnCategory;                                       // 0x0448   (0x0010)  
	TEnumAsByte<ShopCategory>                          ShopState;                                                  // 0x0458   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0459   (0x0007)  MISSED
	FTimerHandle                                       WarningMessageTimer;                                        // 0x0460   (0x0008)  
	int32_t                                            Count_Dialogue_;                                            // 0x0468   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x046C   (0x0004)  MISSED
	UW_RPShopSlot_C*                                   Start_Buy_Ref;                                              // 0x0470   (0x0008)  
	int32_t                                            CategorySelectorIndex;                                      // 0x0478   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x047C   (0x0004)  MISSED
	FText                                              PlayerName;                                                 // 0x0480   (0x0018)  
	FText                                              PlayerStatus;                                               // 0x0498   (0x0018)  


	/// Functions
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.ChangeStateNext
	void ChangeStateNext();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Change State Preview
	void Change State Preview();                                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Buyback Item
	void Buyback Item(FFItemInfo FItemInfo, int32_t Count, UJSI_Slot_C* JSI Slot);                                           // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Check RP Point JSI_Slot
	bool Check RP Point JSI_Slot(UJSI_Slot_C* SelectedSlot);                                                                 // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.InitBuyback
	void InitBuyback();                                                                                                      // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Sell Item
	void Sell Item(UJSI_Slot_C* Ref slot, int32_t Count);                                                                    // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Add Item Remove Money
	void Add Item Remove Money(ASurvivalPlayer_C* PlayerReference, FFItemInfo ItemInfo, int32_t MoneyCount, int32_t RPoints); // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.BuyItem
	void BuyItem(FFItemInfo& FItemInfo, int32_t RPoints);                                                                    // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Check RP Point RPoint Slot
	bool Check RP Point RPoint Slot(UW_RPShopSlot_C* SelectedSlot);                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Calculate Result Price
	int32_t Calculate Result Price(FFItemInfo& FItemInfo);                                                                   // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Check Can Buy
	bool Check Can Buy(FFItemInfo& FItemInfo);                                                                               // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Check Free Space To Add Item
	void Check Free Space To Add Item(FFItemInfo& FItemInfo, bool& Return);                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Init Pocket
	void Init Pocket();                                                                                                      // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.InitItemsCategories
	void InitItemsCategories(FName Category Name);                                                                           // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.InitItems
	void InitItems();                                                                                                        // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Category Selected
	void Category Selected(UW_ShopCategory_C* Ref);                                                                          // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.InitCategory
	void InitCategory();                                                                                                     // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.UpdateStats_Func
	void UpdateStats_Func();                                                                                                 // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Finished_00E858F049E128F8B65B83B69EFD406A
	void Finished_00E858F049E128F8B65B83B69EFD406A();                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.OpenShop
	void OpenShop();                                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.CloseShop
	void CloseShop();                                                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.BndEvt__W_RPShop_Button_Close_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
	void BndEvt__W_RPShop_Button_Close_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();                          // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.BndEvt__W_RPShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature
	void BndEvt__W_RPShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_1_OnCategoryChanged__DelegateSignature(int32_t Index); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.ChangeShopState
	void ChangeShopState(TEnumAsByte<ShopCategory> New Shop State);                                                          // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.OnTransactionNotApproved
	void OnTransactionNotApproved(TEnumAsByte<E_ReasonForCancelingTransaction> CancelReason);                                // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.ShowWarningMessage
	void ShowWarningMessage(FText MessageText, UFMODEvent* FMODEvent);                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.HideWarningMessage
	void HideWarningMessage();                                                                                               // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Start Buy Dialogue
	void Start Buy Dialogue(UW_RPShopSlot_C* Ref Item);                                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Start Sell
	void Start Sell(UJSIContainer_C* Container, UJSI_Slot_C* slotRef, FKey Button);                                          // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.OpenDialogue 
	void OpenDialogue (UJSI_Slot_C* Ref);                                                                                    // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.CloseDialogue 
	void CloseDialogue ();                                                                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_2_OnPressedAccept__DelegateSignature
	void BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_2_OnPressedAccept__DelegateSignature(int32_t Count, UJSI_Slot_C* Ref slot); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_3_OnPressedDecline__DelegateSignature
	void BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_3_OnPressedDecline__DelegateSignature();               // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Start Buyback
	void Start Buyback(UJSIContainer_C* Container, UJSI_Slot_C* slotRef, FKey Button);                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.ChangeStateAnim
	void ChangeStateAnim();                                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.ChangeCategoryBuy
	void ChangeCategoryBuy(UW_ShopCategory_C* Ref);                                                                          // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.SwitchCategory 
	void SwitchCategory ();                                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_4_OnPressenConfirmAccept__DelegateSignature
	void BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_4_OnPressenConfirmAccept__DelegateSignature();         // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_5_OnPressedConfirmDecline__DelegateSignature
	void BndEvt__W_RPShop_WBP_ShopDialogue_K2Node_ComponentBoundEvent_5_OnPressedConfirmDecline__DelegateSignature();        // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Start Buy
	void Start Buy();                                                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.ConfirmWindow Sell Buyback
	void ConfirmWindow Sell Buyback(int32_t Count, UJSI_Slot_C* Ref);                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.Confirm Window OnKeyDown
	void Confirm Window OnKeyDown();                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.ExecuteUbergraph_W_RPShop
	void ExecuteUbergraph_W_RPShop(int32_t EntryPoint);                                                                      // [0x2407bf0] Final|HasDefaults    
	// Function /Game/UI/InGameShop/ShopWithRPoints/W_RPShop.W_RPShop_C.OnClose(RPShop)__DelegateSignature
	void OnClose(RPShop)__DelegateSignature();                                                                               // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/ContainerSystem/BP_BaseDragOperation.BP_BaseDragOperation_C
/// Size: 0x02B8 (0x000090 - 0x000348)
class UBP_BaseDragOperation_C : public UDragDropOperation : UDragDropOperation
{ 
public:
	FContainerPickupsInfo                              DragItemData;                                               // 0x0090   (0x0068)  
	FVector2D                                          DragOffset;                                                 // 0x00F8   (0x0010)  
	int32_t                                            PivotIndex;                                                 // 0x0108   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x010C   (0x0004)  MISSED
	UW_BaseContainer_C*                                SenderContainer;                                            // 0x0110   (0x0008)  
	FFItemInfo                                         SenderItemInfo;                                             // 0x0118   (0x0220)  
	bool                                               bIsRotated;                                                 // 0x0338   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0339   (0x0007)  MISSED
	UW_BaseSlot_C*                                     ReceiverSlot;                                               // 0x0340   (0x0008)  
};

/// Class /Game/UI/Inventory/WBP_ScrollboxSlider.WBP_ScrollboxSlider_C
/// Size: 0x0020 (0x000280 - 0x0002A0)
class UWBP_ScrollboxSlider_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	USlider*                                           Slider_Loot;                                                // 0x0288   (0x0008)  
	UScrollBox*                                        ScrollBox;                                                  // 0x0290   (0x0008)  
	double                                             MousewheelOffset;                                           // 0x0298   (0x0008)  


	/// Functions
	// Function /Game/UI/Inventory/WBP_ScrollboxSlider.WBP_ScrollboxSlider_C.CREATEDELEGATE_PROXYFUNCTION
	void CREATEDELEGATE_PROXYFUNCTION(float CurrentOffset);                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/WBP_ScrollboxSlider.WBP_ScrollboxSlider_C.ChangeStyleOnDrag
	void ChangeStyleOnDrag(bool bDrag);                                                                                      // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/WBP_ScrollboxSlider.WBP_ScrollboxSlider_C.OnMouseWheel
	FEventReply OnMouseWheel(FGeometry MyGeometry, FPointerEvent& MouseEvent);                                               // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/WBP_ScrollboxSlider.WBP_ScrollboxSlider_C.SetSliderValue
	void SetSliderValue(double Value);                                                                                       // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/WBP_ScrollboxSlider.WBP_ScrollboxSlider_C.BndEvt__WBP_ScrollboxSlider_Slider_Loot_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
	void BndEvt__WBP_ScrollboxSlider_Slider_Loot_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Inventory/WBP_ScrollboxSlider.WBP_ScrollboxSlider_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Inventory/WBP_ScrollboxSlider.WBP_ScrollboxSlider_C.BndEvt__WBP_ScrollboxSlider_Slider_Loot_K2Node_ComponentBoundEvent_1_OnMouseCaptureBeginEvent__DelegateSignature
	void BndEvt__WBP_ScrollboxSlider_Slider_Loot_K2Node_ComponentBoundEvent_1_OnMouseCaptureBeginEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Inventory/WBP_ScrollboxSlider.WBP_ScrollboxSlider_C.BndEvt__WBP_ScrollboxSlider_Slider_Loot_K2Node_ComponentBoundEvent_2_OnMouseCaptureEndEvent__DelegateSignature
	void BndEvt__WBP_ScrollboxSlider_Slider_Loot_K2Node_ComponentBoundEvent_2_OnMouseCaptureEndEvent__DelegateSignature();   // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Inventory/WBP_ScrollboxSlider.WBP_ScrollboxSlider_C.ExecuteUbergraph_WBP_ScrollboxSlider
	void ExecuteUbergraph_WBP_ScrollboxSlider(int32_t EntryPoint);                                                           // [0x2407bf0] Final                
};

/// Class /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C
/// Size: 0x02F8 (0x000280 - 0x000578)
class UWBP_RepairEntry_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Progress_Fill;                                              // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Hover;                                                      // 0x0290   (0x0008)  
	UBorder*                                           Border;                                                     // 0x0298   (0x0008)  
	UButton*                                           Button;                                                     // 0x02A0   (0x0008)  
	UImage*                                            Image_DurabilityIcon;                                       // 0x02A8   (0x0008)  
	UImage*                                            Image_ItemIcon;                                             // 0x02B0   (0x0008)  
	UImage*                                            Image_MoneyIcon;                                            // 0x02B8   (0x0008)  
	UProgressBar*                                      ProgressBar_Repair;                                         // 0x02C0   (0x0008)  
	UTextBlock*                                        Text_Durability;                                            // 0x02C8   (0x0008)  
	UTextBlock*                                        Text_ItemName;                                              // 0x02D0   (0x0008)  
	UTextBlock*                                        Text_RepairPrice;                                           // 0x02D8   (0x0008)  
	UTextBlock*                                        Text_Size;                                                  // 0x02E0   (0x0008)  
	UTextBlock*                                        Text_Weight;                                                // 0x02E8   (0x0008)  
	UVerticalBox*                                      VerticalBox_Content;                                        // 0x02F0   (0x0008)  
	FFItemInfo                                         ItemInfo;                                                   // 0x02F8   (0x0220)  
	bool                                               IsEmpty;                                                    // 0x0518   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0519   (0x0007)  MISSED
	FMulticastInlineDelegate                           OnWeaponRepaired;                                           // 0x0520   (0x0010)  
	int32_t                                            RepairPrice;                                                // 0x0530   (0x0004)  
	bool                                               HaveEnoughMoney;                                            // 0x0534   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0535   (0x0003)  MISSED
	FLinearColor                                       Color_NotEnough;                                            // 0x0538   (0x0010)  
	FLinearColor                                       Color_Enough;                                               // 0x0548   (0x0010)  
	bool                                               FullDurability;                                             // 0x0558   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0559   (0x0007)  MISSED
	FTimerHandle                                       ProgressTimer;                                              // 0x0560   (0x0008)  
	int32_t                                            ItemUID;                                                    // 0x0568   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x056C   (0x0004)  MISSED
	ASurvivalPlayer_C*                                 Survival_Player;                                            // 0x0570   (0x0008)  


	/// Functions
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.StopProgress
	void StopProgress();                                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.GetRepairPrice
	void GetRepairPrice(int32_t& RepairPrice);                                                                               // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.GetEnoughMoney
	void GetEnoughMoney(bool& HaveEnoughMoney);                                                                              // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.Set Enough
	void Set Enough(bool Enough, UTextBlock* TextElement, UImage* Icon);                                                     // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.Repair
	void Repair();                                                                                                           // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.OnMouseButtonDown
	FEventReply OnMouseButtonDown(FGeometry MyGeometry, FPointerEvent& MouseEvent);                                          // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.Init
	void Init();                                                                                                             // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.BndEvt__WBP_RepairEntry_Button_0_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_RepairEntry_Button_0_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();              // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.BndEvt__WBP_RepairEntry_Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_RepairEntry_Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();              // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.StartProcess
	void StartProcess();                                                                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.ProgressFilled
	void ProgressFilled();                                                                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.ExecuteUbergraph_WBP_RepairEntry
	void ExecuteUbergraph_WBP_RepairEntry(int32_t EntryPoint);                                                               // [0x2407bf0] Final|HasDefaults    
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairEntry.WBP_RepairEntry_C.OnWeaponRepaired__DelegateSignature
	void OnWeaponRepaired__DelegateSignature();                                                                              // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C
/// Size: 0x00B2 (0x000280 - 0x000332)
class UW_DialogueButtons_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Select_Anim;                                                // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Hover_Anim;                                                 // 0x0290   (0x0008)  
	UWidgetAnimation*                                  UniqueHide_Anim;                                            // 0x0298   (0x0008)  
	UWidgetAnimation*                                  Hide_Anim;                                                  // 0x02A0   (0x0008)  
	UButton*                                           Button_Answer;                                              // 0x02A8   (0x0008)  
	UImage*                                            Image_BG;                                                   // 0x02B0   (0x0008)  
	UImage*                                            Image_PhraseIcon;                                           // 0x02B8   (0x0008)  
	UImage*                                            Image_PhraseIcon_Shadow;                                    // 0x02C0   (0x0008)  
	UTextBlock*                                        TextBlock_Answer;                                           // 0x02C8   (0x0008)  
	bool                                               IsSelected;                                                 // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02D1   (0x0003)  MISSED
	int32_t                                            Index;                                                      // 0x02D4   (0x0004)  
	FText                                              AnswerText;                                                 // 0x02D8   (0x0018)  
	UW_Dialogue_C*                                     ParentRef;                                                  // 0x02F0   (0x0008)  
	TWeakObjectPtr<UPaperSprite*>                      PhraseIcon;                                                 // 0x02F8   (0x0030)  
	bool                                               bIsHovered;                                                 // 0x0328   (0x0001)  
	bool                                               bIsClicked;                                                 // 0x0329   (0x0001)  
	bool                                               bShowNumber;                                                // 0x032A   (0x0001)  
	bool                                               Picked_;                                                    // 0x032B   (0x0001)  
	int32_t                                            Picked_Answer;                                              // 0x032C   (0x0004)  
	bool                                               isButtonBack;                                               // 0x0330   (0x0001)  
	bool                                               AnimationPlayed;                                            // 0x0331   (0x0001)  


	/// Functions
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.GetIsButtonBack
	void GetIsButtonBack(bool& isButtonBack);                                                                                // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.GetPickedAnswer
	void GetPickedAnswer(int32_t& PickedAnswer);                                                                             // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.SetPickedAnswers
	void SetPickedAnswers(bool Picked?);                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.ParseNickname
	void ParseNickname();                                                                                                    // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.BndEvt__W_DialogueButtons_Button_Answer_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	void BndEvt__W_DialogueButtons_Button_Answer_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();     // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.OnSelectPhraseChanged_Event
	void OnSelectPhraseChanged_Event(int32_t PhraseIndex);                                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.Destruct
	void Destruct();                                                                                                         // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.ShowHighlightEffect
	void ShowHighlightEffect();                                                                                              // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.HideHighlightEffect
	void HideHighlightEffect();                                                                                              // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.BndEvt__W_DialogueButtons_Button_Answer_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__W_DialogueButtons_Button_Answer_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();       // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.BndEvt__W_DialogueButtons_Button_Answer_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
	void BndEvt__W_DialogueButtons_Button_Answer_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();       // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.HideButton
	void HideButton();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.UniqueHideButton
	void UniqueHideButton();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Dialogue/W_DialogueButtons.W_DialogueButtons_C.ExecuteUbergraph_W_DialogueButtons
	void ExecuteUbergraph_W_DialogueButtons(int32_t EntryPoint);                                                             // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/UI/Inventory/InventoryInteraction/WBP_RepairTab.WBP_RepairTab_C
/// Size: 0x00F9 (0x000280 - 0x000379)
class UWBP_RepairTab_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UUniformGridPanel*                                 UniformGridPanel_Items;                                     // 0x0288   (0x0008)  
	UWBP_RepairEntry_C*                                WBP_RepairEntry;                                            // 0x0290   (0x0008)  
	UWBP_RepairEntry_C*                                WBP_RepairEntry;                                            // 0x0298   (0x0008)  
	UWBP_RepairEntry_C*                                WBP_RepairEntry;                                            // 0x02A0   (0x0008)  
	UWBP_RepairEntry_C*                                WBP_RepairEntry;                                            // 0x02A8   (0x0008)  
	UWBP_RepairEntry_C*                                WBP_RepairEntry;                                            // 0x02B0   (0x0008)  
	UWBP_RepairEntry_C*                                WBP_RepairEntry;                                            // 0x02B8   (0x0008)  
	UWBP_RepairEntry_C*                                WBP_RepairEntry;                                            // 0x02C0   (0x0008)  
	UWBP_RepairEntry_C*                                WBP_RepairEntry;                                            // 0x02C8   (0x0008)  
	UWBP_RepairEntry_C*                                WBP_RepairEntry;                                            // 0x02D0   (0x0008)  
	UWBP_RepairEntry_C*                                WBP_RepairEntry;                                            // 0x02D8   (0x0008)  
	UWBP_RepairEntry_C*                                WBP_RepairEntry;                                            // 0x02E0   (0x0008)  
	UWBP_RepairEntry_C*                                WBP_RepairEntry;                                            // 0x02E8   (0x0008)  
	int32_t                                            ItemsPerRow;                                                // 0x02F0   (0x0004)  
	int32_t                                            MinEntriesCount;                                            // 0x02F4   (0x0004)  
	TArray<UWBP_RepairEntry_C*>                        EntryList;                                                  // 0x02F8   (0x0010)  
	FMulticastInlineDelegate                           OnRecalculateRepairAllPrice;                                // 0x0308   (0x0010)  
	TMap<int32_t, double>                              ItemsMap;                                                   // 0x0318   (0x0050)  
	TArray<FFItemInfo>                                 ValidItems;                                                 // 0x0368   (0x0010)  
	bool                                               bHaveItemsToRepair;                                         // 0x0378   (0x0001)  


	/// Functions
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairTab.WBP_RepairTab_C.GetHaveItemsToRepair
	void GetHaveItemsToRepair(bool& bHaveItemsToRepair);                                                                     // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairTab.WBP_RepairTab_C.SortIteration
	void SortIteration(int32_t First, int32_t Last);                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairTab.WBP_RepairTab_C.SortSetPivot
	void SortSetPivot(int32_t First, int32_t Last, int32_t& PivotIndex);                                                     // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairTab.WBP_RepairTab_C.Sort
	void Sort();                                                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairTab.WBP_RepairTab_C.RepairAll
	void RepairAll();                                                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairTab.WBP_RepairTab_C.GetEntries
	void GetEntries(TArray<UWBP_RepairEntry_C*>& EntryList);                                                                 // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairTab.WBP_RepairTab_C.Init
	void Init();                                                                                                             // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairTab.WBP_RepairTab_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairTab.WBP_RepairTab_C.ExecuteUbergraph_WBP_RepairTab
	void ExecuteUbergraph_WBP_RepairTab(int32_t EntryPoint);                                                                 // [0x2407bf0] Final                
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_RepairTab.WBP_RepairTab_C.OnRecalculateRepairAllPrice__DelegateSignature
	void OnRecalculateRepairAllPrice__DelegateSignature(bool bEnoughMoney);                                                  // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C
/// Size: 0x05FC (0x000280 - 0x00087C)
class UWBP_InventoryToItem_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  CloseDialogue;                                              // 0x0288   (0x0008)  
	UWidgetAnimation*                                  OpenDialogue;                                               // 0x0290   (0x0008)  
	UWidgetAnimation*                                  SwitchContainerCategory;                                    // 0x0298   (0x0008)  
	UHorizontalBox*                                    HorizontalBox;                                              // 0x02A0   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_Main;                                         // 0x02A8   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_Pockets;                                      // 0x02B0   (0x0008)  
	UJSIContainer_C*                                   JSIContainer_Shop;                                          // 0x02B8   (0x0008)  
	UOverlay*                                          Overlay;                                                    // 0x02C0   (0x0008)  
	UOverlay*                                          Overlay;                                                    // 0x02C8   (0x0008)  
	UOverlay*                                          Overlay_TitleContainer;                                     // 0x02D0   (0x0008)  
	UOverlay*                                          Overlay_TitleContainer;                                     // 0x02D8   (0x0008)  
	UScrollBox*                                        ScrollBox_Items;                                            // 0x02E0   (0x0008)  
	UScrollBox*                                        ScrollBox_Items_Shop;                                       // 0x02E8   (0x0008)  
	UScrollBox*                                        ScrollBox_Items_ShopCategory;                               // 0x02F0   (0x0008)  
	USizeBox*                                          SizeBox_Emptylabel;                                         // 0x02F8   (0x0008)  
	USizeBox*                                          SizeBox_Emptylabel;                                         // 0x0300   (0x0008)  
	USpacer*                                           Spacer_backpack;                                            // 0x0308   (0x0008)  
	USpacer*                                           Spacer_Buyback;                                             // 0x0310   (0x0008)  
	USpacer*                                           Spacer_Opacue;                                              // 0x0318   (0x0008)  
	UTextBlock*                                        TextBlock_EmptyPageLabel;                                   // 0x0320   (0x0008)  
	UTextBlock*                                        TextBlock_EmptyPageLabel;                                   // 0x0328   (0x0008)  
	UTextBlock*                                        TextShop;                                                   // 0x0330   (0x0008)  
	UTextBlock*                                        TextShop;                                                   // 0x0338   (0x0008)  
	UTextBlock*                                        TextShopRight;                                              // 0x0340   (0x0008)  
	UUMG_LabelText_C*                                  UMG_LabelText_Backpack;                                     // 0x0348   (0x0008)  
	UUMG_LabelText_C*                                  UMG_LabelText_Sell;                                         // 0x0350   (0x0008)  
	UVerticalBox*                                      VerticalBox_Backpack;                                       // 0x0358   (0x0008)  
	UVerticalBox*                                      VerticalBox_ContentBuy;                                     // 0x0360   (0x0008)  
	UVerticalBox*                                      VerticalBox_ContentCategory;                                // 0x0368   (0x0008)  
	UVerticalBox*                                      VerticalBox_NoItems;                                        // 0x0370   (0x0008)  
	UVerticalBox*                                      VerticalBox_Shop;                                           // 0x0378   (0x0008)  
	UVerticalBox*                                      VerticalBox_ShopCategory;                                   // 0x0380   (0x0008)  
	UWBP_ScrollboxSlider_C*                            WBP_ScrollboxSlider_Backpack;                               // 0x0388   (0x0008)  
	UWBP_ScrollboxSlider_C*                            WBP_ScrollboxSlider_Shop;                                   // 0x0390   (0x0008)  
	UWBP_ShopDialogue_C*                               WBP_ShopDialogue;                                           // 0x0398   (0x0008)  
	UWBP_ItemInteractionInfo_C*                        WBP_WorkbenchCraftInfo;                                     // 0x03A0   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_LabelText;                                   // 0x03A8   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_NoItems;                                     // 0x03B0   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_TitleContainer;                              // 0x03B8   (0x0008)  
	UJSI_Slot_C*                                       SellSelectedSlot;                                           // 0x03C0   (0x0008)  
	FName                                              Craft_Item_Name;                                            // 0x03C8   (0x0008)  
	FMulticastInlineDelegate                           EntrySelected;                                              // 0x03D0   (0x0010)  
	FMulticastInlineDelegate                           ProcessFinished;                                            // 0x03E0   (0x0010)  
	FFItemInfo                                         Item_Info;                                                  // 0x03F0   (0x0220)  
	FMulticastInlineDelegate                           InventoryUpdated;                                           // 0x0610   (0x0010)  
	bool                                               BoundToInventoryUpdate;                                     // 0x0620   (0x0001)  
	bool                                               UseMoney;                                                   // 0x0621   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0622   (0x0006)  MISSED
	FText                                              Action;                                                     // 0x0628   (0x0018)  
	FText                                              Processing;                                                 // 0x0640   (0x0018)  
	FText                                              Error_No_Free_Space;                                        // 0x0658   (0x0018)  
	FText                                              Resource_Label;                                             // 0x0670   (0x0018)  
	FMulticastInlineDelegate                           OnCreateCountChanged;                                       // 0x0688   (0x0010)  
	int32_t                                            Count;                                                      // 0x0698   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x069C   (0x0004)  MISSED
	FMulticastInlineDelegate                           OnSelectedSlotRMBDown;                                      // 0x06A0   (0x0010)  
	FMulticastInlineDelegate                           OnProcessStarted;                                           // 0x06B0   (0x0010)  
	bool                                               bPlaySwapAnimation;                                         // 0x06C0   (0x0001)  
	bool                                               NewVar;                                                     // 0x06C1   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x06C2   (0x0006)  MISSED
	UFMODEvent*                                        SoundEvent_ActionStart;                                     // 0x06C8   (0x0008)  
	FFMODEventInstance                                 ProcessSound;                                               // 0x06D0   (0x0008)  
	FText                                              Shop_Title_Text;                                            // 0x06D8   (0x0018)  
	FText                                              ShopTitleRightText;                                         // 0x06F0   (0x0018)  
	FMulticastInlineDelegate                           OnSellProcessStarted;                                       // 0x0708   (0x0010)  
	FMulticastInlineDelegate                           OnBuyProcessFinished;                                       // 0x0718   (0x0010)  
	FText                                              ContainerBuyback;                                           // 0x0728   (0x0018)  
	FMulticastInlineDelegate                           OnBuyBackProcessFinished;                                   // 0x0740   (0x0010)  
	bool                                               ShopCategoryOpacue;                                         // 0x0750   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x0751   (0x0007)  MISSED
	UW_ShopCategory_C*                                 ShopCategoryRef;                                            // 0x0758   (0x0008)  
	UW_ShopCategory_C*                                 Selected_Slot_Category;                                     // 0x0760   (0x0008)  
	TArray<UW_ShopCategory_C*>                         EntryList;                                                  // 0x0768   (0x0010)  
	TMap<TEnumAsByte, UW_ShopCategory_C*>              EntryListCategory;                                          // 0x0778   (0x0050)  
	TMap<TEnumAsByte, UJSI_Slot_C*>                    CategoryItems;                                              // 0x07C8   (0x0050)  
	UW_ShopCategoryContainer_C*                        ShopContainerRef;                                           // 0x0818   (0x0008)  
	FText                                              SellContainerName;                                          // 0x0820   (0x0018)  
	FText                                              Container_Name;                                             // 0x0838   (0x0018)  
	FMulticastInlineDelegate                           OnUpdateContainerBuyback;                                   // 0x0850   (0x0010)  
	UJSIContainer_C*                                   BuybackContainer;                                           // 0x0860   (0x0008)  
	UJSI_Slot_C*                                       Buyback_Slot_Ref;                                           // 0x0868   (0x0008)  
	int32_t                                            Label_Text_Switcher;                                        // 0x0870   (0x0004)  
	int32_t                                            TitleContainerSwithcer;                                     // 0x0874   (0x0004)  
	int32_t                                            CountItem;                                                  // 0x0878   (0x0004)  


	/// Functions
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.HideOpacityAllCategory
	void HideOpacityAllCategory();                                                                                           // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.SetCount
	void SetCount(UJSI_Slot_C* Target, FFItemInfo& ItemInfo);                                                                // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.CreateBuybackContainer
	void CreateBuybackContainer();                                                                                           // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.HideAllCategory
	void HideAllCategory();                                                                                                  // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.HideCategory
	void HideCategory();                                                                                                     // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.ShowAllCategory
	void ShowAllCategory();                                                                                                  // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.ClearEntryListCategory
	void ClearEntryListCategory();                                                                                           // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.GetListEntryCategory
	void GetListEntryCategory(TArray<UW_ShopCategory_C*>& EntryList);                                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.ClearContainer
	void ClearContainer(UJSIContainer_C* Container);                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.Check Free Space To Add Item
	void Check Free Space To Add Item(bool& Return);                                                                         // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.Add Item
	FText Add Item(int32_t ToSlot, TWeakObjectPtr<UObject*> Image, FVector2D SlotVector, TEnumAsByte<SlotRarity> Rarity, FFItemInfo ItemInfo, FFItemInfo& Info, UJSI_Slot_C*& SlotItemRef, UJSIContainer_C*& Container, TEnumAsByte<InfoType>& InfoType, int32_t& AddedToSlot); // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.CalculateSellPrice
	void CalculateSellPrice(FFItemInfo ItemInfo, int32_t& Price);                                                            // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.CustomNavigation_InfoRight
	UWidget* CustomNavigation_InfoRight(EUINavigation Navigation);                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.ValidateItemInfoCount
	void ValidateItemInfoCount();                                                                                            // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.FinalizeInit
	void FinalizeInit();                                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.UpdateItemInfo
	void UpdateItemInfo();                                                                                                   // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.RebindSelectionDelegate
	void RebindSelectionDelegate();                                                                                          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.EnableDismantleProgressBars
	void EnableDismantleProgressBars(bool Enable);                                                                           // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.UnbindInventoryUpdate
	void UnbindInventoryUpdate();                                                                                            // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.ChcekFreeSpace
	void ChcekFreeSpace(bool& Return);                                                                                       // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.GetSelectedSlot
	void GetSelectedSlot(UJSI_Slot_C*& SelectedSlot);                                                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.Init
	void Init();                                                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.SellRMBClick
	void SellRMBClick(UJSIContainer_C* Container, UJSI_Slot_C* slotRef, FKey Button);                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.SelectedSlotBuy
	void SelectedSlotBuy(UJSI_Slot_C* Slot Ref);                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.SelectedSlotBuyBack
	void SelectedSlotBuyBack(UJSI_Slot_C* Slot Ref);                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.ButtonSelected
	void ButtonSelected(UW_ShopCategory_C* ShopCategoryRef);                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.BuyRightMouseButtonDown
	void BuyRightMouseButtonDown(UJSIContainer_C* Container, UJSI_Slot_C* slotRef, FKey Button);                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.BndEvt__WBP_InventoryToItem_JSIContainer_Shop_K2Node_ComponentBoundEvent_2_OnContainerUpdate__DelegateSignature
	void BndEvt__WBP_InventoryToItem_JSIContainer_Shop_K2Node_ComponentBoundEvent_2_OnContainerUpdate__DelegateSignature();  // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.OpenDialogue 
	void OpenDialogue (UJSI_Slot_C* Slot Ref);                                                                               // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.CloseDialogue 
	void CloseDialogue ();                                                                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.BndEvt__WBP_InventoryToItem_WBP_ShopDialogue_K2Node_ComponentBoundEvent_5_OnPressedAccept__DelegateSignature
	void BndEvt__WBP_InventoryToItem_WBP_ShopDialogue_K2Node_ComponentBoundEvent_5_OnPressedAccept__DelegateSignature(int32_t Count, UJSI_Slot_C* Ref slot); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.BndEvt__WBP_InventoryToItem_WBP_ShopDialogue_K2Node_ComponentBoundEvent_6_OnPressedDecline__DelegateSignature
	void BndEvt__WBP_InventoryToItem_WBP_ShopDialogue_K2Node_ComponentBoundEvent_6_OnPressedDecline__DelegateSignature();    // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.BndEvt__WBP_InventoryToItem_WBP_WorkbenchCraftInfo_K2Node_ComponentBoundEvent_1_OnParentNavigation__DelegateSignature
	void BndEvt__WBP_InventoryToItem_WBP_WorkbenchCraftInfo_K2Node_ComponentBoundEvent_1_OnParentNavigation__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.SelectedSlotSell
	void SelectedSlotSell(UJSI_Slot_C* Target);                                                                              // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.ChangeSelectedSlot
	void ChangeSelectedSlot(UJSI_Slot_C* SlotWidgetRef);                                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.OnDownKeyConfirm
	void OnDownKeyConfirm();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.OnKeyDownAccept
	void OnKeyDownAccept(int32_t Count, UJSI_Slot_C* Ref);                                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.InventoryUpdate
	void InventoryUpdate();                                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.ExecuteUbergraph_WBP_InventoryToItem
	void ExecuteUbergraph_WBP_InventoryToItem(int32_t EntryPoint);                                                           // [0x2407bf0] Final|HasDefaults    
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.OnUpdateContainerBuyback__DelegateSignature
	void OnUpdateContainerBuyback__DelegateSignature();                                                                      // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.OnBuyBackProcessFinished__DelegateSignature
	void OnBuyBackProcessFinished__DelegateSignature(FFItemInfo FItem, UJSI_Slot_C* Slot Ref, int32_t Count);                // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.OnBuyProcessFinished__DelegateSignature
	void OnBuyProcessFinished__DelegateSignature(FFItemInfo FItem, UJSI_Slot_C* Slot Ref);                                   // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.OnSellProcessStarted__DelegateSignature
	void OnSellProcessStarted__DelegateSignature(FFItemInfo FItem);                                                          // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.OnProcessStarted__DelegateSignature
	void OnProcessStarted__DelegateSignature(FFItemInfo ItemInfo);                                                           // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.OnSelectedSlotRMBDown__DelegateSignature
	void OnSelectedSlotRMBDown__DelegateSignature(UJSI_Slot_C* SlotWidgetRef, int32_t Count);                                // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.OnCreateCountChanged__DelegateSignature
	void OnCreateCountChanged__DelegateSignature(int32_t Count);                                                             // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.InventoryUpdated__DelegateSignature
	void InventoryUpdated__DelegateSignature();                                                                              // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.EntrySelected__DelegateSignature
	void EntrySelected__DelegateSignature();                                                                                 // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/WBP_InventoryToItem.WBP_InventoryToItem_C.ProcessFinished__DelegateSignature
	void ProcessFinished__DelegateSignature(FFItemInfo ItemInfo, int32_t Count, UJSI_Slot_C* Ref);                           // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Inventory/InventoryInteraction/W_ShopCategoryContainer.W_ShopCategoryContainer_C
/// Size: 0x02D8 (0x000280 - 0x000558)
class UW_ShopCategoryContainer_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UJSIContainer_C*                                   JSIContainer_ShopCat;                                       // 0x0288   (0x0008)  
	UTextBlock*                                        TextShop_Category;                                          // 0x0290   (0x0008)  
	UW_LabelTextShop_C*                                W_LabelTextShop;                                            // 0x0298   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher;                                             // 0x02A0   (0x0008)  
	FText                                              ShopContainerCategory;                                      // 0x02A8   (0x0018)  
	FText                                              TitleContainer;                                             // 0x02C0   (0x0018)  
	FFItemInfo                                         ItemInfo;                                                   // 0x02D8   (0x0220)  
	TArray<FContainerPickupsInfo>                      PickupsInfo;                                                // 0x04F8   (0x0010)  
	TArray<TEnumAsByte>                                Info_Type;                                                  // 0x0508   (0x0010)  
	UDataTable*                                        AssortmentDataTable;                                        // 0x0518   (0x0008)  
	TArray<FName>                                      ItemsID;                                                    // 0x0520   (0x0010)  
	TArray<FContainerPickupsInfo>                      SortPickupsInfo;                                            // 0x0530   (0x0010)  
	int32_t                                            New_Columns;                                                // 0x0540   (0x0004)  
	int32_t                                            New_Rows;                                                   // 0x0544   (0x0004)  
	TArray<FContainerPickupsInfo>                      CurPickupsInfo;                                             // 0x0548   (0x0010)  


	/// Functions
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategoryContainer.W_ShopCategoryContainer_C.Re-Init
	void Re-Init();                                                                                                          // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategoryContainer.W_ShopCategoryContainer_C.Re-sort
	void Re-sort();                                                                                                          // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategoryContainer.W_ShopCategoryContainer_C.AddItems
	void AddItems(UJSIContainer_C* Container, int32_t ToSlot, TWeakObjectPtr<UObject*> Image, FVector2D SlotVector, TEnumAsByte<SlotRarity> Rarity, FFItemInfo ItemInfo, FFItemInfo& Info, UJSI_Slot_C*& SlotItemRef, TEnumAsByte<InfoType>& InfoType, int32_t& AddedToSlot); // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategoryContainer.W_ShopCategoryContainer_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategoryContainer.W_ShopCategoryContainer_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategoryContainer.W_ShopCategoryContainer_C.ExecuteUbergraph_W_ShopCategoryContainer
	void ExecuteUbergraph_W_ShopCategoryContainer(int32_t EntryPoint);                                                       // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/UI/InGameShop/W_SelectedItemInfo.W_SelectedItemInfo_C
/// Size: 0x0098 (0x000280 - 0x000318)
class UW_SelectedItemInfo_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  SwitchItem_Anim;                                            // 0x0288   (0x0008)  
	UWidgetAnimation*                                  FadeAnim;                                                   // 0x0290   (0x0008)  
	UWidgetAnimation*                                  UnFadeContent_Anim;                                         // 0x0298   (0x0008)  
	UWidgetAnimation*                                  FadeContent_Anim;                                           // 0x02A0   (0x0008)  
	UWidgetAnimation*                                  SwitchItem_Anim;                                            // 0x02A8   (0x0008)  
	UCanvasPanel*                                      CanvasPanel_Root;                                           // 0x02B0   (0x0008)  
	UImage*                                            Image_Gradient;                                             // 0x02B8   (0x0008)  
	UImage*                                            Image_Item;                                                 // 0x02C0   (0x0008)  
	UImage*                                            Image_WeaponItem;                                           // 0x02C8   (0x0008)  
	USizeBox*                                          SizeBox;                                                    // 0x02D0   (0x0008)  
	USizeBox*                                          SizeBox_ItemName;                                           // 0x02D8   (0x0008)  
	UTextBlock*                                        TextBlock_Cost;                                             // 0x02E0   (0x0008)  
	UTextBlock*                                        TextBlock_Dim;                                              // 0x02E8   (0x0008)  
	UTextBlock*                                        TextBlock_ItemDescription;                                  // 0x02F0   (0x0008)  
	UTextBlock*                                        TextBlock_ItemName;                                         // 0x02F8   (0x0008)  
	UTextBlock*                                        TextBlock_Weight;                                           // 0x0300   (0x0008)  
	UVerticalBox*                                      VerticalBox_InfoItems;                                      // 0x0308   (0x0008)  
	double                                             Price;                                                      // 0x0310   (0x0008)  


	/// Functions
	// Function /Game/UI/InGameShop/W_SelectedItemInfo.W_SelectedItemInfo_C.isHidden
	bool isHidden();                                                                                                         // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/InGameShop/W_SelectedItemInfo.W_SelectedItemInfo_C.OnLoaded_9A6B6F934455094A7550DD8BAACECB9C
	void OnLoaded_9A6B6F934455094A7550DD8BAACECB9C(UObject* Loaded);                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_SelectedItemInfo.W_SelectedItemInfo_C.ShowInfo
	void ShowInfo();                                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_SelectedItemInfo.W_SelectedItemInfo_C.HideInfo
	void HideInfo();                                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_SelectedItemInfo.W_SelectedItemInfo_C.SetItemInfo
	void SetItemInfo(FFItemInfo ItemInfo, bool WithAnim, bool isBuyLayout?);                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_SelectedItemInfo.W_SelectedItemInfo_C.FadeInfo
	void FadeInfo();                                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_SelectedItemInfo.W_SelectedItemInfo_C.SwitchInfo
	void SwitchInfo();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_SelectedItemInfo.W_SelectedItemInfo_C.ExecuteUbergraph_W_SelectedItemInfo
	void ExecuteUbergraph_W_SelectedItemInfo(int32_t EntryPoint);                                                            // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C
/// Size: 0x03C8 (0x000280 - 0x000648)
class UW_BaseSlot_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  HoverAnim;                                                  // 0x0288   (0x0008)  
	UWidgetAnimation*                                  PurchaseAnim;                                               // 0x0290   (0x0008)  
	UButton*                                           Button_CounterMinus;                                        // 0x0298   (0x0008)  
	UButton*                                           Button_CounterPlus;                                         // 0x02A0   (0x0008)  
	UCanvasPanel*                                      CanvasPanel_IconContainer;                                  // 0x02A8   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_Price;                                        // 0x02B0   (0x0008)  
	UImage*                                            Image_BG;                                                   // 0x02B8   (0x0008)  
	UImage*                                            Image_ColorGradient;                                        // 0x02C0   (0x0008)  
	UImage*                                            Image_EquipmentMark;                                        // 0x02C8   (0x0008)  
	UImage*                                            Image_Highlight;                                            // 0x02D0   (0x0008)  
	UImage*                                            Image_Hover;                                                // 0x02D8   (0x0008)  
	UImage*                                            Image_Hover2;                                               // 0x02E0   (0x0008)  
	UImage*                                            Image_ItemIcon;                                             // 0x02E8   (0x0008)  
	UImage*                                            Image_ItemIcon_Podlozhka;                                   // 0x02F0   (0x0008)  
	UImage*                                            Image_PriceBP;                                              // 0x02F8   (0x0008)  
	UImage*                                            Image_PriceIcon;                                            // 0x0300   (0x0008)  
	UOverlay*                                          Overlay_Price;                                              // 0x0308   (0x0008)  
	URetainerBox*                                      RetainerBox;                                                // 0x0310   (0x0008)  
	UScaleBox*                                         ScaleBox;                                                   // 0x0318   (0x0008)  
	USizeBox*                                          SizeBox_Counter;                                            // 0x0320   (0x0008)  
	USizeBox*                                          SizeBox_Notenoughmoney;                                     // 0x0328   (0x0008)  
	USizeBox*                                          SizeBox_SlotSize;                                           // 0x0330   (0x0008)  
	UTextBlock*                                        TextBlock_Count;                                            // 0x0338   (0x0008)  
	UTextBlock*                                        TextBlock_ItemName;                                         // 0x0340   (0x0008)  
	UTextBlock*                                        TextBlock_Price;                                            // 0x0348   (0x0008)  
	UTextBlock*                                        TextBlock_ValueCounter;                                     // 0x0350   (0x0008)  
	FContainerPickupsInfo                              pickupInfo;                                                 // 0x0358   (0x0068)  
	FFItemInfo                                         ItemInfo;                                                   // 0x03C0   (0x0220)  
	int32_t                                            SlotIndex;                                                  // 0x05E0   (0x0004)  
	TEnumAsByte<E_SlotStatus>                          Status;                                                     // 0x05E4   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x05E5   (0x0003)  MISSED
	FF_SlotSettings                                    SlotSettings;                                               // 0x05E8   (0x0020)  
	UW_BaseContainer_C*                                ParentContainer;                                            // 0x0608   (0x0008)  
	int32_t                                            OccupantIndex;                                              // 0x0610   (0x0004)  
	bool                                               starttick;                                                  // 0x0614   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0615   (0x0003)  MISSED
	FVector2D                                          DragOffset;                                                 // 0x0618   (0x0010)  
	bool                                               bIsSelected;                                                // 0x0628   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0629   (0x0007)  MISSED
	double                                             Price;                                                      // 0x0630   (0x0008)  
	bool                                               isBuyLayout_;                                               // 0x0638   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0639   (0x0003)  MISSED
	int32_t                                            CurrentValue;                                               // 0x063C   (0x0004)  
	double                                             MaxValue;                                                   // 0x0640   (0x0008)  


	/// Functions
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.Change Sell Status
	void Change Sell Status(TEnumAsByte<E_SlotStatus> Status);                                                               // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.SetSellPrice
	void SetSellPrice();                                                                                                     // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.UpdateItemName
	void UpdateItemName();                                                                                                   // [0x2407bf0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.SetDefaultSlotImages
	void SetDefaultSlotImages();                                                                                             // [0x2407bf0] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetSlotSize
	void GetSlotSize(FVector2D& SlotSize);                                                                                   // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetEquipmentMark
	bool GetEquipmentMark();                                                                                                 // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.SetPrice
	void SetPrice();                                                                                                         // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.SetEquipmentMark
	void SetEquipmentMark(bool IsVisible);                                                                                   // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.SetCollisionEnabled
	void SetCollisionEnabled(bool In Is Enabled);                                                                            // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.UpdateItemCounter
	void UpdateItemCounter(int32_t Value);                                                                                   // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.Canstack
	void Canstack(bool& Canstack);                                                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.SwapVector
	FVector2D SwapVector(FVector2D Vector);                                                                                  // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.Get Pivot Index
	void Get Pivot Index(FVector2D DragOffset, int32_t& Index);                                                              // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.ChangeStatus
	void ChangeStatus(TEnumAsByte<E_SlotStatus> Status);                                                                     // [0x2407bf0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetDefaultSlotBrushes
	void GetDefaultSlotBrushes(FSlateBrush& BG_Brush, FSlateBrush& Gradient_Brush, FSlateBrush& Highlight_Brush, FSlateBrush& Hover_Brush, FSlateBrush& Item_Brush); // [0x2407bf0] Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.OnMouseButtonDoubleClick
	FEventReply OnMouseButtonDoubleClick(FGeometry InMyGeometry, FPointerEvent& InMouseEvent);                               // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.ChangeCount
	void ChangeCount(int32_t NewCount);                                                                                      // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.Update Pickup Info
	void Update Pickup Info();                                                                                               // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetItemWeight
	void GetItemWeight(double& Weight);                                                                                      // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetStatus
	void GetStatus(TEnumAsByte<E_SlotStatus>& Status);                                                                       // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetOcupantIndex
	void GetOcupantIndex(int32_t& OcupantIndex);                                                                             // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetSlotIndex
	void GetSlotIndex(int32_t& SlotIndex);                                                                                   // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetItemPrice
	void GetItemPrice(double& Price);                                                                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.HasItem
	void HasItem(bool& Has);                                                                                                 // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetParentContainer
	void GetParentContainer(UW_BaseContainer_C*& ParentContainer);                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetItemSlotDimension
	void GetItemSlotDimension(int32_t& X, int32_t& Y);                                                                       // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetItemBrush
	void GetItemBrush(FSlateBrush& SlateBrush);                                                                              // [0x2407bf0] Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.OnDrop
	bool OnDrop(FGeometry MyGeometry, FPointerEvent PointerEvent, UDragDropOperation* Operation);                            // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.OnDragDetected
	void OnDragDetected(FGeometry MyGeometry, FPointerEvent& PointerEvent, UDragDropOperation*& Operation);                  // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetSlotBrushes
	void GetSlotBrushes(FSlateBrush& Hover2_Brush, FSlateBrush& Hover_Brush, FSlateBrush& BG_Brush, FSlateBrush& Gradient_Brush, FSlateBrush& Highlight_Brush, FSlateBrush& Item_Brush); // [0x2407bf0] Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetNumberOfSlotsUsed
	void GetNumberOfSlotsUsed(int32_t& Number);                                                                              // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.OccupySlot
	void OccupySlot(int32_t OccupantIndex);                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.AddCount
	void AddCount(int32_t AddCount);                                                                                         // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetCount
	void GetCount(int32_t& MaxStack, int32_t& Count);                                                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetItemId
	void GetItemId(int32_t& ItemId);                                                                                         // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.GetPickupInfo
	void GetPickupInfo(FContainerPickupsInfo& pickupInfo);                                                                   // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.isRotated?
	void isRotated?(bool& Result);                                                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.IsEmpty?
	void IsEmpty?(bool& bIsEmpty);                                                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.OnMouseButtonDown
	FEventReply OnMouseButtonDown(FGeometry MyGeometry, FPointerEvent& MouseEvent);                                          // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.ClearSlot
	void ClearSlot();                                                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.OnDragCancelled
	void OnDragCancelled(FPointerEvent& PointerEvent, UDragDropOperation* Operation);                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.OnDragEnter
	void OnDragEnter(FGeometry MyGeometry, FPointerEvent PointerEvent, UDragDropOperation* Operation);                       // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.OnDragLeave
	void OnDragLeave(FPointerEvent PointerEvent, UDragDropOperation* Operation);                                             // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.OnMouseEnter
	void OnMouseEnter(FGeometry MyGeometry, FPointerEvent& MouseEvent);                                                      // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.OnMouseLeave
	void OnMouseLeave(FPointerEvent& MouseEvent);                                                                            // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.UpdateIcon
	void UpdateIcon();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.SelectSlot
	void SelectSlot();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.ClearSelection
	void ClearSelection();                                                                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.AddItem
	void AddItem(FContainerPickupsInfo pickupInfo);                                                                          // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.UpdateDragMove
	void UpdateDragMove(UDragDropOperation* DragDropOperation);                                                              // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.Unhover
	void Unhover();                                                                                                          // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.BndEvt__W_BaseSlot_Button_CounterMinus_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
	void BndEvt__W_BaseSlot_Button_CounterMinus_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();      // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.BndEvt__W_BaseSlot_Button_CounterPlus_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature
	void BndEvt__W_BaseSlot_Button_CounterPlus_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();       // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSlot.W_BaseSlot_C.ExecuteUbergraph_W_BaseSlot
	void ExecuteUbergraph_W_BaseSlot(int32_t EntryPoint);                                                                    // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/UI/ContainerSystem/W_ShopSlot.W_ShopSlot_C
/// Size: 0x0008 (0x000648 - 0x000650)
class UW_ShopSlot_C : public UW_BaseSlot_C : UW_BaseSlot_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0648   (0x0008)  


	/// Functions
	// Function /Game/UI/ContainerSystem/W_ShopSlot.W_ShopSlot_C.CheckIfMoneyEnogh
	void CheckIfMoneyEnogh(int32_t MoneyCount);                                                                              // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_ShopSlot.W_ShopSlot_C.UpdateItemName
	void UpdateItemName();                                                                                                   // [0x2407bf0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_ShopSlot.W_ShopSlot_C.GetSlotSize
	void GetSlotSize(FVector2D& SlotSize);                                                                                   // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_ShopSlot.W_ShopSlot_C.SetEquipmentMark
	void SetEquipmentMark(bool IsVisible);                                                                                   // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_ShopSlot.W_ShopSlot_C.GetDefaultSlotBrushes
	void GetDefaultSlotBrushes(FSlateBrush& BG_Brush, FSlateBrush& Gradient_Brush, FSlateBrush& Highlight_Brush, FSlateBrush& Hover_Brush, FSlateBrush& Item_Brush); // [0x2407bf0] Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_ShopSlot.W_ShopSlot_C.GetSlotBrushes
	void GetSlotBrushes(FSlateBrush& Hover2_Brush, FSlateBrush& Hover_Brush, FSlateBrush& BG_Brush, FSlateBrush& Gradient_Brush, FSlateBrush& Highlight_Brush, FSlateBrush& Item_Brush); // [0x2407bf0] Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_ShopSlot.W_ShopSlot_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_ShopSlot.W_ShopSlot_C.ExecuteUbergraph_W_ShopSlot
	void ExecuteUbergraph_W_ShopSlot(int32_t EntryPoint);                                                                    // [0x2407bf0] Final                
};

/// Class /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C
/// Size: 0x0310 (0x000280 - 0x000590)
class UW_BaseItemInfo_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  ShowAnim;                                                   // 0x0288   (0x0008)  
	UW_EffectRowForItemInfo_C*                         DebugEffectRow01;                                           // 0x0290   (0x0008)  
	UW_EffectRowForItemInfo_C*                         DebugEffectRow02;                                           // 0x0298   (0x0008)  
	UW_EffectRowForItemInfo_C*                         DebugEffectRow03;                                           // 0x02A0   (0x0008)  
	UW_EffectRowForItemInfo_C*                         DebugEffectRow04;                                           // 0x02A8   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_AttachmentsPanel;                             // 0x02B0   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_Durability;                                   // 0x02B8   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_Type;                                         // 0x02C0   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_Weight;                                       // 0x02C8   (0x0008)  
	UImage*                                            Image;                                                      // 0x02D0   (0x0008)  
	UImage*                                            Image_EquipmentMark;                                        // 0x02D8   (0x0008)  
	UProgressBar*                                      ProgressBar_Durability;                                     // 0x02E0   (0x0008)  
	USizeBox*                                          SizeBox_Grid;                                               // 0x02E8   (0x0008)  
	USizeBox*                                          SizeBox_Root;                                               // 0x02F0   (0x0008)  
	UTextBlock*                                        TextBlock_Desc;                                             // 0x02F8   (0x0008)  
	UTextBlock*                                        TextBlock_Durability;                                       // 0x0300   (0x0008)  
	UTextBlock*                                        TextBlock_ItemName;                                         // 0x0308   (0x0008)  
	UTextBlock*                                        TextBlock_ItemType;                                         // 0x0310   (0x0008)  
	UTextBlock*                                        TextBlock_Price;                                            // 0x0318   (0x0008)  
	UTextBlock*                                        TextBlock_SlotDemention;                                    // 0x0320   (0x0008)  
	UTextBlock*                                        TextBlock_Weight;                                           // 0x0328   (0x0008)  
	UVerticalBox*                                      VerticalBox_Effects;                                        // 0x0330   (0x0008)  
	bool                                               isHidden;                                                   // 0x0338   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0339   (0x0007)  MISSED
	UJSI_Slot_C*                                       Item_Slot;                                                  // 0x0340   (0x0008)  
	FFItemInfo                                         Item_Info;                                                  // 0x0348   (0x0220)  
	FText                                              Text;                                                       // 0x0568   (0x0018)  
	bool                                               bIsTickAllowed;                                             // 0x0580   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0581   (0x0007)  MISSED
	UW_BaseSlot_C*                                     slotRef;                                                    // 0x0588   (0x0008)  


	/// Functions
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.SetEquipmentMark
	void SetEquipmentMark(bool IsVisible);                                                                                   // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.ResetImageAttachments
	void ResetImageAttachments();                                                                                            // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.FIndBaseStatsWepaon
	void FIndBaseStatsWepaon(FName Name, double& Power, double& Effective Range, double& Stability);                         // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.AddAttachmentEffects
	void AddAttachmentEffects(double Power, double EffectiveRange, double Stability, double FIring Rate, double PowerModdifu, double EffectiveRangeModdifu, double StabilityModdifu, double FIring RateModdifu); // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.AddItemEffects
	void AddItemEffects();                                                                                                   // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.CalculateIndex
	void CalculateIndex(int32_t& Index, int32_t& Row, int32_t& column);                                                      // [0x2407bf0] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.AddAttacmentsToGridPanel
	void AddAttacmentsToGridPanel(FPickupAttachments& PickupAttachments, FName WeaponName);                                  // [0x2407bf0] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.UpdateWidgetPosition
	void UpdateWidgetPosition(UWidget* Widget);                                                                              // [0x2407bf0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.HideItemDescription
	void HideItemDescription();                                                                                              // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.HideItemDiscriptionImmediately
	void HideItemDiscriptionImmediately();                                                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.ShowInfo
	void ShowInfo(UW_BaseSlot_C* ItemSlot, FText Text);                                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.SlotEvent_DragStarted_Binding
	void SlotEvent_DragStarted_Binding(UW_BaseSlot_C* slotRef, UW_BaseDragWidget_C* DragWidget);                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseItemInfo.W_BaseItemInfo_C.ExecuteUbergraph_W_BaseItemInfo
	void ExecuteUbergraph_W_BaseItemInfo(int32_t EntryPoint);                                                                // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/UI/ContainerSystem/W_BaseDragWidget.W_BaseDragWidget_C
/// Size: 0x0368 (0x000280 - 0x0005E8)
class UW_BaseDragWidget_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UCanvasPanel*                                      CanvasPanel_ImageCanvas;                                    // 0x0288   (0x0008)  
	UCanvasPanel*                                      CanvasPanel_Root;                                           // 0x0290   (0x0008)  
	UImage*                                            Image_BG;                                                   // 0x0298   (0x0008)  
	UImage*                                            Image_ColorGradient;                                        // 0x02A0   (0x0008)  
	UImage*                                            Image_ItemIcon;                                             // 0x02A8   (0x0008)  
	UTextBlock*                                        TextBlock_Count;                                            // 0x02B0   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02B8   (0x0008)  MISSED
	FSlateBrush                                        Item_Brush;                                                 // 0x02C0   (0x00D0)  
	int32_t                                            Count;                                                      // 0x0390   (0x0004)  
	bool                                               bIsRotated;                                                 // 0x0394   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0395   (0x0003)  MISSED
	FFItemInfo                                         ItemInfo;                                                   // 0x0398   (0x0220)  
	bool                                               isKeyDown;                                                  // 0x05B8   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x05B9   (0x0007)  MISSED
	UDragDropOperation*                                DragDropOpenrationRef;                                      // 0x05C0   (0x0008)  
	bool                                               InitRotation;                                               // 0x05C8   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x05C9   (0x0007)  MISSED
	FVector2D                                          MoveOffset;                                                 // 0x05D0   (0x0010)  
	UW_BaseSlot_C*                                     slotRef;                                                    // 0x05E0   (0x0008)  


	/// Functions
	// Function /Game/UI/ContainerSystem/W_BaseDragWidget.W_BaseDragWidget_C.GetRotationOffset
	void GetRotationOffset(FVector2D MoveOffset, FVector2D& RotationOffset);                                                 // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseDragWidget.W_BaseDragWidget_C.GetPivotIndex
	void GetPivotIndex(FVector2D MoveOffset, int32_t& Index);                                                                // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseDragWidget.W_BaseDragWidget_C.GetMoveOffset
	FVector2D GetMoveOffset();                                                                                               // [0x2407bf0] Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseDragWidget.W_BaseDragWidget_C.GetSlotBrushes
	void GetSlotBrushes(FSlateBrush& BG_Brush, FSlateBrush& Gradient_Brush);                                                 // [0x2407bf0] Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseDragWidget.W_BaseDragWidget_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseDragWidget.W_BaseDragWidget_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseDragWidget.W_BaseDragWidget_C.RotateItem
	void RotateItem();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseDragWidget.W_BaseDragWidget_C.ExecuteUbergraph_W_BaseDragWidget
	void ExecuteUbergraph_W_BaseDragWidget(int32_t EntryPoint);                                                              // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C
/// Size: 0x0210 (0x000280 - 0x000490)
class UW_BaseContainer_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UUniformGridPanel*                                 Grid_Content;                                               // 0x0288   (0x0008)  
	UImage*                                            Image_Highlighter;                                          // 0x0290   (0x0008)  
	TEnumAsByte<E_BaseContainerType>                   ContainerType;                                              // 0x0298   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0299   (0x0003)  MISSED
	int32_t                                            NumberOfRows;                                               // 0x029C   (0x0004)  
	int32_t                                            NumberOfColumns;                                            // 0x02A0   (0x0004)  
	TEnumAsByte<E_DragAndDropAvailability>             DragAndDrop;                                                // 0x02A4   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x02A5   (0x0003)  MISSED
	TMap<int32_t, UW_BaseSlot_C*>                      SlotsWithItems;                                             // 0x02A8   (0x0050)  
	FF_SlotSettings                                    SlotSettings;                                               // 0x02F8   (0x0020)  
	FMulticastInlineDelegate                           SlotEvent_StatusChanged;                                    // 0x0318   (0x0010)  
	FMulticastInlineDelegate                           SlotEvent_DragEnter;                                        // 0x0328   (0x0010)  
	FMulticastInlineDelegate                           SlotEvent_DragLeave;                                        // 0x0338   (0x0010)  
	FMulticastInlineDelegate                           SlotEvent_DragStarted;                                      // 0x0348   (0x0010)  
	FMulticastInlineDelegate                           SlotEvent_DragCanceled;                                     // 0x0358   (0x0010)  
	FMulticastInlineDelegate                           SlotEvent_Drop;                                             // 0x0368   (0x0010)  
	FMulticastInlineDelegate                           SlotEvent_MouseButtonPressed;                               // 0x0378   (0x0010)  
	UUserWidget*                                       ParentWidget;                                               // 0x0388   (0x0008)  
	FMulticastInlineDelegate                           SlotEvent_MouseButtonDoubleClicked;                         // 0x0390   (0x0010)  
	FMulticastInlineDelegate                           SlotEvent_Hover;                                            // 0x03A0   (0x0010)  
	FMulticastInlineDelegate                           SlotEvent_Unhover;                                          // 0x03B0   (0x0010)  
	FMulticastInlineDelegate                           ContainerEvent_ItemIndexChanged;                            // 0x03C0   (0x0010)  
	UW_BaseSplitWidget_C*                              ActiveSplitWidget;                                          // 0x03D0   (0x0008)  
	FMulticastInlineDelegate                           ContainerEvent_SplitItemBetweenSlots;                       // 0x03D8   (0x0010)  
	FContainerPickupsInfo                              DataOfHostedItem;                                           // 0x03E8   (0x0068)  
	bool                                               bNeedToCreateSplitWidget;                                   // 0x0450   (0x0001)  
	bool                                               bIsContainerHost;                                           // 0x0451   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x0452   (0x0006)  MISSED
	UW_BaseDragWidget_C*                               ActiveDragWidget;                                           // 0x0458   (0x0008)  
	bool                                               bIsHostRotationChanged;                                     // 0x0460   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x0461   (0x0007)  MISSED
	FMulticastInlineDelegate                           SlotEvent_Stack;                                            // 0x0468   (0x0010)  
	TArray<int32_t>                                    PricelessList;                                              // 0x0478   (0x0010)  
	UClass*                                            SlotClass;                                                  // 0x0488   (0x0008)  


	/// Functions
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetFirstValidItem
	void GetFirstValidItem(int32_t& Index);                                                                                  // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.IsItemPriceless
	bool IsItemPriceless(int32_t& ItemId);                                                                                   // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetIndexOfHostedItem
	void GetIndexOfHostedItem(int32_t& SlotIndex);                                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetSlotByIndex
	void GetSlotByIndex(int32_t SlotIndex, UW_BaseSlot_C*& Value);                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetNumItems
	int32_t GetNumItems();                                                                                                   // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SetHighlighterBrush
	void SetHighlighterBrush(FVector2D Dim, bool IsRotated, bool candrop, UPaperSprite*& BG_Sprite1);                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.RecalculateHighlighterSize
	void RecalculateHighlighterSize(double SingleSlotSizeX, double SingleSlotSizeY, FVector2D Dimention, double DistanceBetweenSlots, FVector2D& Size); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.CalculateHighlighterDim
	void CalculateHighlighterDim(TArray<UW_BaseSlot_C*>& Slots, FVector2D& Dimention);                                       // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SetCollisionEnabled
	void SetCollisionEnabled(bool In Is Enabled);                                                                            // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.OnDrop
	bool OnDrop(FGeometry MyGeometry, FPointerEvent PointerEvent, UDragDropOperation* Operation);                            // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.CalculateHighlighterPosition
	FVector2D CalculateHighlighterPosition(TArray<UW_BaseSlot_C*>& HighlightedSlots);                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.MoveHighlighter
	void MoveHighlighter(UW_BaseSlot_C* slotRef, TArray<UW_BaseSlot_C*>& HighlightedSlots, bool candrop, bool Rotated);      // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.CalculateHighlighterSize
	void CalculateHighlighterSize(FVector2D SlotDim, bool IsRotated, FVector2D& HighlighterSize);                            // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.HighlightSlots
	void HighlightSlots(int32_t SlotIndex, FVector2D SlotDim, bool IsRotated, UW_BaseSlot_C* slotRef);                       // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetSlotByName
	void GetSlotByName(FName ItemName, UW_BaseSlot_C*& SlotWidget);                                                          // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetSlotSettings
	void GetSlotSettings(FF_SlotSettings& SlotSettings);                                                                     // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SelfTestForSlots
	bool SelfTestForSlots(UW_BaseContainer_C* SenderContainer, UW_BaseSlot_C* RecipientSlot);                                // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.Slot Event Stack Binding
	void Slot Event Stack Binding(FFItemInfo SenderItemInfo, UW_BaseSlot_C* RecipientSlot);                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.Can Stack On Slot
	void Can Stack On Slot(FFItemInfo SenderItemInfo, UW_BaseSlot_C* RecipientSlot, int32_t ItemSizeX, int32_t ItemSizeY, bool IsRotated, bool& Canstack, TArray<UW_BaseSlot_C*>& TargetSlotsArray); // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SetHostRotationChanged
	void SetHostRotationChanged(bool bIsHostRotationChanged);                                                                // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.IsHostRotationChanged
	void IsHostRotationChanged(bool& bIsHostRotationChanged);                                                                // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.IsContainerHost?
	void IsContainerHost?(bool& Result);                                                                                     // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.OnKeyUp
	FEventReply OnKeyUp(FGeometry MyGeometry, FKeyEvent InKeyEvent);                                                         // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.OnKeyDown
	FEventReply OnKeyDown(FGeometry MyGeometry, FKeyEvent InKeyEvent);                                                       // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.IsHostedItemRotate?
	void IsHostedItemRotate?(bool& Rotated);                                                                                 // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SetHostedItemRotate
	void SetHostedItemRotate(bool Rotated);                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.ChangeCountOfHostedItem
	void ChangeCountOfHostedItem(int32_t NewCount);                                                                          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetCountOfHostedItem
	void GetCountOfHostedItem(int32_t& Count);                                                                               // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetSizeOfHostedItem
	void GetSizeOfHostedItem(int32_t& X, int32_t& Y);                                                                        // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.NeedSplitEventForHostingItem?
	void NeedSplitEventForHostingItem?(bool& res);                                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.ReturnHostedDataToSlot
	void ReturnHostedDataToSlot();                                                                                           // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.Get Drop Offset
	void Get Drop Offset(int32_t PivotIndex, int32_t X_SlotSize, int32_t Y_SlotSize, int32_t& X_Offset, int32_t& Y_Offset);  // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.Get Recipient Slot with Offset
	void Get Recipient Slot with Offset(int32_t X SenderSlotSize, int32_t Y SenderSlotSize, bool IsRotated, int32_t RealRecipientSlotIndex, int32_t DropPivotIndex, bool& Result, UW_BaseSlot_C*& RecipientSlot); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetDataOfHostedItem
	void GetDataOfHostedItem(FContainerPickupsInfo& DataOfHostedItem);                                                       // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.AddSplitedItemToSlot
	void AddSplitedItemToSlot(int32_t SplitCount, UW_BaseSlot_C* RecipientSlot);                                             // [0x2407bf0] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetContainerType
	void GetContainerType(TEnumAsByte<E_BaseContainerType>& ContainerType);                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.ChangeItemCount
	void ChangeItemCount(int32_t SlotIndex, int32_t NewCount);                                                               // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetItemsWeight
	void GetItemsWeight(double& Weight);                                                                                     // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.Get Capacity
	void Get Capacity(int32_t& Used, int32_t& MaxCapacity);                                                                  // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.Can Drop On Slot
	void Can Drop On Slot(UW_BaseContainer_C* SenderContainer, UW_BaseSlot_C* RecipientSlot, bool& Can);                     // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.MoveHostedItemToSlot
	void MoveHostedItemToSlot(UW_BaseSlot_C* RecipientSlot);                                                                 // [0x2407bf0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.AddItemBySlotIndex
	void AddItemBySlotIndex(int32_t Index, FContainerPickupsInfo Item);                                                      // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.FindAndCheckTargetLocation
	void FindAndCheckTargetLocation(UW_BaseSlot_C* RecipientSlot, int32_t ItemSizeX, int32_t ItemSizeY, bool IsRotated, bool& candrop, TArray<UW_BaseSlot_C*>& TargetSlotsArray); // [0x2407bf0] Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.CanDrag
	void CanDrag(UW_BaseSlot_C* Slot, bool& Can);                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.CanDragItem
	void CanDragItem(UW_BaseSlot_C* Slot);                                                                                   // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.FindEnvirons
	void FindEnvirons(int32_t ItemSizeX, int32_t ItemSizeY, int32_t BaseIndex, TArray<UW_BaseSlot_C*>& Slots);               // [0x2407bf0] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.Remove Item By Slot Index
	void Remove Item By Slot Index(int32_t Index);                                                                           // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.OccupySlotsForSizeOfItem
	void OccupySlotsForSizeOfItem(int32_t ItemSlotSizeX, int32_t ItemSlotSizeY, int32_t ItemSlotIndex);                      // [0x2407bf0] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.ClearContainer
	void ClearContainer();                                                                                                   // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.AddItemSomewhere
	void AddItemSomewhere(FContainerPickupsInfo Item);                                                                       // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetSlotByItemId
	void GetSlotByItemId(int32_t ItemId, UW_BaseSlot_C*& Slot Ref, bool& SlotFound?);                                        // [0x2407bf0] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetItemRef
	void GetItemRef();                                                                                                       // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetIndexBySlotLocation
	void GetIndexBySlotLocation(int32_t ColumnIndex , int32_t RowIndex , int32_t& SlotIndex, bool& Result);                  // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetSlotLocationByIndex
	void GetSlotLocationByIndex(int32_t SlotIndex, int32_t& ColumnIndex , int32_t& RowIndex );                               // [0x2407bf0] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.GetEmptySlot
	void GetEmptySlot(FContainerPickupsInfo& Item, bool& EmptySlotFound?, UW_BaseSlot_C*& slotRef);                          // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.CanAddItem
	void CanAddItem(FContainerPickupsInfo Item, bool& Can, bool& ToStack);                                                   // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.CreateGrid
	void CreateGrid();                                                                                                       // [0x2407bf0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.OnInitialized
	void OnInitialized();                                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SetCapacity
	void SetCapacity(int32_t Length);                                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.Destruct
	void Destruct();                                                                                                         // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.ClearHostedData
	void ClearHostedData();                                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.AddHostedData
	void AddHostedData(UW_BaseSlot_C* Slot, bool RemoveHostFromContainer);                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.OnDragLeave
	void OnDragLeave(FPointerEvent PointerEvent, UDragDropOperation* Operation);                                             // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.OnDragCancelled
	void OnDragCancelled(FPointerEvent& PointerEvent, UDragDropOperation* Operation);                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.BindSplitWidgetEvents
	void BindSplitWidgetEvents(UW_BaseSplitWidget_C* SplitWidget);                                                           // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_DragCanceled_Binding
	void SlotEvent_DragCanceled_Binding(UW_BaseSlot_C* slotRef);                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_DragStarted_Binding
	void SlotEvent_DragStarted_Binding(UW_BaseSlot_C* slotRef, UW_BaseDragWidget_C* DragWidget);                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SplitWidgetEvent_OnAcceptFull_Binding
	void SplitWidgetEvent_OnAcceptFull_Binding(UW_BaseSlot_C* RecipientSlot, UW_BaseContainer_C* SenderContainer);           // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SplitWidgetEvent_OnCancel_Binding
	void SplitWidgetEvent_OnCancel_Binding(UW_BaseContainer_C* SenderContainer);                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SplitWidgetEvent_OnAccept_Binding
	void SplitWidgetEvent_OnAccept_Binding(int32_t Count, UW_BaseSlot_C* RecipientSlot, UW_BaseContainer_C* SenderContainer); // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_Drop_Binding
	void SlotEvent_Drop_Binding(UW_BaseContainer_C* SenderContainer, UW_BaseSlot_C* RecipientSlot);                          // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.UnbindSlplitWidgetEvents
	void UnbindSlplitWidgetEvents();                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.ExecuteUbergraph_W_BaseContainer
	void ExecuteUbergraph_W_BaseContainer(int32_t EntryPoint);                                                               // [0x2407bf0] Final|HasDefaults    
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_Stack__DelegateSignature
	void SlotEvent_Stack__DelegateSignature(FFItemInfo SenderItemInfo, UW_BaseSlot_C* RecipientSlot);                        // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_StatusChanged__DelegateSignature
	void SlotEvent_StatusChanged__DelegateSignature(UW_BaseSlot_C* Slot, TEnumAsByte<E_SlotStatus> Status);                  // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_MouseButtonDoubleClicked__DelegateSignature
	void SlotEvent_MouseButtonDoubleClicked__DelegateSignature(UW_BaseSlot_C* Slot, FPointerEvent PointerEvent);             // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.ContainerEvent_SplitItemBetweenSlots__DelegateSignature
	void ContainerEvent_SplitItemBetweenSlots__DelegateSignature(TEnumAsByte<E_BaseContainerType> ContainerType, int32_t SenderSlotIndex, int32_t RecipientSlotIndex, int32_t SplitCount); // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.ContainerEvent_ItemIndexChanged__DelegateSignature
	void ContainerEvent_ItemIndexChanged__DelegateSignature(TEnumAsByte<E_BaseContainerType> ContainerType, int32_t OldIndex, int32_t NewIndex); // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_Unhover__DelegateSignature
	void SlotEvent_Unhover__DelegateSignature(UW_BaseSlot_C* Slot);                                                          // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_Hover__DelegateSignature
	void SlotEvent_Hover__DelegateSignature(UW_BaseSlot_C* Slot);                                                            // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_MouseButtonPressed__DelegateSignature
	void SlotEvent_MouseButtonPressed__DelegateSignature(UW_BaseSlot_C* Slot, FPointerEvent PointerEvent);                   // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_Drop__DelegateSignature
	void SlotEvent_Drop__DelegateSignature(UW_BaseContainer_C* SenderContainer, UW_BaseSlot_C* RecipientSlot);               // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_DragStarted__DelegateSignature
	void SlotEvent_DragStarted__DelegateSignature(UW_BaseSlot_C* slotRef, UW_BaseDragWidget_C* DragWidget);                  // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_DragCanceled__DelegateSignature
	void SlotEvent_DragCanceled__DelegateSignature(UW_BaseSlot_C* slotRef);                                                  // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_DragLeave__DelegateSignature
	void SlotEvent_DragLeave__DelegateSignature(UW_BaseSlot_C* slotRef);                                                     // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseContainer.W_BaseContainer_C.SlotEvent_DragEnter__DelegateSignature
	void SlotEvent_DragEnter__DelegateSignature(UW_BaseSlot_C* slotRef);                                                     // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/ContainerSystem/W_ShopContainer.W_ShopContainer_C
/// Size: 0x0008 (0x000490 - 0x000498)
class UW_ShopContainer_C : public UW_BaseContainer_C : UW_BaseContainer_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0490   (0x0008)  


	/// Functions
	// Function /Game/UI/ContainerSystem/W_ShopContainer.W_ShopContainer_C.BindMoneyCheck
	void BindMoneyCheck();                                                                                                   // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_ShopContainer.W_ShopContainer_C.CheckIfMoneyEnough
	void CheckIfMoneyEnough(int32_t MoneyCount);                                                                             // [0x2407bf0] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_ShopContainer.W_ShopContainer_C.Remove Item By Slot Index
	void Remove Item By Slot Index(int32_t Index);                                                                           // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_ShopContainer.W_ShopContainer_C.GetSizeOfHostedItem
	void GetSizeOfHostedItem(int32_t& X, int32_t& Y);                                                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_ShopContainer.W_ShopContainer_C.AddItemBySlotIndex
	void AddItemBySlotIndex(int32_t Index, FContainerPickupsInfo Item);                                                      // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_ShopContainer.W_ShopContainer_C.AddItemSomewhere
	void AddItemSomewhere(FContainerPickupsInfo Item);                                                                       // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_ShopContainer.W_ShopContainer_C.GetEmptySlot
	void GetEmptySlot(FContainerPickupsInfo& Item, bool& EmptySlotFound?, UW_BaseSlot_C*& slotRef);                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_ShopContainer.W_ShopContainer_C.SetCapacity
	void SetCapacity(int32_t Length);                                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_ShopContainer.W_ShopContainer_C.ExecuteUbergraph_W_ShopContainer
	void ExecuteUbergraph_W_ShopContainer(int32_t EntryPoint);                                                               // [0x2407bf0] Final                
};

/// Class /Game/UI/Inventory/InventoryInteraction/W_ShopCategory.W_ShopCategory_C
/// Size: 0x02E0 (0x000280 - 0x000560)
class UW_ShopCategory_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Blick;                                                      // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Hover;                                                      // 0x0290   (0x0008)  
	UButton*                                           Button_ItemCategory;                                        // 0x0298   (0x0008)  
	UImage*                                            Image_BG;                                                   // 0x02A0   (0x0008)  
	UImage*                                            Image_Hovered;                                              // 0x02A8   (0x0008)  
	UImage*                                            Image_Icon;                                                 // 0x02B0   (0x0008)  
	UImage*                                            Image_Selected;                                             // 0x02B8   (0x0008)  
	UTextBlock*                                        Text_Category;                                              // 0x02C0   (0x0008)  
	FFItemInfo                                         FItem;                                                      // 0x02C8   (0x0220)  
	FS_CategoryData                                    Category_Data;                                              // 0x04E8   (0x0048)  
	FMulticastInlineDelegate                           OnButtonSelected;                                           // 0x0530   (0x0010)  
	TEnumAsByte<InfoType>                              Info_Type;                                                  // 0x0540   (0x0001)  
	bool                                               All_Category;                                               // 0x0541   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0542   (0x0006)  MISSED
	FString                                            CategoryAll;                                                // 0x0548   (0x0010)  
	FName                                              Category_Name;                                              // 0x0558   (0x0008)  


	/// Functions
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategory.W_ShopCategory_C.InitCategory
	void InitCategory(FName Category Name, FText& CategoryDisplayName, UPaperSprite*& CategoryIcon);                         // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategory.W_ShopCategory_C.Init
	void Init(FFItemInfo FItem, TEnumAsByte<InfoType> InfoType, FName Category Name);                                        // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategory.W_ShopCategory_C.SetSelected
	void SetSelected(bool Selected);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategory.W_ShopCategory_C.ButtonHover
	void ButtonHover(bool Hovered, bool WithAnim);                                                                           // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategory.W_ShopCategory_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategory.W_ShopCategory_C.BndEvt__W_ShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
	void BndEvt__W_ShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();    // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategory.W_ShopCategory_C.BndEvt__W_ShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__W_ShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();    // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategory.W_ShopCategory_C.BndEvt__W_ShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature
	void BndEvt__W_ShopCategory_Button_ItemCategory_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();  // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategory.W_ShopCategory_C.ExecuteUbergraph_W_ShopCategory
	void ExecuteUbergraph_W_ShopCategory(int32_t EntryPoint);                                                                // [0x2407bf0] Final                
	// Function /Game/UI/Inventory/InventoryInteraction/W_ShopCategory.W_ShopCategory_C.OnButtonSelected__DelegateSignature
	void OnButtonSelected__DelegateSignature(UW_ShopCategory_C* NewParam);                                                   // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C
/// Size: 0x0490 (0x000280 - 0x000710)
class UW_BaseSplitWidget_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UButton*                                           Button_Minus;                                               // 0x0288   (0x0008)  
	UButton*                                           Button_Minus;                                               // 0x0290   (0x0008)  
	UButton*                                           Button_Plus;                                                // 0x0298   (0x0008)  
	UButton*                                           Button_Plus;                                                // 0x02A0   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_Components;                                   // 0x02A8   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_Money;                                        // 0x02B0   (0x0008)  
	UImage*                                            Image;                                                      // 0x02B8   (0x0008)  
	UImage*                                            Image;                                                      // 0x02C0   (0x0008)  
	UImage*                                            Image_BG1;                                                  // 0x02C8   (0x0008)  
	UImage*                                            Image_BorderOfNumber;                                       // 0x02D0   (0x0008)  
	UImage*                                            Image_Item;                                                 // 0x02D8   (0x0008)  
	UImage*                                            Image_Money;                                                // 0x02E0   (0x0008)  
	UImage*                                            Image_Separator;                                            // 0x02E8   (0x0008)  
	USlider*                                           Slider_Base;                                                // 0x02F0   (0x0008)  
	UTextBlock*                                        Text_CurrentCounter;                                        // 0x02F8   (0x0008)  
	UTextBlock*                                        Text_ItemDescription;                                       // 0x0300   (0x0008)  
	UTextBlock*                                        Text_ItemName;                                              // 0x0308   (0x0008)  
	UTextBlock*                                        Text_TotalPrice;                                            // 0x0310   (0x0008)  
	UTextBlock*                                        TextBlock_CurrentCount;                                     // 0x0318   (0x0008)  
	UTextBlock*                                        TextBlock_ItemName;                                         // 0x0320   (0x0008)  
	UTextBlock*                                        TextBlock_Money;                                            // 0x0328   (0x0008)  
	UTextBlock*                                        TextBlock_WhatToDo;                                         // 0x0330   (0x0008)  
	UTextBlock*                                        TextBlockWhattodo;                                          // 0x0338   (0x0008)  
	UW_BaseDialogueButton_C*                           W_BaseDialogButton_Accept;                                  // 0x0340   (0x0008)  
	UW_BaseDialogueButton_C*                           W_BaseDialogButton_Decline;                                 // 0x0348   (0x0008)  
	UW_BaseDialogueButton_C*                           W_BaseDialogueButton_Cancel;                                // 0x0350   (0x0008)  
	UW_BaseDialogueButton_C*                           W_BaseDialogueButton_Craft;                                 // 0x0358   (0x0008)  
	UW_HintButtonNew_C*                                W_HintButtonLess;                                           // 0x0360   (0x0008)  
	UW_HintButtonNew_C*                                W_HintButtonMax;                                            // 0x0368   (0x0008)  
	UW_HintButtonNew_C*                                W_HintButtonMore;                                           // 0x0370   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher;                                             // 0x0378   (0x0008)  
	double                                             MaxValue;                                                   // 0x0380   (0x0008)  
	FFItemInfo                                         Item;                                                       // 0x0388   (0x0220)  
	int32_t                                            CurrentValue;                                               // 0x05A8   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x05AC   (0x0004)  MISSED
	FMulticastInlineDelegate                           SplitWidget_OnCancel;                                       // 0x05B0   (0x0010)  
	FMulticastInlineDelegate                           SplitWidget_OnAcceptSplit;                                  // 0x05C0   (0x0010)  
	UW_BaseContainer_C*                                CachedSenderContainer;                                      // 0x05D0   (0x0008)  
	UW_BaseSlot_C*                                     CachedRecipientSlot;                                        // 0x05D8   (0x0008)  
	FMulticastInlineDelegate                           SplitWidget_OnAcceptFull;                                   // 0x05E0   (0x0010)  
	FText                                              TextForAcceptButton;                                        // 0x05F0   (0x0018)  
	FContainerPickupsInfo                              ItemData;                                                   // 0x0608   (0x0068)  
	FKey                                               AcceptKey;                                                  // 0x0670   (0x0018)  
	FKey                                               CancelKey;                                                  // 0x0688   (0x0018)  
	TMap<FString, TWeakObjectPtr>                      KeyMap;                                                     // 0x06A0   (0x0050)  
	FText                                              Text_Block_What;                                            // 0x06F0   (0x0018)  
	float                                              WSliderValue;                                               // 0x0708   (0x0004)  
	float                                              StepSlide;                                                  // 0x070C   (0x0004)  


	/// Functions
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.Get_Slider_Craft_Value
	float Get_Slider_Craft_Value();                                                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.GetSenderContainerType
	void GetSenderContainerType(TEnumAsByte<E_BaseContainerType>& ContainerType);                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.OnKeyDown
	FEventReply OnKeyDown(FGeometry MyGeometry, FKeyEvent InKeyEvent);                                                       // [0x2407bf0] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.OnLoaded_F0AAAC4E4253A377D49B7B843E39F351
	void OnLoaded_F0AAAC4E4253A377D49B7B843E39F351(UObject* Loaded);                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.CancelEvent
	void CancelEvent();                                                                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.AcceptEvent
	void AcceptEvent();                                                                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.OnCounterValueChanged
	void OnCounterValueChanged(double Value);                                                                                // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.AcceptFullEvent
	void AcceptFullEvent();                                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.BndEvt__W_BaseSplitWidget_W_BaseDialogButton_Accept_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature
	void BndEvt__W_BaseSplitWidget_W_BaseDialogButton_Accept_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature();    // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.BndEvt__W_BaseSplitWidget_W_BaseDialogButton_Decline_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature
	void BndEvt__W_BaseSplitWidget_W_BaseDialogButton_Decline_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature();   // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.BndEvt__W_BaseSplitWidget_Button_Minus_K2Node_ComponentBoundEvent_12_OnButtonPressedEvent__DelegateSignature
	void BndEvt__W_BaseSplitWidget_Button_Minus_K2Node_ComponentBoundEvent_12_OnButtonPressedEvent__DelegateSignature();     // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.BndEvt__W_BaseSplitWidget_Button_Plus_K2Node_ComponentBoundEvent_13_OnButtonPressedEvent__DelegateSignature
	void BndEvt__W_BaseSplitWidget_Button_Plus_K2Node_ComponentBoundEvent_13_OnButtonPressedEvent__DelegateSignature();      // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.BndEvt__W_BaseSplitWidget_W_BaseDialogueButton_Craft_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
	void BndEvt__W_BaseSplitWidget_W_BaseDialogueButton_Craft_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();   // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.BndEvt__W_BaseSplitWidget_W_BaseDialogueButton_Cancel_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
	void BndEvt__W_BaseSplitWidget_W_BaseDialogueButton_Cancel_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature();  // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.BndEvt__W_BaseSplitWidget_Button_Plus_1_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature
	void BndEvt__W_BaseSplitWidget_Button_Plus_1_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();     // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.BndEvt__W_BaseSplitWidget_Button_Minus_1_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature
	void BndEvt__W_BaseSplitWidget_Button_Minus_1_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();    // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.BndEvt__W_BaseSplitWidget_Slider_Craft_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature
	void BndEvt__W_BaseSplitWidget_Slider_Craft_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature(float Value); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.BndEvt__W_BaseSplitWidget_W_HintButtonLess_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature
	void BndEvt__W_BaseSplitWidget_W_HintButtonLess_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature();             // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.BndEvt__W_BaseSplitWidget_W_HintButtonMax_K2Node_ComponentBoundEvent_14_OnPressed__DelegateSignature
	void BndEvt__W_BaseSplitWidget_W_HintButtonMax_K2Node_ComponentBoundEvent_14_OnPressed__DelegateSignature();             // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.BndEvt__W_BaseSplitWidget_W_HintButtonMore_K2Node_ComponentBoundEvent_15_OnPressed__DelegateSignature
	void BndEvt__W_BaseSplitWidget_W_HintButtonMore_K2Node_ComponentBoundEvent_15_OnPressed__DelegateSignature();            // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.ButtonMax
	void ButtonMax();                                                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.ButtonLess
	void ButtonLess();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.ButtonMore
	void ButtonMore();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.ExecuteUbergraph_W_BaseSplitWidget
	void ExecuteUbergraph_W_BaseSplitWidget(int32_t EntryPoint);                                                             // [0x2407bf0] Final|HasDefaults    
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.SplitWidget_OnAcceptFull__DelegateSignature
	void SplitWidget_OnAcceptFull__DelegateSignature(UW_BaseSlot_C* RecipientSlot, UW_BaseContainer_C* SenderContainer);     // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.SplitWidget_OnAcceptSplit__DelegateSignature
	void SplitWidget_OnAcceptSplit__DelegateSignature(int32_t Count, UW_BaseSlot_C* RecipientSlot, UW_BaseContainer_C* SenderContainer); // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/ContainerSystem/W_BaseSplitWidget.W_BaseSplitWidget_C.SplitWidget_OnCancel__DelegateSignature
	void SplitWidget_OnCancel__DelegateSignature(UW_BaseContainer_C* SenderContainer);                                       // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/InGameShop/W_ShopSplitWidget.W_ShopSplitWidget_C
/// Size: 0x0008 (0x000710 - 0x000718)
class UW_ShopSplitWidget_C : public UW_BaseSplitWidget_C : UW_BaseSplitWidget_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0710   (0x0008)  


	/// Functions
	// Function /Game/UI/InGameShop/W_ShopSplitWidget.W_ShopSplitWidget_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopSplitWidget.W_ShopSplitWidget_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopSplitWidget.W_ShopSplitWidget_C.OnCounterValueChanged
	void OnCounterValueChanged(double Value);                                                                                // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopSplitWidget.W_ShopSplitWidget_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopSplitWidget.W_ShopSplitWidget_C.ExecuteUbergraph_W_ShopSplitWidget
	void ExecuteUbergraph_W_ShopSplitWidget(int32_t EntryPoint);                                                             // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/UI/ContainerSystem/I_ContainerOwner.I_ContainerOwner_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UI_ContainerOwner_C : public UInterface : UInterface
{ 
public:
};

/// Class /Game/UI/WorkbenchUI/CategoryEntries/WBP_MainCategorySelectorEntry.WBP_MainCategorySelectorEntry_C
/// Size: 0x0079 (0x000280 - 0x0002F9)
class UWBP_MainCategorySelectorEntry_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  NewHover;                                                   // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Hover;                                                      // 0x0290   (0x0008)  
	UWidgetAnimation*                                  Deselect;                                                   // 0x0298   (0x0008)  
	UWidgetAnimation*                                  Deselect;                                                   // 0x02A0   (0x0008)  
	UWidgetAnimation*                                  Select;                                                     // 0x02A8   (0x0008)  
	UWidgetAnimation*                                  Hover;                                                      // 0x02B0   (0x0008)  
	UButton*                                           Button;                                                     // 0x02B8   (0x0008)  
	UTextBlock*                                        EntryText;                                                  // 0x02C0   (0x0008)  
	FText                                              Text;                                                       // 0x02C8   (0x0018)  
	int32_t                                            Index;                                                      // 0x02E0   (0x0004)  
	bool                                               bSelected;                                                  // 0x02E4   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02E5   (0x0003)  MISSED
	FMulticastInlineDelegate                           OnEntrySelected;                                            // 0x02E8   (0x0010)  
	bool                                               bDisabled;                                                  // 0x02F8   (0x0001)  


	/// Functions
	// Function /Game/UI/WorkbenchUI/CategoryEntries/WBP_MainCategorySelectorEntry.WBP_MainCategorySelectorEntry_C.GetText
	void GetText(FText& Text);                                                                                               // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/WorkbenchUI/CategoryEntries/WBP_MainCategorySelectorEntry.WBP_MainCategorySelectorEntry_C.SelectEntry
	void SelectEntry(bool Select);                                                                                           // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/WorkbenchUI/CategoryEntries/WBP_MainCategorySelectorEntry.WBP_MainCategorySelectorEntry_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/WorkbenchUI/CategoryEntries/WBP_MainCategorySelectorEntry.WBP_MainCategorySelectorEntry_C.BndEvt__WBP_MainCategorySelectorEntry_Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_MainCategorySelectorEntry_Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();  // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/WorkbenchUI/CategoryEntries/WBP_MainCategorySelectorEntry.WBP_MainCategorySelectorEntry_C.BndEvt__WBP_MainCategorySelectorEntry_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_MainCategorySelectorEntry_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();  // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/WorkbenchUI/CategoryEntries/WBP_MainCategorySelectorEntry.WBP_MainCategorySelectorEntry_C.BndEvt__WBP_MainCategorySelectorEntry_Button_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature
	void BndEvt__WBP_MainCategorySelectorEntry_Button_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/WorkbenchUI/CategoryEntries/WBP_MainCategorySelectorEntry.WBP_MainCategorySelectorEntry_C.ExecuteUbergraph_WBP_MainCategorySelectorEntry
	void ExecuteUbergraph_WBP_MainCategorySelectorEntry(int32_t EntryPoint);                                                 // [0x2407bf0] Final                
	// Function /Game/UI/WorkbenchUI/CategoryEntries/WBP_MainCategorySelectorEntry.WBP_MainCategorySelectorEntry_C.OnEntrySelected__DelegateSignature
	void OnEntrySelected__DelegateSignature(int32_t Index);                                                                  // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/MainMenu/Server/W_RegionCellEmpty.W_RegionCellEmpty_C
/// Size: 0x0028 (0x000280 - 0x0002A8)
class UW_RegionCellEmpty_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  DotsAnim;                                                   // 0x0288   (0x0008)  
	UBorder*                                           Border_Searching;                                           // 0x0290   (0x0008)  
	USizeBox*                                          SizeBox_AfterCell;                                          // 0x0298   (0x0008)  
	FTimerHandle                                       Timer;                                                      // 0x02A0   (0x0008)  


	/// Functions
	// Function /Game/UI/MainMenu/Server/W_RegionCellEmpty.W_RegionCellEmpty_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/MainMenu/Server/W_RegionCellEmpty.W_RegionCellEmpty_C.CustomEvent
	void CustomEvent();                                                                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/Server/W_RegionCellEmpty.W_RegionCellEmpty_C.Destruct
	void Destruct();                                                                                                         // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/MainMenu/Server/W_RegionCellEmpty.W_RegionCellEmpty_C.ExecuteUbergraph_W_RegionCellEmpty
	void ExecuteUbergraph_W_RegionCellEmpty(int32_t EntryPoint);                                                             // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C
/// Size: 0x0050 (0x000280 - 0x0002D0)
class UW_ShopCategorySelector_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UHorizontalBox*                                    HorizontalBox_CategoryButtons;                              // 0x0288   (0x0008)  
	UW_HintButtonNew_C*                                W_ButtonNext;                                               // 0x0290   (0x0008)  
	UW_HintButtonNew_C*                                W_ButtonPrev;                                               // 0x0298   (0x0008)  
	UW_ShopCategoryButton_C*                           W_ShopCategoryButton_All;                                   // 0x02A0   (0x0008)  
	TArray<UW_ShopCategoryButton_C*>                   CategoryButtons;                                            // 0x02A8   (0x0010)  
	int32_t                                            SelectedButtonIndex;                                        // 0x02B8   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x02BC   (0x0004)  MISSED
	FMulticastInlineDelegate                           OnCategoryChanged;                                          // 0x02C0   (0x0010)  


	/// Functions
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.ReInit
	void ReInit(TArray<FName>& CategoryNames);                                                                               // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.SetCurrentCategory
	void SetCurrentCategory(int32_t NewIndex);                                                                               // [0x2407bf0] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.GetNumButtons
	void GetNumButtons(int32_t& Num);                                                                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.GetCurrentButtonRef
	void GetCurrentButtonRef(UW_ShopCategoryButton_C*& ButtonRef);                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.SwitchPrevCategory
	void SwitchPrevCategory();                                                                                               // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.SwitchNextCategory
	void SwitchNextCategory();                                                                                               // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.UnbindButton
	void UnbindButton(UW_ShopCategoryButton_C* ButtonRef);                                                                   // [0x2407bf0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.BindButton
	void BindButton(UW_ShopCategoryButton_C* ButtonRef);                                                                     // [0x2407bf0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.ButtonSelected_Handler
	void ButtonSelected_Handler(UW_ShopCategoryButton_C* ButtonRef);                                                         // [0x2407bf0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.ButtonUnhovered_Handler
	void ButtonUnhovered_Handler(UW_ShopCategoryButton_C* ButtonRef);                                                        // [0x2407bf0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.ButtonHovered_Handler
	void ButtonHovered_Handler(UW_ShopCategoryButton_C* ButtonRef);                                                          // [0x2407bf0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.SetCategories
	void SetCategories(TArray<FName>& CategoryTypes);                                                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.ClearCategories
	void ClearCategories();                                                                                                  // [0x2407bf0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.Destruct
	void Destruct();                                                                                                         // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.BndEvt__W_ShopCategorySelector_W_ButtonPrev_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature
	void BndEvt__W_ShopCategorySelector_W_ButtonPrev_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature();            // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.BndEvt__W_ShopCategorySelector_W_ButtonNext_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature
	void BndEvt__W_ShopCategorySelector_W_ButtonNext_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature();            // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.ExecuteUbergraph_W_ShopCategorySelector
	void ExecuteUbergraph_W_ShopCategorySelector(int32_t EntryPoint);                                                        // [0x2407bf0] Final                
	// Function /Game/UI/InGameShop/W_ShopCategorySelector.W_ShopCategorySelector_C.OnCategoryChanged__DelegateSignature
	void OnCategoryChanged__DelegateSignature(FS_CategoryData CategoryData, bool All);                                       // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/WorkbenchUI/W_CraftCategorySelector.W_CraftCategorySelector_C
/// Size: 0x0018 (0x0002D0 - 0x0002E8)
class UW_CraftCategorySelector_C : public UW_ShopCategorySelector_C : UW_ShopCategorySelector_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02D0   (0x0008)  
	TArray<FName>                                      CategoriesArray;                                            // 0x02D8   (0x0010)  


	/// Functions
	// Function /Game/UI/WorkbenchUI/W_CraftCategorySelector.W_CraftCategorySelector_C.SetCategoriesArray
	void SetCategoriesArray(TArray<FName>& CategoriesArray);                                                                 // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/WorkbenchUI/W_CraftCategorySelector.W_CraftCategorySelector_C.SetCategories
	void SetCategories(TArray<FName>& CategoryTypes);                                                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/WorkbenchUI/W_CraftCategorySelector.W_CraftCategorySelector_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/WorkbenchUI/W_CraftCategorySelector.W_CraftCategorySelector_C.ExecuteUbergraph_W_CraftCategorySelector
	void ExecuteUbergraph_W_CraftCategorySelector(int32_t EntryPoint);                                                       // [0x2407bf0] Final                
};

/// Class /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C
/// Size: 0x00D4 (0x000280 - 0x000354)
class UW_ShopCategoryButton_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Deselect_Anim;                                              // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Select_Anim;                                                // 0x0290   (0x0008)  
	UWidgetAnimation*                                  Unhover_Anim;                                               // 0x0298   (0x0008)  
	UWidgetAnimation*                                  Hover_Anim;                                                 // 0x02A0   (0x0008)  
	UButton*                                           Button_Category;                                            // 0x02A8   (0x0008)  
	UImage*                                            Image;                                                      // 0x02B0   (0x0008)  
	UTextBlock*                                        TextBlock_CategoryName;                                     // 0x02B8   (0x0008)  
	bool                                               bIsButtonHovered;                                           // 0x02C0   (0x0001)  
	bool                                               bIsButtonSelected;                                          // 0x02C1   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x02C2   (0x0002)  MISSED
	FName                                              Category_Name;                                              // 0x02C4   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x02CC   (0x0004)  MISSED
	FMulticastInlineDelegate                           OnButtonHovered;                                            // 0x02D0   (0x0010)  
	FMulticastInlineDelegate                           OnButtonUnhovered;                                          // 0x02E0   (0x0010)  
	FMulticastInlineDelegate                           OnButtonSelected;                                           // 0x02F0   (0x0010)  
	bool                                               bIsCommonCategory;                                          // 0x0300   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0301   (0x0007)  MISSED
	FS_CategoryData                                    CategoryData;                                               // 0x0308   (0x0048)  
	int32_t                                            ImageSize;                                                  // 0x0350   (0x0004)  


	/// Functions
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.IsCommonCategory
	void IsCommonCategory(bool& bIsCommonCategory);                                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.InitCategory
	void InitCategory();                                                                                                     // [0x2407bf0] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.GetCategoryData
	void GetCategoryData(FS_CategoryData& CategoryData);                                                                     // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.IsButtonSelected
	void IsButtonSelected(bool& bIsButtonSelected);                                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.IsButtonHovered
	void IsButtonHovered(bool& bIsButtonHovered);                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.BndEvt__W_ShopCategoryButton_Button_Category_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__W_ShopCategoryButton_Button_Category_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.BndEvt__W_ShopCategoryButton_Button_Category_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__W_ShopCategoryButton_Button_Category_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();  // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.BndEvt__W_ShopCategoryButton_Button_Category_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__W_ShopCategoryButton_Button_Category_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();  // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.Hover
	void Hover();                                                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.Unhover
	void Unhover();                                                                                                          // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.Select
	void Select();                                                                                                           // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.Deselect
	void Deselect();                                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.ExecuteUbergraph_W_ShopCategoryButton
	void ExecuteUbergraph_W_ShopCategoryButton(int32_t EntryPoint);                                                          // [0x2407bf0] Final                
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.OnButtonSelected__DelegateSignature
	void OnButtonSelected__DelegateSignature(UW_ShopCategoryButton_C* ButtonRef);                                            // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.OnButtonUnhovered__DelegateSignature
	void OnButtonUnhovered__DelegateSignature(UW_ShopCategoryButton_C* ButtonRef);                                           // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/InGameShop/W_ShopCategoryButton.W_ShopCategoryButton_C.OnButtonHovered__DelegateSignature
	void OnButtonHovered__DelegateSignature(UW_ShopCategoryButton_C* ButtonRef);                                             // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/WorkbenchUI/W_CraftCategoryButton.W_CraftCategoryButton_C
/// Size: 0x0008 (0x000354 - 0x00035C)
class UW_CraftCategoryButton_C : public UW_ShopCategoryButton_C : UW_ShopCategoryButton_C
{ 
public:
	FName                                              CategoryName_;                                              // 0x0354   (0x0008)  


	/// Functions
	// Function /Game/UI/WorkbenchUI/W_CraftCategoryButton.W_CraftCategoryButton_C.GetCategoryName
	void GetCategoryName(FName& CategoryName_);                                                                              // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/WorkbenchUI/W_CraftCategoryButton.W_CraftCategoryButton_C.InitCategory
	void InitCategory();                                                                                                     // [0x2407bf0] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/CharacterCreate/WBP_CharacterCreate_NavigationButton.WBP_CharacterCreate_NavigationButton_C
/// Size: 0x00B8 (0x000280 - 0x000338)
class UWBP_CharacterCreate_NavigationButton_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Hover;                                                      // 0x0288   (0x0008)  
	UButton*                                           Button;                                                     // 0x0290   (0x0008)  
	UHorizontalBox*                                    Button_Content;                                             // 0x0298   (0x0008)  
	UImage*                                            Image;                                                      // 0x02A0   (0x0008)  
	UImage*                                            Image;                                                      // 0x02A8   (0x0008)  
	USizeBox*                                          SizeBox_ArrowLeft;                                          // 0x02B0   (0x0008)  
	USizeBox*                                          SizeBox_ArrowRight;                                         // 0x02B8   (0x0008)  
	UTextBlock*                                        TextBlock_ButtonText;                                       // 0x02C0   (0x0008)  
	UWBP_KeyIcon_C*                                    WBP_KeyIcon_Left;                                           // 0x02C8   (0x0008)  
	UWBP_KeyIcon_C*                                    WBP_KeyIcon_Right;                                          // 0x02D0   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_ContentLeft;                                 // 0x02D8   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_ContentRight;                                // 0x02E0   (0x0008)  
	bool                                               bOrientLeft;                                                // 0x02E8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02E9   (0x0007)  MISSED
	FText                                              ButtonText;                                                 // 0x02F0   (0x0018)  
	FMulticastInlineDelegate                           OnButtonPressed;                                            // 0x0308   (0x0010)  
	bool                                               bShowButtonKey;                                             // 0x0318   (0x0001)  
	bool                                               NewVar;                                                     // 0x0319   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x031A   (0x0006)  MISSED
	FKey                                               Key;                                                        // 0x0320   (0x0018)  


	/// Functions
	// Function /Game/UI/CharacterCreate/WBP_CharacterCreate_NavigationButton.WBP_CharacterCreate_NavigationButton_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/CharacterCreate/WBP_CharacterCreate_NavigationButton.WBP_CharacterCreate_NavigationButton_C.BndEvt__WBP_CharacterCreate_NavigationButton_ButtonBack_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_CharacterCreate_NavigationButton_ButtonBack_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/CharacterCreate/WBP_CharacterCreate_NavigationButton.WBP_CharacterCreate_NavigationButton_C.BndEvt__WBP_CharacterCreate_NavigationButton_ButtonBack_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_CharacterCreate_NavigationButton_ButtonBack_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/CharacterCreate/WBP_CharacterCreate_NavigationButton.WBP_CharacterCreate_NavigationButton_C.BndEvt__WBP_CharacterCreate_NavigationButton_ButtonBack_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature
	void BndEvt__WBP_CharacterCreate_NavigationButton_ButtonBack_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/CharacterCreate/WBP_CharacterCreate_NavigationButton.WBP_CharacterCreate_NavigationButton_C.ExecuteUbergraph_WBP_CharacterCreate_NavigationButton
	void ExecuteUbergraph_WBP_CharacterCreate_NavigationButton(int32_t EntryPoint);                                          // [0x2407bf0] Final                
	// Function /Game/UI/CharacterCreate/WBP_CharacterCreate_NavigationButton.WBP_CharacterCreate_NavigationButton_C.OnButtonPressed__DelegateSignature
	void OnButtonPressed__DelegateSignature();                                                                               // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C
/// Size: 0x0078 (0x000280 - 0x0002F8)
class UWBP_CharacterRow_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  ToggleFocus;                                                // 0x0288   (0x0008)  
	UButton*                                           Button;                                                     // 0x0290   (0x0008)  
	UButton*                                           Button_Delete;                                              // 0x0298   (0x0008)  
	UImage*                                            Image_Delete;                                               // 0x02A0   (0x0008)  
	UImage*                                            Image_PlayerIcon;                                           // 0x02A8   (0x0008)  
	UImage*                                            Image_Selected;                                             // 0x02B0   (0x0008)  
	USizeBox*                                          SizeBox_ButtonDelete;                                       // 0x02B8   (0x0008)  
	UTextBlock*                                        Text_DaysOfSurvival;                                        // 0x02C0   (0x0008)  
	UTextBlock*                                        Text_PlayerName;                                            // 0x02C8   (0x0008)  
	UTextBlock*                                        TextBlock;                                                  // 0x02D0   (0x0008)  
	FMulticastInlineDelegate                           OnClickedDelete;                                            // 0x02D8   (0x0010)  
	FTimerHandle                                       OnHoverTimerHandle;                                         // 0x02E8   (0x0008)  
	bool                                               focused;                                                    // 0x02F0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02F1   (0x0003)  MISSED
	int32_t                                            Value;                                                      // 0x02F4   (0x0004)  


	/// Functions
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.GetValueDaysOfSurvival
	FText GetValueDaysOfSurvival();                                                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.GetNamePlayer
	FText GetNamePlayer();                                                                                                   // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.OnHoverTimerHandler
	void OnHoverTimerHandler();                                                                                              // [0x2407bf0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.OnCreateHoverTimerHandler
	void OnCreateHoverTimerHandler();                                                                                        // [0x2407bf0] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.OnPlayAnimation
	void OnPlayAnimation(UWidgetAnimation* Animation, bool NewState);                                                        // [0x2407bf0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.OnFocus
	void OnFocus(bool NewState);                                                                                             // [0x2407bf0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.BndEvt__WBP_CharacterRow_Button_Edit_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__WBP_CharacterRow_Button_Edit_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();        // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.BndEvt__WBP_CharacterRow_Button_Delete_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_CharacterRow_Button_Delete_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();        // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.BndEvt__WBP_CharacterRow_Button_83_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_CharacterRow_Button_83_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();            // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.BndEvt__WBP_CharacterRow_Button_83_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_CharacterRow_Button_83_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();            // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.BndEvt__WBP_CharacterRow_Button_Delete_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_CharacterRow_Button_Delete_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();        // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.ExecuteUbergraph_WBP_CharacterRow
	void ExecuteUbergraph_WBP_CharacterRow(int32_t EntryPoint);                                                              // [0x2407bf0] Final|HasDefaults    
	// Function /Game/UI/MainMenu/Characters/WBP_CharacterRow.WBP_CharacterRow_C.OnClickedDelete__DelegateSignature
	void OnClickedDelete__DelegateSignature();                                                                               // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/MainMenu/Characters/WBP_PlayButton.WBP_PlayButton_C
/// Size: 0x0040 (0x000280 - 0x0002C0)
class UWBP_PlayButton_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UButton*                                           Button_Enter;                                               // 0x0288   (0x0008)  
	UTextBlock*                                        Text_Button;                                                // 0x0290   (0x0008)  
	FMulticastInlineDelegate                           OnClickedEnter;                                             // 0x0298   (0x0010)  
	FText                                              ButtonText;                                                 // 0x02A8   (0x0018)  


	/// Functions
	// Function /Game/UI/MainMenu/Characters/WBP_PlayButton.WBP_PlayButton_C.SetButtonText
	void SetButtonText(FText NewText);                                                                                       // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/Characters/WBP_PlayButton.WBP_PlayButton_C.BndEvt__WBP_OpenWorldButton_Button_Enter_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__WBP_OpenWorldButton_Button_Enter_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();    // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/MainMenu/Characters/WBP_PlayButton.WBP_PlayButton_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/MainMenu/Characters/WBP_PlayButton.WBP_PlayButton_C.BndEvt__WBP_PlayButton_Button_Enter_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__WBP_PlayButton_Button_Enter_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();           // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/MainMenu/Characters/WBP_PlayButton.WBP_PlayButton_C.ExecuteUbergraph_WBP_PlayButton
	void ExecuteUbergraph_WBP_PlayButton(int32_t EntryPoint);                                                                // [0x2407bf0] Final|HasDefaults    
	// Function /Game/UI/MainMenu/Characters/WBP_PlayButton.WBP_PlayButton_C.OnClickedEnter__DelegateSignature
	void OnClickedEnter__DelegateSignature();                                                                                // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Camp/WBP_CampDragWidget.WBP_CampDragWidget_C
/// Size: 0x0018 (0x000280 - 0x000298)
class UWBP_CampDragWidget_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UImage*                                            Image;                                                      // 0x0288   (0x0008)  
	UWBP_CookingItem_C*                                ItemWidget;                                                 // 0x0290   (0x0008)  


	/// Functions
	// Function /Game/UI/Camp/WBP_CampDragWidget.WBP_CampDragWidget_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Camp/WBP_CampDragWidget.WBP_CampDragWidget_C.ExecuteUbergraph_WBP_CampDragWidget
	void ExecuteUbergraph_WBP_CampDragWidget(int32_t EntryPoint);                                                            // [0x2407bf0] Final                
};

/// Class /Game/UI/MainMenu/W_SettengRow_Button.W_SettengRow_Button_C
/// Size: 0x0071 (0x000280 - 0x0002F1)
class UW_SettengRow_Button_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Select_FromUnhover;                                         // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Select_FromHover;                                           // 0x0290   (0x0008)  
	UWidgetAnimation*                                  Hover_NotSelected;                                          // 0x0298   (0x0008)  
	UButton*                                           Button_Action;                                              // 0x02A0   (0x0008)  
	UImage*                                            Image_BG;                                                   // 0x02A8   (0x0008)  
	UImage*                                            Image_Hover;                                                // 0x02B0   (0x0008)  
	UImage*                                            Image_Select;                                               // 0x02B8   (0x0008)  
	UTextBlock*                                        TextBlock_Text;                                             // 0x02C0   (0x0008)  
	FText                                              Text;                                                       // 0x02C8   (0x0018)  
	FMulticastInlineDelegate                           OnButtonPressed;                                            // 0x02E0   (0x0010)  
	bool                                               bSelected;                                                  // 0x02F0   (0x0001)  


	/// Functions
	// Function /Game/UI/MainMenu/W_SettengRow_Button.W_SettengRow_Button_C.Hover
	void Hover(bool bHover);                                                                                                 // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettengRow_Button.W_SettengRow_Button_C.Select
	void Select(bool bSelect);                                                                                               // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettengRow_Button.W_SettengRow_Button_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettengRow_Button.W_SettengRow_Button_C.BndEvt__W_SettengRow_Button_Button_Action_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
	void BndEvt__W_SettengRow_Button_Button_Action_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();   // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/MainMenu/W_SettengRow_Button.W_SettengRow_Button_C.BndEvt__W_SettengRow_Button_Button_Action_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__W_SettengRow_Button_Button_Action_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();     // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/MainMenu/W_SettengRow_Button.W_SettengRow_Button_C.BndEvt__W_SettengRow_Button_Button_Action_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__W_SettengRow_Button_Button_Action_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();     // [0x2407bf0] BlueprintEvent       
	// Function /Game/UI/MainMenu/W_SettengRow_Button.W_SettengRow_Button_C.ExecuteUbergraph_W_SettengRow_Button
	void ExecuteUbergraph_W_SettengRow_Button(int32_t EntryPoint);                                                           // [0x2407bf0] Final                
	// Function /Game/UI/MainMenu/W_SettengRow_Button.W_SettengRow_Button_C.OnButtonPressed__DelegateSignature
	void OnButtonPressed__DelegateSignature(UW_SettengRow_Button_C* RowButton);                                              // [0x2407bf0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/MainMenu/W_VideoMemory.W_VideoMemory_C
/// Size: 0x0078 (0x000280 - 0x0002F8)
class UW_VideoMemory_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UImage*                                            Image;                                                      // 0x0288   (0x0008)  
	UImage*                                            Image;                                                      // 0x0290   (0x0008)  
	UImage*                                            Image_BG;                                                   // 0x0298   (0x0008)  
	UImage*                                            Image_OSApp_BG;                                             // 0x02A0   (0x0008)  
	UImage*                                            Image_OSApp_Fill;                                           // 0x02A8   (0x0008)  
	UImage*                                            Image_Warning;                                              // 0x02B0   (0x0008)  
	UImage*                                            Image_WeightSeparator;                                      // 0x02B8   (0x0008)  
	UProgressBar*                                      ProgressBar_GameApp;                                        // 0x02C0   (0x0008)  
	USlider*                                           Slider_Limit;                                               // 0x02C8   (0x0008)  
	UTextBlock*                                        Text_CurrentRAM;                                            // 0x02D0   (0x0008)  
	UTextBlock*                                        Text_GameAppMemory;                                         // 0x02D8   (0x0008)  
	UTextBlock*                                        Text_OSAppsMemory;                                          // 0x02E0   (0x0008)  
	UTextBlock*                                        Text_TotalRAM;                                              // 0x02E8   (0x0008)  
	UTextBlock*                                        Text_VRAMUsage;                                             // 0x02F0   (0x0008)  


	/// Functions
	// Function /Game/UI/MainMenu/W_VideoMemory.W_VideoMemory_C.ExecuteUbergraph_W_VideoMemory
	void ExecuteUbergraph_W_VideoMemory(int32_t EntryPoint);                                                                 // [0x2407bf0] Final                
};

/// Class /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C
/// Size: 0x1880 (0x000280 - 0x001B00)
class UW_SettingRow_Text_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Deselect_Anim;                                              // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Select_Anim;                                                // 0x0290   (0x0008)  
	UWidgetAnimation*                                  Hover_Anim;                                                 // 0x0298   (0x0008)  
	UButton*                                           Button_DoScroll;                                            // 0x02A0   (0x0008)  
	UButton*                                           Button_SwitchBackward;                                      // 0x02A8   (0x0008)  
	UButton*                                           Button_SwitchForward;                                       // 0x02B0   (0x0008)  
	UImage*                                            Image_ArrowLeft;                                            // 0x02B8   (0x0008)  
	UImage*                                            Image_ArrowRight;                                           // 0x02C0   (0x0008)  
	UImage*                                            Image_Default;                                              // 0x02C8   (0x0008)  
	UImage*                                            Image_Hovered;                                              // 0x02D0   (0x0008)  
	UImage*                                            Image_Selected;                                             // 0x02D8   (0x0008)  
	UTextBlock*                                        MainText;                                                   // 0x02E0   (0x0008)  
	UTextBlock*                                        SettingLongText;                                            // 0x02E8   (0x0008)  
	UTextBlock*                                        SettingText;                                                // 0x02F0   (0x0008)  
	USizeBox*                                          SizeBox_ButtonLeft;                                         // 0x02F8   (0x0008)  
	USizeBox*                                          SizeBox_ButtonRight;                                        // 0x0300   (0x0008)  
	UWidgetSwitcher*                                   WidgetSwitcher_Type;                                        // 0x0308   (0x0008)  
	TArray<FText>                                      Content;                                                    // 0x0310   (0x0010)  
	int32_t                                            CurrentIndex;                                               // 0x0320   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0324   (0x0004)  MISSED
	FMulticastInlineDelegate                           IndexHasBeenChanged;                                        // 0x0328   (0x0010)  
	int32_t                                            MaxIndex;                                                   // 0x0338   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x033C   (0x0004)  MISSED
	FButtonStyle                                       NormalButtonStyleF;                                         // 0x0340   (0x03F0)  
	FButtonStyle                                       Style;                                                      // 0x0730   (0x03F0)  
	FButtonStyle                                       NormalButtonStyle_B;                                        // 0x0B20   (0x03F0)  
	FButtonStyle                                       Style_b;                                                    // 0x0F10   (0x03F0)  
	FButtonStyle                                       Style_N_B;                                                  // 0x1300   (0x03F0)  
	FButtonStyle                                       Style_N_F;                                                  // 0x16F0   (0x03F0)  
	bool                                               bIsRowHovered;                                              // 0x1AE0   (0x0001)  
	bool                                               bIsRowSelected;                                             // 0x1AE1   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x1AE2   (0x0006)  MISSED
	UUserWidget*                                       ParentSettingsMenu;                                         // 0x1AE8   (0x0008)  
	FName                                              SettingName;                                                // 0x1AF0   (0x0008)  
	int32_t                                            PreIndex;                                                   // 0x1AF8   (0x0004)  
	int32_t                                            Index_type;                                                 // 0x1AFC   (0x0004)  


	/// Functions
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.GetIsDefaultValue
	void GetIsDefaultValue(bool& Default);                                                                                   // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.GetSettingName
	void GetSettingName(FName& SettingName);                                                                                 // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.IsRowSelected
	void IsRowSelected(bool& IsSelected);                                                                                    // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.IsRowHovered
	void IsRowHovered(bool& IsHovered);                                                                                      // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.SetAroowsState
	void SetAroowsState();                                                                                                   // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.SetButtonsState
	void SetButtonsState();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.SetSelected
	void SetSelected(bool Selected);                                                                                         // [0x2407bf0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.SetHovered
	void SetHovered();                                                                                                       // [0x2407bf0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.SetDefault
	void SetDefault();                                                                                                       // [0x2407bf0] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.SetValues
	void SetValues(TArray<FText>& Content);                                                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.InitSetting
	void InitSetting();                                                                                                      // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.SetTextByIndex
	void SetTextByIndex(int32_t Index);                                                                                      // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.Init
	void Init(int32_t CurrentIndex);                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.DeselectRow
	void DeselectRow();                                                                                                      // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.SelectRow
	void SelectRow();                                                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/MainMenu/W_SettingRow_Text.W_SettingRow_Text_C.UnhoverRow
