
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package Vehicle.

/// Struct /Game/Vehicle/Models/AmgGClass/AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint.AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/Vehicle/Models/BugBolide/BugBolide_SkeletalMesh_Skeleton_AnimBlueprint.BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/Vehicle/Models/Lambo/new2/LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint.LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/Vehicle/Models/sportcar_01/Sportcar_SkeletalMesh_Skeleton_AnimBlueprint.Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/Vehicle/Models/Tigger/RazdelniiMesh/Tiger_SkeletalMesh_Skeleton_AnimBlueprint.Tiger_SkeletalMesh_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Struct /Game/Vehicle/Models/FGearAssets/Sedan/fgSedan_AnimBP.fgSedan_AnimBP_C.AnimBlueprintGeneratedConstantData
/// Size: 0x00CF (0x000001 - 0x0000D0)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{ 
	unsigned char                                      UnknownData00_2[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              __NameProperty;                                             // 0x0004   (0x0008)  
	FName                                              __NameProperty;                                             // 0x000C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FAnimNodeFunctionRef                               __StructProperty;                                           // 0x0018   (0x0020)  
	FAnimSubsystem_PropertyAccess                      AnimBlueprintExtension_PropertyAccess;                      // 0x0038   (0x0080)  
	FAnimSubsystem_Base                                AnimBlueprintExtension_Base;                                // 0x00B8   (0x0018)  
};

/// Class /Game/Vehicle/Models/AdvancedVehicleSystem/Widget/Debug_FX_widget.Debug_FX_widget_C
/// Size: 0x0068 (0x000280 - 0x0002E8)
class UDebug_FX_widget_C : public UUserWidget : UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UEditableTextBox*                                  SpawnRate_InT;                                              // 0x0288   (0x0008)  
	UEditableTextBox*                                  SpawnRate_ST2_InT;                                          // 0x0290   (0x0008)  
	UEditableTextBox*                                  SpawnRate_ST3_InT;                                          // 0x0298   (0x0008)  
	UEditableTextBox*                                  SpawnRate_ST4_InT;                                          // 0x02A0   (0x0008)  
	UEditableTextBox*                                  SpawnRate_ST_InT;                                           // 0x02A8   (0x0008)  
	double                                             Spawn;                                                      // 0x02B0   (0x0008)  
	double                                             SpawnST;                                                    // 0x02B8   (0x0008)  
	double                                             SpawnST2;                                                   // 0x02C0   (0x0008)  
	double                                             SpawnST3;                                                   // 0x02C8   (0x0008)  
	double                                             SpawnST4;                                                   // 0x02D0   (0x0008)  
	AActor*                                            owner_;                                                     // 0x02D8   (0x0008)  
	AAVS_VehicleMaster_C*                              As_AVS_Vehicle_Master;                                      // 0x02E0   (0x0008)  


	/// Functions
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/Widget/Debug_FX_widget.Debug_FX_widget_C.SetHintText
	void SetHintText(double SR, double SRST, double SRST2, double SRST3, double SRST4);                                      // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/Widget/Debug_FX_widget.Debug_FX_widget_C.Construct
	void Construct();                                                                                                        // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/Widget/Debug_FX_widget.Debug_FX_widget_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x2407bf0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/Widget/Debug_FX_widget.Debug_FX_widget_C.BndEvt__Debug_FX_widget_EditableTextBox_32_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature
	void BndEvt__Debug_FX_widget_EditableTextBox_32_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature(FText& Text, TEnumAsByte<ETextCommit> CommitMethod); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/Widget/Debug_FX_widget.Debug_FX_widget_C.BndEvt__Debug_FX_widget_EditableTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature
	void BndEvt__Debug_FX_widget_EditableTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature(FText& Text, TEnumAsByte<ETextCommit> CommitMethod); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/Widget/Debug_FX_widget.Debug_FX_widget_C.BndEvt__Debug_FX_widget_EditableTextBox_1_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature
	void BndEvt__Debug_FX_widget_EditableTextBox_1_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature(FText& Text, TEnumAsByte<ETextCommit> CommitMethod); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/Widget/Debug_FX_widget.Debug_FX_widget_C.BndEvt__Debug_FX_widget_EditableTextBox_2_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature
	void BndEvt__Debug_FX_widget_EditableTextBox_2_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature(FText& Text, TEnumAsByte<ETextCommit> CommitMethod); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/Widget/Debug_FX_widget.Debug_FX_widget_C.BndEvt__Debug_FX_widget_EditableTextBox_3_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature
	void BndEvt__Debug_FX_widget_EditableTextBox_3_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature(FText& Text, TEnumAsByte<ETextCommit> CommitMethod); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/Widget/Debug_FX_widget.Debug_FX_widget_C.ExecuteUbergraph_Debug_FX_widget
	void ExecuteUbergraph_Debug_FX_widget(int32_t EntryPoint);                                                               // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Vehicle/Models/AmgGClass/AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint.AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_C
/// Size: 0x0C70 (0x000360 - 0x000FD0)
class UAmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_C : public UFGearAnimInstance : UFGearAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0368   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0370   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0378   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0398   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04C0   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05E8   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0710   (0x0128)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0838   (0x0010)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0848   (0x0048)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0890   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x08B0   (0x0108)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x09B8   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x09E0   (0x0028)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x0A08   (0x00E0)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0AE8   (0x0048)  
	FAnimNode_LookAt                                   AnimGraphNode_LookAt;                                       // 0x0B30   (0x0250)  
	FAnimNode_LookAt                                   AnimGraphNode_LookAt;                                       // 0x0D80   (0x0250)  


	/// Functions
	// Function /Game/Vehicle/Models/AmgGClass/AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint.AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AmgGClass/AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint.AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_6B374C5549D6E0CD050A2F916E62EB30
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_6B374C5549D6E0CD050A2F916E62EB30(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AmgGClass/AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint.AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_801D32184E147734B3B48CAB520EF06C
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_801D32184E147734B3B48CAB520EF06C(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AmgGClass/AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint.AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_21228BBA4F37EDC6DF3627A52A8A3CAF
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_21228BBA4F37EDC6DF3627A52A8A3CAF(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AmgGClass/AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint.AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_85C331354DFA1E7E8931DC85DB29F208
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_85C331354DFA1E7E8931DC85DB29F208(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AmgGClass/AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint.AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint_C.ExecuteUbergraph_AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint
	void ExecuteUbergraph_AmgGclass_SkeletalMesh_Skeleton_AnimBlueprint(int32_t EntryPoint);                                 // [0x2407bf0] Final                
};

/// Class /Game/Vehicle/Models/BugBolide/BugBolide_SkeletalMesh_Skeleton_AnimBlueprint.BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C
/// Size: 0x0C70 (0x000360 - 0x000FD0)
class UBugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C : public UFGearAnimInstance : UFGearAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0368   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0370   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0378   (0x0020)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0398   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x03E0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0408   (0x0028)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x0430   (0x00E0)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0510   (0x0048)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0558   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0660   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0788   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08B0   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x09D8   (0x0128)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0B00   (0x0010)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0B10   (0x0020)  
	FAnimNode_LookAt                                   AnimGraphNode_LookAt;                                       // 0x0B30   (0x0250)  
	FAnimNode_LookAt                                   AnimGraphNode_LookAt;                                       // 0x0D80   (0x0250)  


	/// Functions
	// Function /Game/Vehicle/Models/BugBolide/BugBolide_SkeletalMesh_Skeleton_AnimBlueprint.BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/BugBolide/BugBolide_SkeletalMesh_Skeleton_AnimBlueprint.BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_F5482327455D15CAF6C9FCAD8E980823
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_F5482327455D15CAF6C9FCAD8E980823(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/BugBolide/BugBolide_SkeletalMesh_Skeleton_AnimBlueprint.BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_984F81B24497D595DC8BA48D501D65D8
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_984F81B24497D595DC8BA48D501D65D8(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/BugBolide/BugBolide_SkeletalMesh_Skeleton_AnimBlueprint.BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_21F5475440464540DCE61095FB884942
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_21F5475440464540DCE61095FB884942(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/BugBolide/BugBolide_SkeletalMesh_Skeleton_AnimBlueprint.BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_981CD05244D0D315752B859339C8BAD2
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_981CD05244D0D315752B859339C8BAD2(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/BugBolide/BugBolide_SkeletalMesh_Skeleton_AnimBlueprint.BugBolide_SkeletalMesh_Skeleton_AnimBlueprint_C.ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint
	void ExecuteUbergraph_BugBolide_SkeletalMesh_Skeleton_AnimBlueprint(int32_t EntryPoint);                                 // [0x2407bf0] Final                
};

/// Class /Game/Vehicle/Models/Lambo/new2/LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint.LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_C
/// Size: 0x0E30 (0x000360 - 0x001190)
class ULamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_C : public UFGearAnimInstance : UFGearAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0368   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0370   (0x0008)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x0378   (0x00E0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0458   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0480   (0x0028)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x04A8   (0x0048)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x04F0   (0x0048)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0538   (0x0010)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0548   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0568   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0690   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08E0   (0x0128)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0A08   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0A28   (0x0128)  
	FAnimNode_LookAt                                   AnimGraphNode_LookAt;                                       // 0x0B50   (0x0250)  
	FAnimNode_LookAt                                   AnimGraphNode_LookAt;                                       // 0x0DA0   (0x0250)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0FF0   (0x0108)  
	USkeletalMeshComponent*                            LamboMesh;                                                  // 0x10F8   (0x0008)  
	FVector                                            L_F_Wheel;                                                  // 0x1100   (0x0018)  
	FVector                                            R_F_Wheel;                                                  // 0x1118   (0x0018)  
	FVector                                            L_B_Wheel;                                                  // 0x1130   (0x0018)  
	FVector                                            R_B_Wheel;                                                  // 0x1148   (0x0018)  
	FRotator                                           R_F_Wheel_rot;                                              // 0x1160   (0x0018)  
	FRotator                                           L_F_Wheel_rot;                                              // 0x1178   (0x0018)  


	/// Functions
	// Function /Game/Vehicle/Models/Lambo/new2/LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint.LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/Lambo/new2/LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint.LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_CDF44D6A489ED8687214A1AEFF655773
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_CDF44D6A489ED8687214A1AEFF655773(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/Lambo/new2/LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint.LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_8CC33AC443F07A7090FEFEB690A4D224
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_8CC33AC443F07A7090FEFEB690A4D224(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/Lambo/new2/LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint.LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_114E1A8B43FADD9AEF4985BE7E7757B6
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_114E1A8B43FADD9AEF4985BE7E7757B6(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/Lambo/new2/LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint.LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_787EEBF0418E476EBF9D4A8AC5177FAD
	void EvaluateGraphExposedInputs_ExecuteUbergraph_LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_787EEBF0418E476EBF9D4A8AC5177FAD(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/Lambo/new2/LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint.LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
	void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Vehicle/Models/Lambo/new2/LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint.LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_C.BlueprintInitializeAnimation
	void BlueprintInitializeAnimation();                                                                                     // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Vehicle/Models/Lambo/new2/LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint.LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint_C.ExecuteUbergraph_LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint
	void ExecuteUbergraph_LamboMurci_SkeletalMesh_Skeleton_AnimBlueprint(int32_t EntryPoint);                                // [0x2407bf0] Final                
};

/// Class /Game/Vehicle/Models/AdvancedVehicleSystem/Interface/AVS_Anim_BPI.AVS_Anim_BPI_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UAVS_Anim_BPI_C : public UInterface : UInterface
{ 
public:
};

/// Class /Game/Vehicle/Models/sportcar_01/Sportcar_SkeletalMesh_Skeleton_AnimBlueprint.Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_C
/// Size: 0x0C70 (0x000360 - 0x000FD0)
class USportcar_SkeletalMesh_Skeleton_AnimBlueprint_C : public UFGearAnimInstance : UFGearAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0368   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0370   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0378   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0398   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04C0   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05E8   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0710   (0x0128)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0838   (0x0010)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0848   (0x0048)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0890   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x08B0   (0x0108)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x09B8   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x09E0   (0x0028)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x0A08   (0x00E0)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0AE8   (0x0048)  
	FAnimNode_LookAt                                   AnimGraphNode_LookAt;                                       // 0x0B30   (0x0250)  
	FAnimNode_LookAt                                   AnimGraphNode_LookAt;                                       // 0x0D80   (0x0250)  


	/// Functions
	// Function /Game/Vehicle/Models/sportcar_01/Sportcar_SkeletalMesh_Skeleton_AnimBlueprint.Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/sportcar_01/Sportcar_SkeletalMesh_Skeleton_AnimBlueprint.Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_AE70E7CA45D18AAB1F6375B6DB0BF0C5
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_AE70E7CA45D18AAB1F6375B6DB0BF0C5(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/sportcar_01/Sportcar_SkeletalMesh_Skeleton_AnimBlueprint.Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_48C1725A42F39A5E226FAC9F3152E632
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_48C1725A42F39A5E226FAC9F3152E632(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/sportcar_01/Sportcar_SkeletalMesh_Skeleton_AnimBlueprint.Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_2F92832A4E56F68175588BA71BE060E8
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_2F92832A4E56F68175588BA71BE060E8(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/sportcar_01/Sportcar_SkeletalMesh_Skeleton_AnimBlueprint.Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_5F699D4F4BE825A8E41DCB84DC6AD5FB
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_5F699D4F4BE825A8E41DCB84DC6AD5FB(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/sportcar_01/Sportcar_SkeletalMesh_Skeleton_AnimBlueprint.Sportcar_SkeletalMesh_Skeleton_AnimBlueprint_C.ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint
	void ExecuteUbergraph_Sportcar_SkeletalMesh_Skeleton_AnimBlueprint(int32_t EntryPoint);                                  // [0x2407bf0] Final                
};

/// Class /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C
/// Size: 0x0980 (0x000360 - 0x000CE0)
class UDodgeChellenger__1__Skeleton_AnimBlueprint_C : public UFGearAnimInstance : UFGearAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0368   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0370   (0x0008)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0378   (0x0028)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x03A0   (0x00E0)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0480   (0x0048)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x04C8   (0x0010)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x04D8   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04F8   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0620   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0748   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0870   (0x0128)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0998   (0x0048)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x09E0   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0A00   (0x0108)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x0B08   (0x0028)  
	USkeletalMeshComponent*                            DodgeMesh;                                                  // 0x0B30   (0x0008)  
	FVector                                            L_F_Wheel;                                                  // 0x0B38   (0x0018)  
	FVector                                            R_F_Wheel;                                                  // 0x0B50   (0x0018)  
	FVector                                            L_B_Wheel;                                                  // 0x0B68   (0x0018)  
	FVector                                            R_B_Wheel;                                                  // 0x0B80   (0x0018)  
	FRotator                                           L_F_Wheel_rot;                                              // 0x0B98   (0x0018)  
	FRotator                                           R_F_Wheel_rot;                                              // 0x0BB0   (0x0018)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0BC8   (0x0008)  MISSED
	FTransform                                         NewVar;                                                     // 0x0BD0   (0x0060)  
	FVector                                            Back_Hodovaya_Translation;                                  // 0x0C30   (0x0018)  
	FRotator                                           Back_Hodovaya_Rotation;                                     // 0x0C48   (0x0018)  
	FVector                                            L_B_SuspentionDelta;                                        // 0x0C60   (0x0018)  
	FVector                                            R_B_SuspentionDelta;                                        // 0x0C78   (0x0018)  
	FVector                                            R_F_WheelSuspension_2_Delta;                                // 0x0C90   (0x0018)  
	FVector                                            L_F_WheelSuspension_2_Delta;                                // 0x0CA8   (0x0018)  
	double                                             WheelSteering;                                              // 0x0CC0   (0x0008)  
	FRotator                                           NewRubber_rot;                                              // 0x0CC8   (0x0018)  


	/// Functions
	// Function /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.setSteering
	void setSteering(double Steering, double& NewParam);                                                                     // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.CalculateRubberRotation
	void CalculateRubberRotation(double Steering, FRotator RubberBasePos, FRotator& NewRotation);                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.Wheel_DeltaZ
	void Wheel_DeltaZ(FVector WheelActualPosition, FVector WheelBasePosition, double& DeltaZ);                               // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.CalculateBackHodovaia
	void CalculateBackHodovaia(FVector LeftWheel, FVector RightWheel, FVector& Translation, double& angle);                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.BlueprintBeginPlay
	void BlueprintBeginPlay();                                                                                               // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
	void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_2E7B45B945889C3ED0E7EC9422453C61
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_2E7B45B945889C3ED0E7EC9422453C61(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_C722080D4FFA23F62965C096B58F1F09
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_C722080D4FFA23F62965C096B58F1F09(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_91A5B74B4F028535B5168DBABB10A311
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_91A5B74B4F028535B5168DBABB10A311(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_8241F434490F4EF8852205B22167E081
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_8241F434490F4EF8852205B22167E081(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/Dodge/NewDodge/DodgeChellenger__1__Skeleton_AnimBlueprint.DodgeChellenger__1__Skeleton_AnimBlueprint_C.ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint
	void ExecuteUbergraph_DodgeChellenger__1__Skeleton_AnimBlueprint(int32_t EntryPoint);                                    // [0x2407bf0] Final                
};

/// Class /Game/Vehicle/Models/AdvancedVehicleSystem/Damping_DA/Damping_PDA_AVS.Damping_PDA_AVS_C
/// Size: 0x0040 (0x000030 - 0x000070)
class UDamping_PDA_AVS_C : public UPrimaryDataAsset : UPrimaryDataAsset
{ 
public:
	double                                             Default;                                                    // 0x0030   (0x0008)  
	double                                             Asphalt;                                                    // 0x0038   (0x0008)  
	double                                             Mud;                                                        // 0x0040   (0x0008)  
	double                                             Grass;                                                      // 0x0048   (0x0008)  
	double                                             Snow;                                                       // 0x0050   (0x0008)  
	double                                             Ice;                                                        // 0x0058   (0x0008)  
	double                                             Offroad;                                                    // 0x0060   (0x0008)  
	double                                             FlatTireMultiplier;                                         // 0x0068   (0x0008)  


	/// Functions
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/Damping_DA/Damping_PDA_AVS.Damping_PDA_AVS_C.GetDampingFromSurface
	void GetDampingFromSurface(TEnumAsByte<EPhysicalSurface> Surface, double& LinearDamping);                                // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Vehicle/Models/Tigger/RazdelniiMesh/Tiger_SkeletalMesh_Skeleton_AnimBlueprint.Tiger_SkeletalMesh_Skeleton_AnimBlueprint_C
/// Size: 0x07D0 (0x000360 - 0x000B30)
class UTiger_SkeletalMesh_Skeleton_AnimBlueprint_C : public UFGearAnimInstance : UFGearAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0368   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0370   (0x0008)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0378   (0x0010)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0388   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x03A8   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04D0   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05F8   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0720   (0x0128)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0848   (0x0048)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0890   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x08B0   (0x0108)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x09B8   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x09E0   (0x0028)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x0A08   (0x00E0)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0AE8   (0x0048)  


	/// Functions
	// Function /Game/Vehicle/Models/Tigger/RazdelniiMesh/Tiger_SkeletalMesh_Skeleton_AnimBlueprint.Tiger_SkeletalMesh_Skeleton_AnimBlueprint_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/Tigger/RazdelniiMesh/Tiger_SkeletalMesh_Skeleton_AnimBlueprint.Tiger_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Tiger_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_3EA8CE414091AEFC64AEDB92B3AEE661
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tiger_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_3EA8CE414091AEFC64AEDB92B3AEE661(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/Tigger/RazdelniiMesh/Tiger_SkeletalMesh_Skeleton_AnimBlueprint.Tiger_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Tiger_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_6C82591E4BBE827832566EBD9EF4C675
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tiger_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_6C82591E4BBE827832566EBD9EF4C675(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/Tigger/RazdelniiMesh/Tiger_SkeletalMesh_Skeleton_AnimBlueprint.Tiger_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Tiger_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_05B72DEF4C4A60FD14E7589A89374F6E
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tiger_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_05B72DEF4C4A60FD14E7589A89374F6E(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/Tigger/RazdelniiMesh/Tiger_SkeletalMesh_Skeleton_AnimBlueprint.Tiger_SkeletalMesh_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Tiger_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_B0CF4E3F432164F66AE916A0E171A3D7
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Tiger_SkeletalMesh_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_B0CF4E3F432164F66AE916A0E171A3D7(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/Tigger/RazdelniiMesh/Tiger_SkeletalMesh_Skeleton_AnimBlueprint.Tiger_SkeletalMesh_Skeleton_AnimBlueprint_C.ExecuteUbergraph_Tiger_SkeletalMesh_Skeleton_AnimBlueprint
	void ExecuteUbergraph_Tiger_SkeletalMesh_Skeleton_AnimBlueprint(int32_t EntryPoint);                                     // [0x2407bf0] Final                
};

/// Class /Game/Vehicle/Models/FGearAssets/Sedan/fgSedan_AnimBP.fgSedan_AnimBP_C
/// Size: 0x0508 (0x000360 - 0x000868)
class UfgSedan_AnimBP_C : public UFGearAnimInstance : UFGearAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0368   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0370   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0378   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0398   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04C0   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05E8   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0710   (0x0128)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0838   (0x0010)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0848   (0x0020)  


	/// Functions
	// Function /Game/Vehicle/Models/FGearAssets/Sedan/fgSedan_AnimBP.fgSedan_AnimBP_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2407bf0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/FGearAssets/Sedan/fgSedan_AnimBP.fgSedan_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_fgSedan_AnimBP_AnimGraphNode_ModifyBone_EC077BB84B01871E5EFA129C884A2987
	void EvaluateGraphExposedInputs_ExecuteUbergraph_fgSedan_AnimBP_AnimGraphNode_ModifyBone_EC077BB84B01871E5EFA129C884A2987(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/Sedan/fgSedan_AnimBP.fgSedan_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_fgSedan_AnimBP_AnimGraphNode_ModifyBone_80E010954D7FBAB8426956B7C14663C3
	void EvaluateGraphExposedInputs_ExecuteUbergraph_fgSedan_AnimBP_AnimGraphNode_ModifyBone_80E010954D7FBAB8426956B7C14663C3(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/Sedan/fgSedan_AnimBP.fgSedan_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_fgSedan_AnimBP_AnimGraphNode_ModifyBone_EE30AB6E4406CEB2AA2327A362472CD2
	void EvaluateGraphExposedInputs_ExecuteUbergraph_fgSedan_AnimBP_AnimGraphNode_ModifyBone_EE30AB6E4406CEB2AA2327A362472CD2(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/Sedan/fgSedan_AnimBP.fgSedan_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_fgSedan_AnimBP_AnimGraphNode_ModifyBone_35EEF19B473860CB291E43AC375313F3
	void EvaluateGraphExposedInputs_ExecuteUbergraph_fgSedan_AnimBP_AnimGraphNode_ModifyBone_35EEF19B473860CB291E43AC375313F3(); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/Sedan/fgSedan_AnimBP.fgSedan_AnimBP_C.ExecuteUbergraph_fgSedan_AnimBP
	void ExecuteUbergraph_fgSedan_AnimBP(int32_t EntryPoint);                                                                // [0x2407bf0] Final                
};

/// Class /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C
/// Size: 0x0090 (0x000650 - 0x0006E0)
class AFWD_BP_C : public AFGearVehicle : AFGearVehicle
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0650   (0x0008)  
	USmoothSync*                                       SmoothSync;                                                 // 0x0658   (0x0008)  
	UBoxComponent*                                     Box;                                                        // 0x0660   (0x0008)  
	UFGearEffects*                                     FGearEffects;                                               // 0x0668   (0x0008)  
	UFGearOrbitCamera*                                 FGearOrbitCamera;                                           // 0x0670   (0x0008)  
	FVector                                            StartPos;                                                   // 0x0678   (0x0018)  
	FRotator                                           startRot;                                                   // 0x0690   (0x0018)  
	FVector                                            Force;                                                      // 0x06A8   (0x0018)  
	double                                             yawScale;                                                   // 0x06C0   (0x0008)  
	double                                             pitchScale;                                                 // 0x06C8   (0x0008)  
	double                                             zoomScale;                                                  // 0x06D0   (0x0008)  
	ASurvivalPlayer_C*                                 As_Survival_Player;                                         // 0x06D8   (0x0008)  


	/// Functions
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpActEvt_NumPadTwo_K2Node_InputKeyEvent
	void InpActEvt_NumPadTwo_K2Node_InputKeyEvent(FKey Key);                                                                 // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpActEvt_NumPadTwo_K2Node_InputKeyEvent
	void InpActEvt_NumPadTwo_K2Node_InputKeyEvent(FKey Key);                                                                 // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpActEvt_NumPadEight_K2Node_InputKeyEvent
	void InpActEvt_NumPadEight_K2Node_InputKeyEvent(FKey Key);                                                               // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpActEvt_NumPadEight_K2Node_InputKeyEvent
	void InpActEvt_NumPadEight_K2Node_InputKeyEvent(FKey Key);                                                               // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpActEvt_NumPadOne_K2Node_InputKeyEvent
	void InpActEvt_NumPadOne_K2Node_InputKeyEvent(FKey Key);                                                                 // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpActEvt_NumPadOne_K2Node_InputKeyEvent
	void InpActEvt_NumPadOne_K2Node_InputKeyEvent(FKey Key);                                                                 // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpActEvt_NumPadSeven_K2Node_InputKeyEvent
	void InpActEvt_NumPadSeven_K2Node_InputKeyEvent(FKey Key);                                                               // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpActEvt_NumPadSeven_K2Node_InputKeyEvent
	void InpActEvt_NumPadSeven_K2Node_InputKeyEvent(FKey Key);                                                               // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpActEvt_R_K2Node_InputKeyEvent
	void InpActEvt_R_K2Node_InputKeyEvent(FKey Key);                                                                         // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent
	void InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent(FKey Key);                                                         // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent
	void InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent(FKey Key);                                                         // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpActEvt_RightMouseButton_K2Node_InputKeyEvent
	void InpActEvt_RightMouseButton_K2Node_InputKeyEvent(FKey Key);                                                          // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpActEvt_RightMouseButton_K2Node_InputKeyEvent
	void InpActEvt_RightMouseButton_K2Node_InputKeyEvent(FKey Key);                                                          // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.BndEvt__FWD_BP_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__FWD_BP_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent
	void InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent(float AxisValue);                                             // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpAxisKeyEvt_MouseY_K2Node_InputAxisKeyEvent
	void InpAxisKeyEvt_MouseY_K2Node_InputAxisKeyEvent(float AxisValue);                                                     // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent
	void InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent(float AxisValue);                                                     // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/FGearAssets/VehicleBP/FWD_BP.FWD_BP_C.ExecuteUbergraph_FWD_BP
	void ExecuteUbergraph_FWD_BP(int32_t EntryPoint);                                                                        // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C
/// Size: 0x0998 (0x000650 - 0x000FE8)
class AAVS_VehicleMaster_C : public AFGearVehicle : AFGearVehicle
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0650   (0x0008)  
	UBoxComponent*                                     RoofCollision;                                              // 0x0658   (0x0008)  
	UStaticMeshComponent*                              Cylinder_FR;                                                // 0x0660   (0x0008)  
	UStaticMeshComponent*                              Cylynder_FL;                                                // 0x0668   (0x0008)  
	UStaticMeshComponent*                              Cylinder_BR;                                                // 0x0670   (0x0008)  
	UStaticMeshComponent*                              Cylinder_BL;                                                // 0x0678   (0x0008)  
	USphereComponent*                                  Sphere1_FL;                                                 // 0x0680   (0x0008)  
	UBoxComponent*                                     5WheelDetection;                                            // 0x0688   (0x0008)  
	UBoxComponent*                                     BackwardZombieKillBox;                                      // 0x0690   (0x0008)  
	UBoxComponent*                                     ForwardZombieKillBox;                                       // 0x0698   (0x0008)  
	UBuoyancyComponent*                                Buoyancy;                                                   // 0x06A0   (0x0008)  
	USceneCaptureComponent2D*                          SceneCaptureComponent2D;                                    // 0x06A8   (0x0008)  
	UStaticMeshComponent*                              Background_Plane;                                           // 0x06B0   (0x0008)  
	USmoothSync*                                       SmoothSync;                                                 // 0x06B8   (0x0008)  
	USphereComponent*                                  Sphere3_FR;                                                 // 0x06C0   (0x0008)  
	USphereComponent*                                  Sphere2_BR;                                                 // 0x06C8   (0x0008)  
	USphereComponent*                                  Sphere_BL;                                                  // 0x06D0   (0x0008)  
	USceneComponent*                                   WheelCollision;                                             // 0x06D8   (0x0008)  
	USceneComponent*                                   FixAndFill;                                                 // 0x06E0   (0x0008)  
	USceneComponent*                                   GasPos;                                                     // 0x06E8   (0x0008)  
	USceneComponent*                                   DeadPlace;                                                  // 0x06F0   (0x0008)  
	USceneComponent*                                   EnginePos;                                                  // 0x06F8   (0x0008)  
	UAIPerceptionStimuliSourceComponent*               AIPerceptionStimuliSource;                                  // 0x0700   (0x0008)  
	UStaticMeshComponent*                              DestroyedCar;                                               // 0x0708   (0x0008)  
	USceneComponent*                                   PassengerOut_FR;                                            // 0x0710   (0x0008)  
	USceneComponent*                                   PassengerOut_BR;                                            // 0x0718   (0x0008)  
	USceneComponent*                                   PassengerOut_BL;                                            // 0x0720   (0x0008)  
	USceneComponent*                                   PassengerIn_BR;                                             // 0x0728   (0x0008)  
	USceneComponent*                                   PassengerIn_BL;                                             // 0x0730   (0x0008)  
	USceneComponent*                                   PassengerIn_FR;                                             // 0x0738   (0x0008)  
	USceneComponent*                                   DriverOut;                                                  // 0x0740   (0x0008)  
	USceneComponent*                                   DriverIn;                                                   // 0x0748   (0x0008)  
	USceneComponent*                                   Animation;                                                  // 0x0750   (0x0008)  
	USceneComponent*                                   MainMesh;                                                   // 0x0758   (0x0008)  
	UNiagaraComponent*                                 Tire1;                                                      // 0x0760   (0x0008)  
	UNiagaraComponent*                                 Tire3;                                                      // 0x0768   (0x0008)  
	UNiagaraComponent*                                 Tire2;                                                      // 0x0770   (0x0008)  
	UNiagaraComponent*                                 Tire4;                                                      // 0x0778   (0x0008)  
	USceneComponent*                                   TireVFX;                                                    // 0x0780   (0x0008)  
	USceneComponent*                                   ExhaustHolder1;                                             // 0x0788   (0x0008)  
	USpotLightComponent*                               LightR;                                                     // 0x0790   (0x0008)  
	USpotLightComponent*                               LightL;                                                     // 0x0798   (0x0008)  
	UPointLightComponent*                              BackLightR;                                                 // 0x07A0   (0x0008)  
	UPointLightComponent*                              BackLightL;                                                 // 0x07A8   (0x0008)  
	USceneComponent*                                   Lights;                                                     // 0x07B0   (0x0008)  
	UNiagaraComponent*                                 NiagaraExplosion;                                           // 0x07B8   (0x0008)  
	USceneComponent*                                   ExhaustHolder;                                              // 0x07C0   (0x0008)  
	USceneComponent*                                   VFX;                                                        // 0x07C8   (0x0008)  
	UFMODAudioComponent*                               FMODAudioWheelsLoop;                                        // 0x07D0   (0x0008)  
	UFMODAudioComponent*                               FMODAudioEngineLoop;                                        // 0x07D8   (0x0008)  
	USceneComponent*                                   SFX;                                                        // 0x07E0   (0x0008)  
	UBPC_CarStatsComponent_C*                          BPC_CarStatsComponent;                                      // 0x07E8   (0x0008)  
	USceneComponent*                                   HUD_Interact;                                               // 0x07F0   (0x0008)  
	UCameraComponent*                                  Camera1;                                                    // 0x07F8   (0x0008)  
	UATPCCameraComponent*                              ATPCCamera;                                                 // 0x0800   (0x0008)  
	float                                              Timeline_6_RotationControll_5F2E6D18420419FA2D7BBB833EF90FBB; // 0x0808   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_6__Direction_5F2E6D18420419FA2D7BBB833EF90FBB;     // 0x080C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x080D   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x0810   (0x0008)  
	float                                              Timeline_5_SpeedFading_A50CC48C49B7EF70A4DD95AE64BE7F7D;    // 0x0818   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_5__Direction_A50CC48C49B7EF70A4DD95AE64BE7F7D;     // 0x081C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x081D   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x0820   (0x0008)  
	float                                              Timeline_0_SpeedDrown_18D5FE734F4F85C3E07EF9AFACFAFF00;     // 0x0828   (0x0004)  
	float                                              Timeline_0_DrownCurve_18D5FE734F4F85C3E07EF9AFACFAFF00;     // 0x082C   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_0__Direction_18D5FE734F4F85C3E07EF9AFACFAFF00;     // 0x0830   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0831   (0x0007)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x0838   (0x0008)  
	float                                              Timeline_NewTrack_0_239375CC48E79347A27786BB91854B20;       // 0x0840   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline__Direction_239375CC48E79347A27786BB91854B20;       // 0x0844   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0845   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x0848   (0x0008)  
	TArray<FS_VehicleSit>                              Sits;                                                       // 0x0850   (0x0010)  
	TArray<FName>                                      SitSocketNames;                                             // 0x0860   (0x0010)  
	UFMODEvent*                                        EnterVehicleEvent;                                          // 0x0870   (0x0008)  
	TArray<FName>                                      DoorBoneNames;                                              // 0x0878   (0x0010)  
	bool                                               IsDriving;                                                  // 0x0888   (0x0001)  
	unsigned char                                      UnknownData04_5[0x7];                                       // 0x0889   (0x0007)  MISSED
	TArray<UNiagaraComponent*>                         Exhaust_Loop_NS;                                            // 0x0890   (0x0010)  
	TArray<ASurvivalPlayer_C*>                         PlayersInCar;                                               // 0x08A0   (0x0010)  
	TArray<FName>                                      SeatAnimSocketNames;                                        // 0x08B0   (0x0010)  
	UFMODEvent*                                        ExitVehicleEvent;                                           // 0x08C0   (0x0008)  
	bool                                               EngineStarted;                                              // 0x08C8   (0x0001)  
	TEnumAsByte<E_SitsType>                            SitsType;                                                   // 0x08C9   (0x0001)  
	unsigned char                                      UnknownData05_5[0x6];                                       // 0x08CA   (0x0006)  MISSED
	TArray<USceneComponent*>                           Exhaust_Holder;                                             // 0x08D0   (0x0010)  
	UVehicleSetup_HUD_C*                               DebugHud;                                                   // 0x08E0   (0x0008)  
	UCurveFloat*                                       ExhaustCurve;                                               // 0x08E8   (0x0008)  
	TMap<int32_t, UNiagaraSystem*>                     TireFX;                                                     // 0x08F0   (0x0050)  
	TArray<FName>                                      TireFX_BonesNames;                                          // 0x0940   (0x0010)  
	TArray<UNiagaraComponent*>                         NS_Tires;                                                   // 0x0950   (0x0010)  
	UDebug_FX_widget_C*                                debugFXvidget;                                              // 0x0960   (0x0008)  
	float                                              SpawnRate;                                                  // 0x0968   (0x0004)  
	float                                              SpawnRate_ST;                                               // 0x096C   (0x0004)  
	float                                              SpawnRate_ST2;                                              // 0x0970   (0x0004)  
	float                                              SpawnRate_ST3;                                              // 0x0974   (0x0004)  
	float                                              SpawnRate_ST4;                                              // 0x0978   (0x0004)  
	unsigned char                                      UnknownData06_5[0x4];                                       // 0x097C   (0x0004)  MISSED
	UDamping_PDA_AVS_C*                                Damping_DA;                                                 // 0x0980   (0x0008)  
	ASurvivalPlayer_C*                                 _PlayerToKill;                                              // 0x0988   (0x0008)  
	TArray<USceneComponent*>                           StatickMesh;                                                // 0x0990   (0x0010)  
	UNiagaraSystem*                                    NS_StartExhaust;                                            // 0x09A0   (0x0008)  
	UNiagaraSystem*                                    NS_LoopExhaust;                                             // 0x09A8   (0x0008)  
	FTransform                                         ActualPosition;                                             // 0x09B0   (0x0060)  
	FTransform                                         StartLerpPosition;                                          // 0x0A10   (0x0060)  
	bool                                               StartLerp;                                                  // 0x0A70   (0x0001)  
	unsigned char                                      UnknownData07_5[0x3];                                       // 0x0A71   (0x0003)  MISSED
	float                                              LerpAlpha;                                                  // 0x0A74   (0x0004)  
	int32_t                                            CarIndex;                                                   // 0x0A78   (0x0004)  
	unsigned char                                      UnknownData08_5[0x4];                                       // 0x0A7C   (0x0004)  MISSED
	ASurvivalPlayer_V2_C*                              CarOwner;                                                   // 0x0A80   (0x0008)  
	UAnimMontage*                                      DriverIn_Montage;                                           // 0x0A88   (0x0008)  
	double                                             IgnoreCollisionSpeed;                                       // 0x0A90   (0x0008)  
	UFMODEvent*                                        SecAlarmEvent_Fmod;                                         // 0x0A98   (0x0008)  
	ASurvivalPlayer_V2_C*                              CurrentOwner;                                               // 0x0AA0   (0x0008)  
	float                                              StealingAfterTime;                                          // 0x0AA8   (0x0004)  
	unsigned char                                      UnknownData09_5[0x4];                                       // 0x0AAC   (0x0004)  MISSED
	FTimerHandle                                       StealAfterTimer;                                            // 0x0AB0   (0x0008)  
	UAnimMontage*                                      CarOpenFrontLeftDoor_Montage;                               // 0x0AB8   (0x0008)  
	UAnimMontage*                                      CarOpenFrontRightDoor_Montage;                              // 0x0AC0   (0x0008)  
	UAnimMontage*                                      CarOpenBackLeftDoor_Montage;                                // 0x0AC8   (0x0008)  
	UAnimMontage*                                      CarOpenBackRightDoor_Montage;                               // 0x0AD0   (0x0008)  
	UFMODEvent*                                        dooropen;                                                   // 0x0AD8   (0x0008)  
	UFMODEvent*                                        doorclose;                                                  // 0x0AE0   (0x0008)  
	UFMODEvent*                                        EngineStartFail;                                            // 0x0AE8   (0x0008)  
	UFMODEvent*                                        StartEngineSfx;                                             // 0x0AF0   (0x0008)  
	UFMODEvent*                                        StopEngineSfx;                                              // 0x0AF8   (0x0008)  
	TArray<double>                                     DefWheelRadius;                                             // 0x0B00   (0x0010)  
	TArray<bool>                                       IsOnFlatWheels;                                             // 0x0B10   (0x0010)  
	double                                             AlarmTimer;                                                 // 0x0B20   (0x0008)  
	UFMODAudioComponent*                               HandbrakeSFX;                                               // 0x0B28   (0x0008)  
	double                                             ZombieKillSpeed;                                            // 0x0B30   (0x0008)  
	double                                             ZombieMinBodyImpulseMultiplier;                             // 0x0B38   (0x0008)  
	double                                             ZombieDismembermentSpeed;                                   // 0x0B40   (0x0008)  
	double                                             ZombieMinLimbImpulseMultiplier;                             // 0x0B48   (0x0008)  
	double                                             ZombieMaxBodyImpulseMultiplier;                             // 0x0B50   (0x0008)  
	double                                             ZombieMaxLimbImpulseMultiplier;                             // 0x0B58   (0x0008)  
	double                                             ZImpulseAdjustment;                                         // 0x0B60   (0x0008)  
	double                                             KillPlayerSpeed;                                            // 0x0B68   (0x0008)  
	int32_t                                            Flat_Wheel_Number;                                          // 0x0B70   (0x0004)  
	unsigned char                                      UnknownData10_5[0x4];                                       // 0x0B74   (0x0004)  MISSED
	TArray<ABP_PlayerSpawnPoint_C*>                    Regions;                                                    // 0x0B78   (0x0010)  
	ASurvPC_C*                                         Interacting_PC;                                             // 0x0B88   (0x0008)  
	bool                                               StartTeleport;                                              // 0x0B90   (0x0001)  
	unsigned char                                      UnknownData11_5[0x7];                                       // 0x0B91   (0x0007)  MISSED
	UW_BlackScreen_C*                                  Black_Screen;                                               // 0x0B98   (0x0008)  
	bool                                               InGarage;                                                   // 0x0BA0   (0x0001)  
	unsigned char                                      UnknownData12_5[0x7];                                       // 0x0BA1   (0x0007)  MISSED
	UFMODEvent*                                        TiresBlow_SFX;                                              // 0x0BA8   (0x0008)  
	UAnimMontage*                                      DriverOutMontage;                                           // 0x0BB0   (0x0008)  
	UParticleSystemComponent*                          LFWheel_Particle;                                           // 0x0BB8   (0x0008)  
	UParticleSystemComponent*                          RFWheel_Particle;                                           // 0x0BC0   (0x0008)  
	TArray<ABP_PlayerSpawnPoint_C*>                    CarSpawners;                                                // 0x0BC8   (0x0010)  
	TMap<ABP_PlayerSpawnPoint_C*, int32_t>             SPPlayer;                                                   // 0x0BD8   (0x0050)  
	bool                                               PartyTeleport;                                              // 0x0C28   (0x0001)  
	bool                                               SkipGetOutAnimation;                                        // 0x0C29   (0x0001)  
	bool                                               SkipGetInAnimation;                                         // 0x0C2A   (0x0001)  
	bool                                               AnimationPlayed;                                            // 0x0C2B   (0x0001)  
	unsigned char                                      UnknownData13_5[0x4];                                       // 0x0C2C   (0x0004)  MISSED
	UCurveFloat*                                       KochkaDampingCurve;                                         // 0x0C30   (0x0008)  
	FRotator                                           KuzovRotation;                                              // 0x0C38   (0x0018)  
	ASurvivalPlayer_V2_C*                              TeleportingPlayer;                                          // 0x0C50   (0x0008)  
	bool                                               BlowingTiresTtime;                                          // 0x0C58   (0x0001)  
	bool                                               bBlockInputs;                                               // 0x0C59   (0x0001)  
	unsigned char                                      UnknownData14_5[0x6];                                       // 0x0C5A   (0x0006)  MISSED
	UAnimMontage*                                      Passenger_FR_InMontage;                                     // 0x0C60   (0x0008)  
	UAnimMontage*                                      Passenger_BL_InMontage;                                     // 0x0C68   (0x0008)  
	UAnimMontage*                                      Passenger_BR_InMontage;                                     // 0x0C70   (0x0008)  
	UAnimMontage*                                      Passenger_FR_OutMontage;                                    // 0x0C78   (0x0008)  
	UAnimMontage*                                      Passenger_BL_OutMontage;                                    // 0x0C80   (0x0008)  
	UAnimMontage*                                      Passenger_BR_OutMontage;                                    // 0x0C88   (0x0008)  
	UAnimMontage*                                      CarCloseFrontLeftDoor_Montage;                              // 0x0C90   (0x0008)  
	UAnimMontage*                                      CarCloseFrontRightDoor_Montage;                             // 0x0C98   (0x0008)  
	UAnimMontage*                                      CarCloseBackLeftDoor_Montage;                               // 0x0CA0   (0x0008)  
	UAnimMontage*                                      CarCloseBackRightDoor_Montage;                              // 0x0CA8   (0x0008)  
	UAnimMontage*                                      Idle_FR_Passenger;                                          // 0x0CB0   (0x0008)  
	UAnimMontage*                                      Idle_BL_Passenger;                                          // 0x0CB8   (0x0008)  
	UAnimMontage*                                      Idle_BR_Passenger;                                          // 0x0CC0   (0x0008)  
	UAnimMontage*                                      Idle_Driver;                                                // 0x0CC8   (0x0008)  
	TArray<USceneComponent*>                           DestroyedMesh;                                              // 0x0CD0   (0x0010)  
	float                                              AnimationSpeed;                                             // 0x0CE0   (0x0004)  
	bool                                               KeepPhysicsOn;                                              // 0x0CE4   (0x0001)  
	unsigned char                                      UnknownData15_5[0x3];                                       // 0x0CE5   (0x0003)  MISSED
	FTimerHandle                                       EngineNoiseTimer;                                           // 0x0CE8   (0x0008)  
	UFMODEvent*                                        Destroy_SFX;                                                // 0x0CF0   (0x0008)  
	bool                                               SwitchCoolDown;                                             // 0x0CF8   (0x0001)  
	unsigned char                                      UnknownData16_5[0x7];                                       // 0x0CF9   (0x0007)  MISSED
	TArray<UFGearWheel*>                               AllWheels_arr;                                              // 0x0D00   (0x0010)  
	TArray<FName>                                      WheelBoneName;                                              // 0x0D10   (0x0010)  
	TArray<UNiagaraComponent*>                         ParticlesForRenderTargetMud;                                // 0x0D20   (0x0010)  
	FVector                                            DestroyedLinearImpulse;                                     // 0x0D30   (0x0018)  
	FVector                                            DestroyedAngularImpulse;                                    // 0x0D48   (0x0018)  
	UFMODEvent*                                        HandbrakeOn_SFX;                                            // 0x0D60   (0x0008)  
	FVector                                            TochedWaterLevel_Z;                                         // 0x0D68   (0x0018)  
	FTimerHandle                                       UnderWaterTimer;                                            // 0x0D80   (0x0008)  
	UAnimMontage*                                      FemPassenger_FR_InMontage;                                  // 0x0D88   (0x0008)  
	UAnimMontage*                                      FemPassenger_BL_InMontage;                                  // 0x0D90   (0x0008)  
	UAnimMontage*                                      FemPassenger_BR_InMontage;                                  // 0x0D98   (0x0008)  
	UAnimMontage*                                      FemPassenger_FR_OutMontage;                                 // 0x0DA0   (0x0008)  
	UAnimMontage*                                      FemPassenger_BL_OutMontage;                                 // 0x0DA8   (0x0008)  
	UAnimMontage*                                      FemPassenger_BR_OutMontage;                                 // 0x0DB0   (0x0008)  
	UAnimMontage*                                      FemDriverIn_Montage;                                        // 0x0DB8   (0x0008)  
	UAnimMontage*                                      FemDriverOutMontage;                                        // 0x0DC0   (0x0008)  
	ALandscape*                                        LandscapeReference;                                         // 0x0DC8   (0x0008)  
	APawn*                                             Player;                                                     // 0x0DD0   (0x0008)  
	ASurvivalPlayer_C*                                 As_Survival_Player;                                         // 0x0DD8   (0x0008)  
	double                                             CanExitSpeed;                                               // 0x0DE0   (0x0008)  
	TArray<ALandscapeProxy*>                           LandscapeProxyReference;                                    // 0x0DE8   (0x0010)  
	UTextureRenderTarget2D*                            RenderTarget;                                               // 0x0DF8   (0x0008)  
	TArray<ASurvivalPlayer_C*>                         PlayersInCar_ebaniKostil;                                   // 0x0E00   (0x0010)  
	TArray<bool>                                       AntiKrutitsia;                                              // 0x0E10   (0x0010)  
	UStaticMeshComponent*                              KuzowMesh;                                                  // 0x0E20   (0x0008)  
	UMaterialInstanceDynamic*                          FrontLight_DMI;                                             // 0x0E28   (0x0008)  
	UMaterialInstanceDynamic*                          BackLightDMI;                                               // 0x0E30   (0x0008)  
	bool                                               TouchWater;                                                 // 0x0E38   (0x0001)  
	unsigned char                                      UnknownData17_5[0x7];                                       // 0x0E39   (0x0007)  MISSED
	UCurveFloat*                                       DrownCurve;                                                 // 0x0E40   (0x0008)  
	FVector                                            DrownInitialVelocityAfter;                                  // 0x0E48   (0x0018)  
	bool                                               MeshUnderWater;                                             // 0x0E60   (0x0001)  
	unsigned char                                      UnknownData18_5[0x7];                                       // 0x0E61   (0x0007)  MISSED
	FTimerHandle                                       UnderwaterDrowingCarTimer;                                  // 0x0E68   (0x0008)  
	FVector                                            VehicleUpVecor;                                             // 0x0E70   (0x0018)  
	double                                             DifferenceInWaterLevel;                                     // 0x0E88   (0x0008)  
	double                                             DifferenceInWaterToDie;                                     // 0x0E90   (0x0008)  
	UFMODAudioComponent*                               StealAlarmSiren;                                            // 0x0E98   (0x0008)  
	bool                                               CarAlarmactive;                                             // 0x0EA0   (0x0001)  
	bool                                               OwnerDeadOrDestroyed;                                       // 0x0EA1   (0x0001)  
	TEnumAsByte<CarTipe>                               Car_Tipe;                                                   // 0x0EA2   (0x0001)  
	unsigned char                                      UnknownData19_5[0x1];                                       // 0x0EA3   (0x0001)  MISSED
	float                                              Base_DamageOnHit;                                           // 0x0EA4   (0x0004)  
	float                                              TimeAfterExplode;                                           // 0x0EA8   (0x0004)  
	unsigned char                                      UnknownData20_5[0x4];                                       // 0x0EAC   (0x0004)  MISSED
	FTimerHandle                                       SelfDestroyTimer;                                           // 0x0EB0   (0x0008)  
	float                                              TimeToExplode;                                              // 0x0EB8   (0x0004)  
	unsigned char                                      UnknownData21_5[0x4];                                       // 0x0EBC   (0x0004)  MISSED
	UMaterialInstanceDynamic*                          Dirt_DMI;                                                   // 0x0EC0   (0x0008)  
	float                                              DirtOpacity_DMI;                                            // 0x0EC8   (0x0004)  
	unsigned char                                      UnknownData22_5[0x4];                                       // 0x0ECC   (0x0004)  MISSED
	double                                             DirtGainSpeed;                                              // 0x0ED0   (0x0008)  
	double                                             DirtLoseSpeed;                                              // 0x0ED8   (0x0008)  
	TArray<UMaterialInstanceDynamic*>                  Dirt_DMI_Array;                                             // 0x0EE0   (0x0010)  
	TArray<UMaterialInstance*>                         DirtMats_arr;                                               // 0x0EF0   (0x0010)  
	TArray<UStaticMeshComponent*>                      Door;                                                       // 0x0F00   (0x0010)  
	bool                                               InitialStart;                                               // 0x0F10   (0x0001)  
	unsigned char                                      UnknownData23_5[0x7];                                       // 0x0F11   (0x0007)  MISSED
	double                                             Rear_DefLongitudinalFriction;                               // 0x0F18   (0x0008)  
	double                                             Front_DefLongitudinalFriction;                              // 0x0F20   (0x0008)  
	float                                              Front_LaterallFriction;                                     // 0x0F28   (0x0004)  
	float                                              Rear_LaterallFriction;                                      // 0x0F2C   (0x0004)  
	float                                              Rear_Fx_LateralScale;                                       // 0x0F30   (0x0004)  
	float                                              Front_Fx_LateralScale;                                      // 0x0F34   (0x0004)  
	float                                              Front_Fy_LongitudinalScale;                                 // 0x0F38   (0x0004)  
	float                                              Rear_Fy_LongitudinalScale;                                  // 0x0F3C   (0x0004)  
	float                                              Rear_Def_Fy_LongitudinalScale;                              // 0x0F40   (0x0004)  
	float                                              Front_Def_Fy_LongitudinalScale;                             // 0x0F44   (0x0004)  
	float                                              Front_Def_Fx_LateralScale;                                  // 0x0F48   (0x0004)  
	float                                              Front_DefLateralFriction;                                   // 0x0F4C   (0x0004)  
	float                                              Rear_DefLateralFriction;                                    // 0x0F50   (0x0004)  
	float                                              Rear_Def_Fx_LateralScale;                                   // 0x0F54   (0x0004)  
	float                                              Rear_LongitudinalFriction;                                  // 0x0F58   (0x0004)  
	float                                              Front_LongitudinalFriction;                                 // 0x0F5C   (0x0004)  
	TArray<AActor*>                                    Overlapping_Actors;                                         // 0x0F60   (0x0010)  
	UMaterialInstanceDynamic*                          Wheel_DMI;                                                  // 0x0F70   (0x0008)  
	FVector                                            ZombieHitLocation;                                          // 0x0F78   (0x0018)  
	FVector                                            ZombieHitNormal;                                            // 0x0F90   (0x0018)  
	FTimerHandle                                       KillZombieZeroSpeedTimer;                                   // 0x0FA8   (0x0008)  
	FString                                            OwnerSteamId;                                               // 0x0FB0   (0x0010)  
	bool                                               DontFckngMove;                                              // 0x0FC0   (0x0001)  
	unsigned char                                      UnknownData24_5[0x7];                                       // 0x0FC1   (0x0007)  MISSED
	UFMODAudioComponent*                               WaterWheelFMOD;                                             // 0x0FC8   (0x0008)  
	bool                                               TouchingWater;                                              // 0x0FD0   (0x0001)  
	unsigned char                                      UnknownData25_5[0x7];                                       // 0x0FD1   (0x0007)  MISSED
	TArray<FName>                                      EmergencySocket;                                            // 0x0FD8   (0x0010)  


	/// Functions
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SwitchSits
	void SwitchSits(int32_t DesireSitIndex, AActor* Player);                                                                 // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.IsVehicle
	void IsVehicle(bool& IsVehicle);                                                                                         // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetVehicleBody
	void GetVehicleBody(USkeletalMeshComponent*& Body);                                                                      // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetWheels
	void GetWheels(bool& IsValid, USphereComponent*& LF, USphereComponent*& RF, USphereComponent*& LB, USphereComponent*& RB); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetSteering
	void GetSteering(double& angle);                                                                                         // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetWheelPitches
	void GetWheelPitches(TArray<double>& Pitches);                                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetDriver
	void GetDriver(APawn*& Driver, ASurvivalPlayer_V2_C*& NewParam);                                                         // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetPassengers
	void GetPassengers(APawn*& PassengerFL, APawn*& PassengerBL, APawn*& PassengerBR);                                       // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.HasDriver
	bool HasDriver();                                                                                                        // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetCarStatsComponent
	void GetCarStatsComponent(UBPC_CarStatsComponent_C*& CarStats);                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ExitVehicle
	void ExitVehicle(AActor* Player, bool SkipAnimation, bool SkipExitOnLocation, bool IgnoreSpeedLimits, bool& Success);    // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetEngineStarted
	void GetEngineStarted(bool& Started);                                                                                    // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetIsAccelerating
	void GetIsAccelerating(bool& IsAccelerating);                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SetBoost
	void SetBoost(bool NewBoost, bool& Success);                                                                             // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetBoostInfo
	void GetBoostInfo(double& BoostTime, double& BoostCooldownTime);                                                         // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnFocused
	void OnFocused(APawn* Player, AActor* HighlightActor, UActorComponent* HighlightActorComponent, TEnumAsByte<E_InteractType>& InteractType, double& LateTime); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetActorType
	void GetActorType(TEnumAsByte<E_ActorType>& ActorType);                                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.IsLocked?
	void IsLocked?(bool& Result);                                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.CheckOneSits
	void CheckOneSits(int32_t Dimension 1, TArray<AActor*>& ActorsToIgnore, TArray<FName>& SocketArray, bool& bLock);        // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.AfterExitSurv
	void AfterExitSurv(AActor* Surv);                                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ChekIfStillOverlapWater
	void ChekIfStillOverlapWater(TArray<AActor*>& TargetArray, bool& StillOverlap);                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.KillUnderWater
	void KillUnderWater();                                                                                                   // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.IsUnderWater
	bool IsUnderWater(double WaterZlevel);                                                                                   // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ReroutePlayerIndex
	void ReroutePlayerIndex(APawn* Player, int32_t SitIndex, bool SkipAnimation, APawn*& Surv, int32_t& NewSitIndex, bool& SkipAnim, bool& Allow?); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.AnySitsEmpty
	void AnySitsEmpty(bool& Zaebis1, int32_t& EmptyIndex1);                                                                  // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.CheckZombieKill
	void CheckZombieKill(UObject* Object, FHitResult& hit);                                                                  // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.RemovePlayerFromCarOnLogOut
	void RemovePlayerFromCarOnLogOut(ASurvivalPlayer_C*& Surv);                                                              // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ChekIfStillUnderWater
	void ChekIfStillUnderWater(bool& StillUnderWater);                                                                       // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SetVariablesOnExplode
	void SetVariablesOnExplode();                                                                                            // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.DestroySelfWhenTimerOut
	void DestroySelfWhenTimerOut();                                                                                          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Destroy Car when Nosurv InRange Of
	void Destroy Car when Nosurv InRange Of(TArray<ASurvivalPlayer_C*>& Array, double Radius);                               // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OwnerDeathOrDestroy
	void OwnerDeathOrDestroy(bool OwnerDeadOrDestroyed);                                                                     // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.CheckForWheelNotTouckWhileUnderWater
	void CheckForWheelNotTouckWhileUnderWater();                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.CheckForUnderWater
	void CheckForUnderWater();                                                                                               // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Add Impulse On Destroy
	void Add Impulse On Destroy();                                                                                           // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnRep_bBlockInputs
	void OnRep_bBlockInputs();                                                                                               // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Check Player Neer Gas
	void Check Player Neer Gas(ASurvivalPlayer_C* Player, bool& PlayerNeerGas);                                              // [0x2407bf0] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Check Player Neer Engine
	void Check Player Neer Engine(ASurvivalPlayer_C* Player, bool& PlayerNeerEngine);                                        // [0x2407bf0] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.AnyWheelHasContact
	void AnyWheelHasContact(bool& hasContact);                                                                               // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetCurrentSpeed
	void GetCurrentSpeed(float& CurrentSpeedKMH);                                                                            // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ExitCarOnInterrupt
	void ExitCarOnInterrupt(int32_t SitIndex, AActor* Player);                                                               // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.HasCorrectExitRotation
	bool HasCorrectExitRotation();                                                                                           // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.AllowStabilizeVehicle
	void AllowStabilizeVehicle(bool& allow);                                                                                 // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.StabilizeVehicleUpdate
	void StabilizeVehicleUpdate();                                                                                           // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.MakeSpeedDependentNoise
	void MakeSpeedDependentNoise();                                                                                          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SetupCarNoiseTimer
	void SetupCarNoiseTimer(bool Enable);                                                                                    // [0x2407bf0] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SetSurvIdleAnimation
	void SetSurvIdleAnimation(ASurvivalPlayer_C* SurvivalPlayer, bool InCar, bool Driver, int32_t SitIndex);                 // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetCarTipe
	void GetCarTipe(TEnumAsByte<CarTipe>& CarTipe);                                                                          // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ShowHideDestroyed Mesh
	void ShowHideDestroyed Mesh(bool Hide);                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SetCarDestroyed
	void SetCarDestroyed();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Show_Hide All Mesh
	void Show_Hide All Mesh(bool Hide);                                                                                      // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetSurfaceDelayMultiplier
	void GetSurfaceDelayMultiplier(TEnumAsByte<EPhysicalSurface> SurfaceType, float& PhysMatMultiplier);                     // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetSurfaceAmplitudeMultiplier
	void GetSurfaceAmplitudeMultiplier(TEnumAsByte<EPhysicalSurface> SurfaceType, float& PhysMatMultiplier);                 // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Teleporting Logic
	void Teleporting Logic(UClass*& CarClass, FTransform& CarTrans);                                                         // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.IsPartyMember
	bool IsPartyMember();                                                                                                    // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.IsInViewport
	bool IsInViewport();                                                                                                     // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.CalculateFlat Wheel Number
	void CalculateFlat Wheel Number(int32_t& FlatWheelNumber);                                                               // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.LinearDampingFromFlatTires
	void LinearDampingFromFlatTires(double InputPin, UDamping_PDA_AVS_C* DampingDA, int32_t FlatWheelsNumber, double& OutputPin); // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.IsPlayerOwner_OrTeamMate
	void IsPlayerOwner_OrTeamMate(APawn* Player, bool& Owner/Teammate);                                                      // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.FixAllWheels
	void FixAllWheels();                                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.FlatWheelEnable
	void FlatWheelEnable(int32_t WheelIndex, int32_t CarIndex);                                                              // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SetStatBeforeSave
	void SetStatBeforeSave(ASurvivalPlayer_C* CarOwner, double Fuel, double Durablility, int32_t CarIndex, TArray<FString>& Stats); // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.AfterStealReturnToOwner
	void AfterStealReturnToOwner();                                                                                          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SetStatInArray
	void SetStatInArray(TArray<double>& FuelStat, TArray<double>& DurabilityStat, double Fuel, double Durablility, int32_t CarIndex, TArray<double>& FuelStats, TArray<double>& DurabilityStats); // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.CodeCarsStat
	void CodeCarsStat(TArray<double>& Fuel, TArray<double>& Durability, TArray<FString>& Stats);                             // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.EncodeCarsStat
	void EncodeCarsStat(TArray<FString>& Stats, TArray<double>& Fuel, TArray<double>& Durability);                           // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Car StatDecodeAndSet
	void Car StatDecodeAndSet(ASurvivalPlayer_V2_C* CarsOwner);                                                              // [0x2407bf0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetOutAllPlayersInCar
	void GetOutAllPlayersInCar();                                                                                            // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.WheelLastTouchSurface
	TEnumAsByte<EPhysicalSurface> WheelLastTouchSurface(UFGearWheel* Wheel);                                                 // [0x2407bf0] Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.DEBUG_SetFXSpawnRate
	void DEBUG_SetFXSpawnRate(float SpawnRate, float SpawnRate_ST, float SpawnRate_ST2, float SpawnRate_ST3, float SpawnRate_ST4); // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SpawnNiagaraFX
	UNiagaraComponent* SpawnNiagaraFX(USceneComponent* SkeletalMesh, UNiagaraSystem* SystemTemplate, FName AttachPointName, FVector Location, FRotator Rotation); // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetTireVFX
	void GetTireVFX(TEnumAsByte<EPhysicalSurface> Index, UNiagaraSystem*& NiagaraFX, bool& Succes);                          // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.CheckPlayerSits
	void CheckPlayerSits(ASurvivalPlayer_C* Player, bool& CanEnter, int32_t& SitIndex);                                      // [0x2407bf0] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ServerExitVehicleAsPassenger
	void ServerExitVehicleAsPassenger(ASurvivalPlayer_C* Player, bool SkipExitOnLocation);                                   // [0x2407bf0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnRep_EngineStarted
	void OnRep_EngineStarted();                                                                                              // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ServerExitVehicleAsDriver
	void ServerExitVehicleAsDriver(ASurvivalPlayer_C* Player, bool SkipExitOnLocation);                                      // [0x2407bf0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.CarIsEmpty
	void CarIsEmpty(bool& Empty);                                                                                            // [0x2407bf0] Private|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ClientsExitVehicleAsPassenger
	void ClientsExitVehicleAsPassenger(ASurvivalPlayer_C* Player, bool SkipExitOnLocation);                                  // [0x2407bf0] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ClientsExitVehicleAsDriver
	void ClientsExitVehicleAsDriver(ASurvivalPlayer_C* Player, bool SkipExitOnLocation);                                     // [0x2407bf0] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.GetExitPoint
	void GetExitPoint(int32_t SitIndex, AActor* Player, FVector& Location, bool& CorrectLocation, bool& YouCantExit);        // [0x2407bf0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.EnterVehicle
	void EnterVehicle(ASurvivalPlayer_C* Player, int32_t SitIndex, bool FromRancho);                                         // [0x2407bf0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ServerEnterVehicleAsPassenger
	void ServerEnterVehicleAsPassenger(ASurvivalPlayer_C* Player, int32_t SitIndex);                                         // [0x2407bf0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ClientsEnterVehicleAsPassenger
	void ClientsEnterVehicleAsPassenger(ASurvivalPlayer_C* Player, int32_t SitIndex);                                        // [0x2407bf0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnRep_IsDriving
	void OnRep_IsDriving();                                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ServerEnterVehicleAsDriver
	void ServerEnterVehicleAsDriver(ASurvivalPlayer_C* Player, bool FromRancho);                                             // [0x2407bf0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ClientsEnterVehicleAsDriver
	void ClientsEnterVehicleAsDriver(ASurvivalPlayer_C* Player);                                                             // [0x2407bf0] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SetVehicleSit
	void SetVehicleSit(int32_t Index, bool Item Is Busy, APawn* Item Sitter);                                                // [0x2407bf0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnRep_Sits
	void OnRep_Sits();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ShowWidgets
	void ShowWidgets(bool CanEnter, ASurvivalPlayer_C* Player);                                                              // [0x2407bf0] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x2407bf0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Timeline__FinishedFunc
	void Timeline__FinishedFunc();                                                                                           // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Timeline__UpdateFunc
	void Timeline__UpdateFunc();                                                                                             // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Timeline_6__FinishedFunc
	void Timeline_6__FinishedFunc();                                                                                         // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Timeline_6__UpdateFunc
	void Timeline_6__UpdateFunc();                                                                                           // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Timeline_5__FinishedFunc
	void Timeline_5__FinishedFunc();                                                                                         // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Timeline_5__UpdateFunc
	void Timeline_5__UpdateFunc();                                                                                           // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Timeline_0__FinishedFunc
	void Timeline_0__FinishedFunc();                                                                                         // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Timeline_0__UpdateFunc
	void Timeline_0__UpdateFunc();                                                                                           // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.InpActEvt_TurnEngine_K2Node_InputActionEvent
	void InpActEvt_TurnEngine_K2Node_InputActionEvent(FKey Key);                                                             // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.InpActEvt_Use/Interact_K2Node_InputActionEvent
	void InpActEvt_Use/Interact_K2Node_InputActionEvent(FKey Key);                                                           // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnNotifyEnd_74EEDDDE40927650F01D18B3256F472C
	void OnNotifyEnd_74EEDDDE40927650F01D18B3256F472C(FName NotifyName);                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnNotifyBegin_74EEDDDE40927650F01D18B3256F472C
	void OnNotifyBegin_74EEDDDE40927650F01D18B3256F472C(FName NotifyName);                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnInterrupted_74EEDDDE40927650F01D18B3256F472C
	void OnInterrupted_74EEDDDE40927650F01D18B3256F472C(FName NotifyName);                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnBlendOut_74EEDDDE40927650F01D18B3256F472C
	void OnBlendOut_74EEDDDE40927650F01D18B3256F472C(FName NotifyName);                                                      // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnCompleted_74EEDDDE40927650F01D18B3256F472C
	void OnCompleted_74EEDDDE40927650F01D18B3256F472C(FName NotifyName);                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.InpActEvt_TurnLights_K2Node_InputActionEvent
	void InpActEvt_TurnLights_K2Node_InputActionEvent(FKey Key);                                                             // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_Sphere2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__AVS_VehicleMaster_Sphere2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__AVS_VehicleMaster_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_Sphere3_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__AVS_VehicleMaster_Sphere3_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ResetWaterOverlap
	void ResetWaterOverlap();                                                                                                // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.InpAxisEvt_Turn_K2Node_InputAxisEvent
	void InpAxisEvt_Turn_K2Node_InputAxisEvent(float AxisValue);                                                             // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.InpAxisEvt_LookUp_K2Node_InputAxisEvent
	void InpAxisEvt_LookUp_K2Node_InputAxisEvent(float AxisValue);                                                           // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__AVS_VehicleMaster_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.MulticallEnterVehicleAsDriver
	void MulticallEnterVehicleAsDriver(ASurvivalPlayer_C* Player, bool FromRancho);                                          // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.MulticallEnterVehicleAsPassenger
	void MulticallEnterVehicleAsPassenger(ASurvivalPlayer_C* Player, int32_t SitIndex);                                      // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.MultiCallExitVehicleAsDriver
	void MultiCallExitVehicleAsDriver(ASurvivalPlayer_C* Player, bool SkipExitOnLocation);                                   // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.MultiCallExitVehicleAsPassenger
	void MultiCallExitVehicleAsPassenger(ASurvivalPlayer_C* Player, bool SkipExitOnLocation);                                // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
	void BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(UPrimitiveComponent* HitComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, FVector NormalImpulse, FHitResult& hit); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.InpAxisEvt_ForwardThrottle_K2Node_InputAxisEvent
	void InpAxisEvt_ForwardThrottle_K2Node_InputAxisEvent(float AxisValue);                                                  // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.InpAxisEvt_SteeringWheels_K2Node_InputAxisEvent
	void InpAxisEvt_SteeringWheels_K2Node_InputAxisEvent(float AxisValue);                                                   // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ServerCallExitVehicle
	void ServerCallExitVehicle(AActor* Player, bool SkipAnimation);                                                          // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnInteractVehicle
	void OnInteractVehicle(APawn* Player, int32_t SitIndex, bool SkipAnimation);                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.DriverGetInCar
	void DriverGetInCar(APawn* Player, int32_t SitIndex, bool SkipAnimation);                                                // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.StealCar
	void StealCar(APawn* CarStealer);                                                                                        // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SetStealAfterTimer
	void SetStealAfterTimer();                                                                                               // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.DoorAnimation
	void DoorAnimation(int32_t SitIndex, bool Open);                                                                         // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.DriverGetOutCar
	void DriverGetOutCar(ASurvivalPlayer_C* Player, int32_t SitIndex, bool SkipAnimation, bool SkipExitOnLocation);          // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.PassengerGetInCar
	void PassengerGetInCar(APawn* Player, int32_t SitIndex, bool SkipAnimation);                                             // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.PassengerGetOutCar
	void PassengerGetOutCar(ASurvivalPlayer_C* Player, int32_t SitIndex, bool SkipAnimation, bool SkipExitOnLocation);       // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature
	void BndEvt__AVS_VehicleMaster_mMesh_K2Node_ComponentBoundEvent_6_ComponentEndOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.PlayPassengerIdleAnim
	void PlayPassengerIdleAnim(ASurvivalPlayer_C* Surv, int32_t SitIndex);                                                   // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.PlayDriverIdleAnim
	void PlayDriverIdleAnim(ASurvivalPlayer_C* Surv);                                                                        // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SetHighlightedCarWithDelay
	void SetHighlightedCarWithDelay(float Delay, ASurvivalPlayer_C* Surv);                                                   // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_ChangeCollisionWithDelay
	void multi_ChangeCollisionWithDelay(double Delay, TEnumAsByte<ECollisionChannel> Channel, TEnumAsByte<ECollisionResponse> NewResponse); // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.serv_SwitchSits
	void serv_SwitchSits(int32_t DesireSitIndex, AActor* Player);                                                            // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_SetSurvIdleAnimation
	void multi_SetSurvIdleAnimation(ASurvivalPlayer_C* SurvivalPlayer, bool InCar, bool Driver, int32_t SitIndex);           // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_ResetSurvRotation
	void multi_ResetSurvRotation(int32_t SitIndex, ASurvivalPlayer_C* SurvivalPlayer);                                       // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_SetPassengerCameraMode
	void multi_SetPassengerCameraMode(ASurvivalPlayer_C* Surv);                                                              // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_EnableSmoothSync
	void multi_EnableSmoothSync(ASurvivalPlayer_C* Target, bool NewEnable);                                                  // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.InpAxisEvt_HandbrakeAxis_K2Node_InputAxisEvent
	void InpAxisEvt_HandbrakeAxis_K2Node_InputAxisEvent(float AxisValue);                                                    // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Serv_BlockInputs
	void Serv_BlockInputs(bool bBlockInputs);                                                                                // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.serv_ToggleSwitchSitsCD
	void serv_ToggleSwitchSitsCD(bool SwitchCoolDown, float Duration);                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.serv_TurnLight
	void serv_TurnLight(bool Visibility);                                                                                    // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_TurnLight
	void multi_TurnLight(bool Visibility);                                                                                   // [0x2407bf0] Net|NetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_HitZombieSFX
	void multi_HitZombieSFX(FVector Location Location);                                                                      // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.FCKNGDELAY
	void FCKNGDELAY(float Duration);                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ENDFCKNGDELAY
	void ENDFCKNGDELAY();                                                                                                    // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.flashlight
	void flashlight();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_Uncrouch
	void multi_Uncrouch(ASurvivalPlayer_V2_C* Target);                                                                       // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnSimulatedPhysicsChanged
	void OnSimulatedPhysicsChanged(bool IsEnabled);                                                                          // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.TurnEngine
	void TurnEngine();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ServerCallSetEngineStarted
	void ServerCallSetEngineStarted(bool EngineStarted);                                                                     // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.TeleportInteract
	void TeleportInteract(APawn* Player);                                                                                    // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__AVS_VehicleMaster_Cylinder_FR_K2Node_ComponentBoundEvent_14_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__AVS_VehicleMaster_Cylinder_BR_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__AVS_VehicleMaster_Cylynder_FL_K2Node_ComponentBoundEvent_10_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__AVS_VehicleMaster_Cylinder_BL_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.EngineTurnOn
	void EngineTurnOn();                                                                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.EngineTurnOff
	void EngineTurnOff();                                                                                                    // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.FuelEnd
	void FuelEnd();                                                                                                          // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.DestroyInteractable
	void DestroyInteractable();                                                                                              // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SetTutorial3DWidgetVisibility
	void SetTutorial3DWidgetVisibility(bool Visible);                                                                        // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.DurabilityEnd
	void DurabilityEnd();                                                                                                    // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.MultiCallDecreaseDurability
	void MultiCallDecreaseDurability(double Damage);                                                                         // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ReceiveAnyDamage
	void ReceiveAnyDamage(float Damage, UDamageType* DamageType, AController* InstigatedBy, AActor* DamageCauser);           // [0x2407bf0] BlueprintAuthorityOnly|Event|Public|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Set3DWidgetVisibility
	void Set3DWidgetVisibility(bool Visible);                                                                                // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnSquadCheckComplete
	void OnSquadCheckComplete();                                                                                             // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Run Lockpicking
	void Run Lockpicking();                                                                                                  // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnLostFocus
	void OnLostFocus(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.serv_SetReplication
	void serv_SetReplication(bool Replicate);                                                                                // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_SetReplication
	void multi_SetReplication(bool Replicate);                                                                               // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnStopInteract
	void OnStopInteract(APawn* Player);                                                                                      // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.Repair
	void Repair();                                                                                                           // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.FillGas
	void FillGas();                                                                                                          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnBeginInteract
	void OnBeginInteract(APawn* Player);                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnSeen
	void OnSeen(APawn* Player);                                                                                              // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.serv_FlatWheelsEnable
	void serv_FlatWheelsEnable(int32_t WheelIndex);                                                                          // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_FlatWheelsEnable
	void multi_FlatWheelsEnable(int32_t WheelIndex);                                                                         // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnLocalInteract
	void OnLocalInteract(APawn* Player);                                                                                     // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnInteract3
	void OnInteract3(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.DestroyWithSave
	void DestroyWithSave();                                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnInteract2
	void OnInteract2(APawn* Player);                                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnInteract
	void OnInteract(APawn* Player);                                                                                          // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnLevelLoaded
	void OnLevelLoaded(FName Level, AActor* Player);                                                                         // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnLevelUnloaded
	void OnLevelUnloaded(FName Level, AActor* Player);                                                                       // [0x2407bf0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.AttachDoorToBone
	void AttachDoorToBone();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.AttachDoorToMainMesh
	void AttachDoorToMainMesh();                                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.serv_ResetCameraPos
	void serv_ResetCameraPos(ASurvivalPlayer_C* Surv);                                                                       // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_ResetCameraPos
	void multi_ResetCameraPos(ASurvivalPlayer_C* Surv);                                                                      // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.serv_CollisionInCar
	void serv_CollisionInCar();                                                                                              // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_CollisionInCar
	void multi_CollisionInCar();                                                                                             // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_FixAllWheels
	void multi_FixAllWheels();                                                                                               // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SetPhysicsAfterDelay
	void SetPhysicsAfterDelay(double Delay, bool NewEnable);                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ActivateNiagaraExplosion
	void ActivateNiagaraExplosion();                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SurvResetRelativePos
	void SurvResetRelativePos();                                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.serv_ApplyDamage
	void serv_ApplyDamage(float BaseDamage);                                                                                 // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BindOnSurvDeathAndDestroy
	void BindOnSurvDeathAndDestroy(ASurvivalPlayer_V2_C* Surv);                                                              // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnDeath
	void OnDeath();                                                                                                          // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnDestroy
	void OnDestroy(AActor* DestroyedActor);                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.StartSelfDestroyTimer
	void StartSelfDestroyTimer();                                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SurvPlayerLogOut
	void SurvPlayerLogOut(ASurvivalPlayer_C* SurvivalPlayer);                                                                // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.OnEvaquatedW/oCar
	void OnEvaquatedW/oCar();                                                                                                // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.serv_TakenDamage
	void serv_TakenDamage(ASurvivalPlayer_C* Surv, double Damage, bool DontAnimate, bool EffectDamage, bool HungerDamage);   // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.TakedDamageServer
	void TakedDamageServer(double Damage, FVector DDLocation, FName BoneName, FVector HitLocation, bool DontAnimate, APawn* Killer, bool IsRadialDamage, bool IsFireDamage, double DistanceToExplosion, AActor* DamageCauser, bool StaminaDecrease, bool Zombie?, TEnumAsByte<BPE_AmmoClass> AmmoClass, UNegativeEffectDamageType NegativeEffectDamageType); // [0x2407bf0] Net|NetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.TakedDamageClient
	void TakedDamageClient(double Damage, FVector DDLocation, FName BoneName, FVector HitLocation, bool DontAnimate, APawn* Killer, bool IsRadialDamage, bool IsFireDamage, double DistanceToExplosion, AActor* DamageCauser, bool StaminaDecrease, bool Zombie?, TEnumAsByte<BPE_AmmoClass> AmmoClass, UNegativeEffectDamageType NegativeEffectDamageType); // [0x2407bf0] Net|NetClient|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.RunSetAnimFromCar
	void RunSetAnimFromCar(ASurvivalPlayer_C* Target, bool InCar, bool Driver, TEnumAsByte<CarTipe> CarTipe, int32_t SitIndex); // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.CompareSteamIdtoOwner
	void CompareSteamIdtoOwner(FString SteamID, ASurvivalPlayer_V2_C* survRef);                                              // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.UnbindsCarOwner
	void UnbindsCarOwner();                                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.debugtraceMulti
	void debugtraceMulti(FVector NewParam);                                                                                  // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ChangeViewTargetWithDelay
	void ChangeViewTargetWithDelay(double Delay, APawn* NewViewTarget, bool Exit);                                           // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.KillAllPrint
	void KillAllPrint(TArray<ASurvivalPlayer_C*>& InputPin);                                                                 // [0x2407bf0] Net|NetReliableNetMulticast|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multo_SetReplicateMovement
	void multo_SetReplicateMovement(AActor* Target, bool bInReplicateMovement);                                              // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.KillPlayersAndDropOut
	void KillPlayersAndDropOut();                                                                                            // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.SetActorToPelvisLocation
	void SetActorToPelvisLocation(ASurvivalPlayer_C* PlayerToKill);                                                          // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_PhysicsToggle
	void multi_PhysicsToggle(bool NewEnable);                                                                                // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.serv_PhysicsToggle
	void serv_PhysicsToggle(bool NewEnable);                                                                                 // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.multi_RPClocation
	void multi_RPClocation(FVector Location);                                                                                // [0x2407bf0] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.serv_RPClocation
	void serv_RPClocation(FTransform Location);                                                                              // [0x2407bf0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ResetDoOnce_TogglePhysics
	void ResetDoOnce_TogglePhysics();                                                                                        // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.CaptureCarTrail
	void CaptureCarTrail();                                                                                                  // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.StopCaptureCarTrail
	void StopCaptureCarTrail();                                                                                              // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.StartCaptureCarTrail
	void StartCaptureCarTrail();                                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature
	void BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_8_ComponentEndOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x2407bf0] BlueprintEvent       
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__AVS_VehicleMaster_5WheelDetection_K2Node_ComponentBoundEvent_7_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2407bf0] HasOutParms|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.StartDrowingVehicle
	void StartDrowingVehicle();                                                                                              // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ResetOnOther
	void ResetOnOther();                                                                                                     // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ResetOnMud
	void ResetOnMud();                                                                                                       // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.CheckZombieZeroSpeedKill
	void CheckZombieZeroSpeedKill();                                                                                         // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_VehicleMaster.AVS_VehicleMaster_C.ExecuteUbergraph_AVS_VehicleMaster
	void ExecuteUbergraph_AVS_VehicleMaster(int32_t EntryPoint);                                                             // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Tiger.AVS_Tiger_C
/// Size: 0x00A8 (0x000FE8 - 0x001090)
class AAVS_Tiger_C : public AAVS_VehicleMaster_C : AAVS_VehicleMaster_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0FE8   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC1;                                          // 0x0FF0   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC;                                           // 0x0FF8   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC3;                                          // 0x1000   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC2;                                          // 0x1008   (0x0008)  
	UStaticMeshComponent*                              Tiger_Back;                                                 // 0x1010   (0x0008)  
	UStaticMeshComponent*                              Tiger_Hood;                                                 // 0x1018   (0x0008)  
	UStaticMeshComponent*                              Tiger_DoorFL;                                               // 0x1020   (0x0008)  
	UStaticMeshComponent*                              Tiger_DoorBR;                                               // 0x1028   (0x0008)  
	UStaticMeshComponent*                              Tiger_DoorBL;                                               // 0x1030   (0x0008)  
	UStaticMeshComponent*                              Tiger_DoorFR;                                               // 0x1038   (0x0008)  
	UStaticMeshComponent*                              Tiger_Door_FL_Door_FL_window;                               // 0x1040   (0x0008)  
	UStaticMeshComponent*                              Tiger_Door_FR_Door_FR_window;                               // 0x1048   (0x0008)  
	UStaticMeshComponent*                              Tiger_Door_BR_Door_BR_window;                               // 0x1050   (0x0008)  
	UStaticMeshComponent*                              Tiger_Door_BL_Door_BL_window;                               // 0x1058   (0x0008)  
	UStaticMeshComponent*                              Tiger_Kabina_Kabina_windows;                                // 0x1060   (0x0008)  
	UStaticMeshComponent*                              Tiger_Kabina_Kabina;                                        // 0x1068   (0x0008)  
	UStaticMeshComponent*                              Tiger_Door_FR_Door_FR;                                      // 0x1070   (0x0008)  
	UStaticMeshComponent*                              Tiger_Door_FL_Door_FL;                                      // 0x1078   (0x0008)  
	UStaticMeshComponent*                              Tiger_Door_BR_Door_BR;                                      // 0x1080   (0x0008)  
	UStaticMeshComponent*                              Tiger_Door_BL_Door_BL;                                      // 0x1088   (0x0008)  


	/// Functions
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Tiger.AVS_Tiger_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x2407bf0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Tiger.AVS_Tiger_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Tiger.AVS_Tiger_C.AttachDoorToMainMesh
	void AttachDoorToMainMesh();                                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Tiger.AVS_Tiger_C.AttachDoorToBone
	void AttachDoorToBone();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Tiger.AVS_Tiger_C.ExecuteUbergraph_AVS_Tiger
	void ExecuteUbergraph_AVS_Tiger(int32_t EntryPoint);                                                                     // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_TestCar.AVS_TestCar_C
/// Size: 0x0068 (0x000FE8 - 0x001050)
class AAVS_TestCar_C : public AAVS_VehicleMaster_C : AAVS_VehicleMaster_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0FE8   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC3;                                          // 0x0FF0   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC2;                                          // 0x0FF8   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC1;                                          // 0x1000   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC;                                           // 0x1008   (0x0008)  
	UStaticMeshComponent*                              DodgeChellenger_Body_Window;                                // 0x1010   (0x0008)  
	UStaticMeshComponent*                              DodgeChellenger_DoorL_Window;                               // 0x1018   (0x0008)  
	UStaticMeshComponent*                              DodgeChellenger_DoorR_Window;                               // 0x1020   (0x0008)  
	UStaticMeshComponent*                              DodgeChellenger_DoorR;                                      // 0x1028   (0x0008)  
	UStaticMeshComponent*                              DodgeChellenger_DoorL;                                      // 0x1030   (0x0008)  
	UStaticMeshComponent*                              DodgeChellenger_Body;                                       // 0x1038   (0x0008)  
	UStaticMeshComponent*                              Dodge_Burned_DoorR;                                         // 0x1040   (0x0008)  
	UStaticMeshComponent*                              Dodge_Burned_DoorL;                                         // 0x1048   (0x0008)  


	/// Functions
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_TestCar.AVS_TestCar_C.SetBoost
	void SetBoost(bool NewBoost, bool& Success);                                                                             // [0x2407bf0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_TestCar.AVS_TestCar_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x2407bf0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_TestCar.AVS_TestCar_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_TestCar.AVS_TestCar_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_TestCar.AVS_TestCar_C.AttachDoorToBone
	void AttachDoorToBone();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_TestCar.AVS_TestCar_C.AttachDoorToMainMesh
	void AttachDoorToMainMesh();                                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_TestCar.AVS_TestCar_C.GearChanged
	void GearChanged(int32_t PreviousGear, int32_t CurrentGear);                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_TestCar.AVS_TestCar_C.ExecuteUbergraph_AVS_TestCar
	void ExecuteUbergraph_AVS_TestCar(int32_t EntryPoint);                                                                   // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Sportcar.AVS_Sportcar_C
/// Size: 0x0058 (0x000FE8 - 0x001040)
class AAVS_Sportcar_C : public AAVS_VehicleMaster_C : AAVS_VehicleMaster_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0FE8   (0x0008)  
	UStaticMeshComponent*                              Sportcar_Burned_DoorR;                                      // 0x0FF0   (0x0008)  
	UStaticMeshComponent*                              Sportcar_Burned_DoorL;                                      // 0x0FF8   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC;                                           // 0x1000   (0x0008)  
	UStaticMeshComponent*                              Sportcar_Back_Window;                                       // 0x1008   (0x0008)  
	UStaticMeshComponent*                              Sportcar_Forward_Window;                                    // 0x1010   (0x0008)  
	UStaticMeshComponent*                              R_Door_Window;                                              // 0x1018   (0x0008)  
	UStaticMeshComponent*                              L_Door_Window;                                              // 0x1020   (0x0008)  
	UStaticMeshComponent*                              L_Door;                                                     // 0x1028   (0x0008)  
	UStaticMeshComponent*                              R_Door;                                                     // 0x1030   (0x0008)  
	UStaticMeshComponent*                              Sportcar_StaticMesh;                                        // 0x1038   (0x0008)  


	/// Functions
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Sportcar.AVS_Sportcar_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x2407bf0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Sportcar.AVS_Sportcar_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Sportcar.AVS_Sportcar_C.AttachDoorToBone
	void AttachDoorToBone();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Sportcar.AVS_Sportcar_C.AttachDoorToMainMesh
	void AttachDoorToMainMesh();                                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Sportcar.AVS_Sportcar_C.GearChanged
	void GearChanged(int32_t PreviousGear, int32_t CurrentGear);                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Sportcar.AVS_Sportcar_C.ExecuteUbergraph_AVS_Sportcar
	void ExecuteUbergraph_AVS_Sportcar(int32_t EntryPoint);                                                                  // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Lugatti.AVS_Lugatti_C
/// Size: 0x0038 (0x000FE8 - 0x001020)
class AAVS_Lugatti_C : public AAVS_VehicleMaster_C : AAVS_VehicleMaster_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0FE8   (0x0008)  
	UStaticMeshComponent*                              Lugatti_R_Door_Window;                                      // 0x0FF0   (0x0008)  
	UStaticMeshComponent*                              Lugatti_L_Door_Window;                                      // 0x0FF8   (0x0008)  
	UStaticMeshComponent*                              Lugatti_StaticMesh;                                         // 0x1000   (0x0008)  
	UStaticMeshComponent*                              Lugatti_R_Door;                                             // 0x1008   (0x0008)  
	UStaticMeshComponent*                              Lugatti_L_Door;                                             // 0x1010   (0x0008)  
	UStaticMeshComponent*                              Lugatti_F_Window;                                           // 0x1018   (0x0008)  


	/// Functions
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Lugatti.AVS_Lugatti_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x2407bf0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Lugatti.AVS_Lugatti_C.AttachDoorToBone
	void AttachDoorToBone();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Lugatti.AVS_Lugatti_C.AttachDoorToMainMesh
	void AttachDoorToMainMesh();                                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Lugatti.AVS_Lugatti_C.GearChanged
	void GearChanged(int32_t PreviousGear, int32_t CurrentGear);                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Lugatti.AVS_Lugatti_C.ExecuteUbergraph_AVS_Lugatti
	void ExecuteUbergraph_AVS_Lugatti(int32_t EntryPoint);                                                                   // [0x2407bf0] Final                
};

/// Class /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Lambo.AVS_Lambo_C
/// Size: 0x0040 (0x000FE8 - 0x001028)
class AAVS_Lambo_C : public AAVS_VehicleMaster_C : AAVS_VehicleMaster_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0FE8   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC;                                           // 0x0FF0   (0x0008)  
	UStaticMeshComponent*                              LamboMurci_Kuzov_Lambo_Base_Window;                         // 0x0FF8   (0x0008)  
	UStaticMeshComponent*                              LamboMurci_DoorL_L_Door_Window;                             // 0x1000   (0x0008)  
	UStaticMeshComponent*                              LamboMurci_DoorR_R_Door_Window;                             // 0x1008   (0x0008)  
	UStaticMeshComponent*                              LamboMurci_Kuzov_Lambo_Base;                                // 0x1010   (0x0008)  
	UStaticMeshComponent*                              LamboMurci_DoorR_R_Door1;                                   // 0x1018   (0x0008)  
	UStaticMeshComponent*                              LamboMurci_DoorL_L_Door1;                                   // 0x1020   (0x0008)  


	/// Functions
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Lambo.AVS_Lambo_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x2407bf0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Lambo.AVS_Lambo_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Lambo.AVS_Lambo_C.AttachDoorToBone
	void AttachDoorToBone();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Lambo.AVS_Lambo_C.AttachDoorToMainMesh
	void AttachDoorToMainMesh();                                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Lambo.AVS_Lambo_C.GearChanged
	void GearChanged(int32_t PreviousGear, int32_t CurrentGear);                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Lambo.AVS_Lambo_C.ExecuteUbergraph_AVS_Lambo
	void ExecuteUbergraph_AVS_Lambo(int32_t EntryPoint);                                                                     // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Dodge.AVS_Dodge_C
/// Size: 0x0068 (0x000FE8 - 0x001050)
class AAVS_Dodge_C : public AAVS_VehicleMaster_C : AAVS_VehicleMaster_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0FE8   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC3;                                          // 0x0FF0   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC2;                                          // 0x0FF8   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC1;                                          // 0x1000   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC;                                           // 0x1008   (0x0008)  
	UStaticMeshComponent*                              DodgeChellenger_Body_Window;                                // 0x1010   (0x0008)  
	UStaticMeshComponent*                              DodgeChellenger_DoorL_Window;                               // 0x1018   (0x0008)  
	UStaticMeshComponent*                              DodgeChellenger_DoorR_Window;                               // 0x1020   (0x0008)  
	UStaticMeshComponent*                              DodgeChellenger_DoorR;                                      // 0x1028   (0x0008)  
	UStaticMeshComponent*                              DodgeChellenger_DoorL;                                      // 0x1030   (0x0008)  
	UStaticMeshComponent*                              DodgeChellenger_Body;                                       // 0x1038   (0x0008)  
	UStaticMeshComponent*                              Dodge_Burned_DoorR;                                         // 0x1040   (0x0008)  
	UStaticMeshComponent*                              Dodge_Burned_DoorL;                                         // 0x1048   (0x0008)  


	/// Functions
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Dodge.AVS_Dodge_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x2407bf0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Dodge.AVS_Dodge_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Dodge.AVS_Dodge_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2407bf0] Event|Public|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Dodge.AVS_Dodge_C.AttachDoorToBone
	void AttachDoorToBone();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Dodge.AVS_Dodge_C.AttachDoorToMainMesh
	void AttachDoorToMainMesh();                                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Dodge.AVS_Dodge_C.GearChanged
	void GearChanged(int32_t PreviousGear, int32_t CurrentGear);                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_Dodge.AVS_Dodge_C.ExecuteUbergraph_AVS_Dodge
	void ExecuteUbergraph_AVS_Dodge(int32_t EntryPoint);                                                                     // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_BugBolide.AVS_BugBolide_C
/// Size: 0x0040 (0x000FE8 - 0x001028)
class AAVS_BugBolide_C : public AAVS_VehicleMaster_C : AAVS_VehicleMaster_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0FE8   (0x0008)  
	UStaticMeshComponent*                              BugBolide_F_Window;                                         // 0x0FF0   (0x0008)  
	UStaticMeshComponent*                              BugBolide_L_Window;                                         // 0x0FF8   (0x0008)  
	UStaticMeshComponent*                              BugBolide_R_Window;                                         // 0x1000   (0x0008)  
	UStaticMeshComponent*                              BugBolide_StaticMesh;                                       // 0x1008   (0x0008)  
	UStaticMeshComponent*                              BugBolide_R_Door;                                           // 0x1010   (0x0008)  
	UStaticMeshComponent*                              BugBolide_L_Door;                                           // 0x1018   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC;                                           // 0x1020   (0x0008)  


	/// Functions
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_BugBolide.AVS_BugBolide_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x2407bf0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_BugBolide.AVS_BugBolide_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_BugBolide.AVS_BugBolide_C.AttachDoorToBone
	void AttachDoorToBone();                                                                                                 // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_BugBolide.AVS_BugBolide_C.AttachDoorToMainMesh
	void AttachDoorToMainMesh();                                                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_BugBolide.AVS_BugBolide_C.GearChanged
	void GearChanged(int32_t PreviousGear, int32_t CurrentGear);                                                             // [0x2407bf0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_BugBolide.AVS_BugBolide_C.ExecuteUbergraph_AVS_BugBolide
	void ExecuteUbergraph_AVS_BugBolide(int32_t EntryPoint);                                                                 // [0x2407bf0] Final|HasDefaults    
};

/// Class /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_AmgGClass.AVS_AmgGClass_C
/// Size: 0x0098 (0x000FE8 - 0x001080)
class AAVS_AmgGClass_C : public AAVS_VehicleMaster_C : AAVS_VehicleMaster_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0FE8   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_B_Window;                                         // 0x0FF0   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_F_Window;                                         // 0x0FF8   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_BL_Window;                                        // 0x1000   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_BR_Door_Window;                                   // 0x1008   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_FR_Door_Window;                                   // 0x1010   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_T_Window;                                         // 0x1018   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_BR_Window;                                        // 0x1020   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_BL_Door_Window;                                   // 0x1028   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_FL_Door_Window;                                   // 0x1030   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_FR_Door;                                          // 0x1038   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_FL_Door;                                          // 0x1040   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_BR_Door;                                          // 0x1048   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_BL_Door;                                          // 0x1050   (0x0008)  
	UStaticMeshComponent*                              AmgGclass_StaticMesh;                                       // 0x1058   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC1;                                          // 0x1060   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC;                                           // 0x1068   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC3;                                          // 0x1070   (0x0008)  
	UNiagaraComponent*                                 FlowmapBrush_NPC2;                                          // 0x1078   (0x0008)  


	/// Functions
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_AmgGClass.AVS_AmgGClass_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x2407bf0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_AmgGClass.AVS_AmgGClass_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x2407bf0] Event|Protected|BlueprintEvent 
	// Function /Game/Vehicle/Models/AdvancedVehicleSystem/AVS_AmgGClass.AVS_AmgGClass_C.AttachDoorToMainMesh
