
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package WidgetCarousel.

/// Struct /Script/WidgetCarousel.WidgetCarouselNavigationButtonStyle
/// Size: 0x0598 (0x000008 - 0x0005A0)
struct FWidgetCarouselNavigationButtonStyle : FSlateWidgetStyle
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FButtonStyle                                       InnerButtonStyle;                                           // 0x0010   (0x03F0)  
	FSlateBrush                                        NavigationButtonLeftImage;                                  // 0x0400   (0x00D0)  
	FSlateBrush                                        NavigationButtonRightImage;                                 // 0x04D0   (0x00D0)  
};

/// Struct /Script/WidgetCarousel.WidgetCarouselNavigationBarStyle
/// Size: 0x0CA8 (0x000008 - 0x000CB0)
struct FWidgetCarouselNavigationBarStyle : FSlateWidgetStyle
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0008   (0x0008)  MISSED
	FSlateBrush                                        HighlightBrush;                                             // 0x0010   (0x00D0)  
	FButtonStyle                                       LeftButtonStyle;                                            // 0x00E0   (0x03F0)  
	FButtonStyle                                       CenterButtonStyle;                                          // 0x04D0   (0x03F0)  
	FButtonStyle                                       RightButtonStyle;                                           // 0x08C0   (0x03F0)  
};

